/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align> {
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]

pub const RL_SYS_CONFIG_APPLY_SB: u32 = 0;
pub const RL_ADV_FRAME_DATA_CONFIG_SB: u32 = 1;
pub const RL_SYS_CONFIG_APPLY_SB_MAX: u32 = 2;
pub const RL_SYS_VERSION_SB: u32 = 0;
pub const RL_SYS_CPUFAULT_STATUS_SB: u32 = 1;
pub const RL_SYS_ESMFAULT_STATUS_SB: u32 = 2;
pub const RL_SYS_FRAME_CONFIG_GET_SB: u32 = 3;
pub const RL_SYS_ADV_FRAME_CONFIG_GET_SB: u32 = 4;
pub const RL_SYS_NUM_OF_STATUS_SBC: u32 = 5;
pub const RL_DEV_AE_MSSPOWERUPDONE_SB: u32 = 0;
pub const RL_DEV_AE_RFPOWERUPDONE_SB: u32 = 1;
pub const RL_DEV_AE_MSS_CPUFAULT_SB: u32 = 2;
pub const RL_DEV_AE_MSS_ESMFAULT_SB: u32 = 3;
pub const RL_DEV_AE_RESERVED0: u32 = 4;
pub const RL_DEV_AE_MSS_BOOTERRSTATUS_SB: u32 = 5;
pub const RL_DEV_AE_MSS_LATENTFLT_TEST_REPORT_SB: u32 = 6;
pub const RL_DEV_AE_MSS_PERIODIC_TEST_STATUS_SB: u32 = 7;
pub const RL_DEV_AE_MSS_RF_ERROR_STATUS_SB: u32 = 8;
pub const RL_DEV_AE_MSS_VMON_ERROR_STATUS_SB: u32 = 9;
pub const RL_DEV_AE_MSS_ADC_DATA_SB: u32 = 10;
pub const RL_DEV_AE_SB_MAX: u32 = 11;
pub const RL_SYS_AE_DEV_CPUFAULT_SB: u32 = 0;
pub const RL_SYS_AE_DEV_ESMFAULT_SB: u32 = 1;
pub const RL_SYS_NUM_OF_AE_DEVFAULT_REPO_SBC: u32 = 2;
pub const RL_RF_DFE_STATISTICS_REPORT_GET_SB: u32 = 0;
pub const RL_DEV_MEM_REGISTER_SB: u32 = 0;
pub const RL_DEV_NUM_OF_INTERN_CONF_SBC: u32 = 1;
pub const RL_SYS_NRESP_INVLD_OPCODE: u32 = 1;
pub const RL_SYS_NRESP_INVLD_MSGID: u32 = 2;
pub const RL_SYS_NRESP_INVLD_NUM_SB: u32 = 3;
pub const RL_SYS_NRESP_INVLD_SB_ID: u32 = 4;
pub const RL_SYS_NRESP_INVLD_SB_LEN: u32 = 5;
pub const RL_SYS_NRESP_SB_GET_ERROR: u32 = 6;
pub const RL_SYS_NRESP_SB_SET_ERROR: u32 = 7;
pub const RL_SYS_NRESP_SB_SET_INVL_DATA: u32 = 8;
pub const RL_SYS_NRESP_CRC_FAILED: u32 = 9;
pub const RL_SYS_NRESP_FILETYPE_MISMATCHED: u32 = 10;
pub const RL_SYS_NRESP_REG_WRITE_FAILED: u32 = 11;
pub const RL_SYS_NRESP_ERROR_RESRVD: u32 = 65535;
pub type __u_char = cty::c_uchar;
pub type __u_short = cty::c_ushort;
pub type __u_int = cty::c_uint;
pub type __u_long = cty::c_ulong;
pub type __int8_t = cty::c_schar;
pub type __uint8_t = cty::c_uchar;
pub type __int16_t = cty::c_short;
pub type __uint16_t = cty::c_ushort;
pub type __int32_t = cty::c_int;
pub type __uint32_t = cty::c_uint;
pub type __int64_t = cty::c_longlong;
pub type __uint64_t = cty::c_ulonglong;
pub type __quad_t = cty::c_longlong;
pub type __u_quad_t = cty::c_ulonglong;
pub type __intmax_t = cty::c_longlong;
pub type __uintmax_t = cty::c_ulonglong;
pub type __dev_t = __u_quad_t;
pub type __uid_t = cty::c_uint;
pub type __gid_t = cty::c_uint;
pub type __ino_t = cty::c_ulong;
pub type __ino64_t = __u_quad_t;
pub type __mode_t = cty::c_uint;
pub type __nlink_t = cty::c_uint;
pub type __off_t = cty::c_long;
pub type __off64_t = __quad_t;
pub type __pid_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [cty::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = cty::c_long;
pub type __rlim_t = cty::c_ulong;
pub type __rlim64_t = __u_quad_t;
pub type __id_t = cty::c_uint;
pub type __time_t = cty::c_long;
pub type __useconds_t = cty::c_uint;
pub type __suseconds_t = cty::c_long;
pub type __daddr_t = cty::c_int;
pub type __key_t = cty::c_int;
pub type __clockid_t = cty::c_int;
pub type __timer_t = *mut cty::c_void;
pub type __blksize_t = cty::c_long;
pub type __blkcnt_t = cty::c_long;
pub type __blkcnt64_t = __quad_t;
pub type __fsblkcnt_t = cty::c_ulong;
pub type __fsblkcnt64_t = __u_quad_t;
pub type __fsfilcnt_t = cty::c_ulong;
pub type __fsfilcnt64_t = __u_quad_t;
pub type __fsword_t = cty::c_int;
pub type __ssize_t = cty::c_int;
pub type __syscall_slong_t = cty::c_long;
pub type __syscall_ulong_t = cty::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut cty::c_char;
pub type __intptr_t = cty::c_int;
pub type __socklen_t = cty::c_uint;
pub type __sig_atomic_t = cty::c_int;
pub type int_least8_t = cty::c_schar;
pub type int_least16_t = cty::c_short;
pub type int_least32_t = cty::c_int;
pub type int_least64_t = cty::c_longlong;
pub type uint_least8_t = cty::c_uchar;
pub type uint_least16_t = cty::c_ushort;
pub type uint_least32_t = cty::c_uint;
pub type uint_least64_t = cty::c_ulonglong;
pub type int_fast8_t = cty::c_schar;
pub type int_fast16_t = cty::c_int;
pub type int_fast32_t = cty::c_int;
pub type int_fast64_t = cty::c_longlong;
pub type uint_fast8_t = cty::c_uchar;
pub type uint_fast16_t = cty::c_uint;
pub type uint_fast32_t = cty::c_uint;
pub type uint_fast64_t = cty::c_ulonglong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type size_t = cty::c_uint;
pub type wchar_t = cty::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: cty::c_longlong,
    pub __clang_max_align_nonce2: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        16usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        8usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
extern "C" {
    pub fn memcpy(
        __dest: *mut cty::c_void,
        __src: *const cty::c_void,
        __n: cty::c_uint,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut cty::c_void,
        __src: *const cty::c_void,
        __n: cty::c_uint,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut cty::c_void,
        __src: *const cty::c_void,
        __c: cty::c_int,
        __n: size_t,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn memset(__s: *mut cty::c_void, __c: cty::c_int, __n: cty::c_uint) -> *mut cty::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const cty::c_void,
        __s2: *const cty::c_void,
        __n: cty::c_uint,
    ) -> cty::c_int;
}
extern "C" {
    pub fn memchr(__s: *const cty::c_void, __c: cty::c_int, __n: cty::c_uint) -> *mut cty::c_void;
}
extern "C" {
    pub fn strcpy(__dest: *mut cty::c_char, __src: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut cty::c_char,
        __src: *const cty::c_char,
        __n: cty::c_uint,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn strcat(__dest: *mut cty::c_char, __src: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut cty::c_char,
        __src: *const cty::c_char,
        __n: cty::c_uint,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn strcmp(__s1: *const cty::c_char, __s2: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const cty::c_char,
        __s2: *const cty::c_char,
        __n: cty::c_uint,
    ) -> cty::c_int;
}
extern "C" {
    pub fn strcoll(__s1: *const cty::c_char, __s2: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut cty::c_char,
        __src: *const cty::c_char,
        __n: cty::c_uint,
    ) -> cty::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const cty::c_ushort,
    pub __ctype_tolower: *const cty::c_int,
    pub __ctype_toupper: *const cty::c_int,
    pub __names: [*const cty::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::core::mem::size_of::<__locale_struct>(),
        116usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::core::mem::align_of::<__locale_struct>(),
        4usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
impl Default for __locale_struct {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const cty::c_char,
        __s2: *const cty::c_char,
        __l: locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut cty::c_char,
        __src: *const cty::c_char,
        __n: size_t,
        __l: locale_t,
    ) -> size_t;
}
extern "C" {
    pub fn strdup(__s: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn strndup(__string: *const cty::c_char, __n: cty::c_uint) -> *mut cty::c_char;
}
extern "C" {
    pub fn strchr(__s: *const cty::c_char, __c: cty::c_int) -> *mut cty::c_char;
}
extern "C" {
    pub fn strrchr(__s: *const cty::c_char, __c: cty::c_int) -> *mut cty::c_char;
}
extern "C" {
    pub fn strcspn(__s: *const cty::c_char, __reject: *const cty::c_char) -> cty::c_uint;
}
extern "C" {
    pub fn strspn(__s: *const cty::c_char, __accept: *const cty::c_char) -> cty::c_uint;
}
extern "C" {
    pub fn strpbrk(__s: *const cty::c_char, __accept: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn strstr(__haystack: *const cty::c_char, __needle: *const cty::c_char)
        -> *mut cty::c_char;
}
extern "C" {
    pub fn strtok(__s: *mut cty::c_char, __delim: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut cty::c_char,
        __delim: *const cty::c_char,
        __save_ptr: *mut *mut cty::c_char,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut cty::c_char,
        __delim: *const cty::c_char,
        __save_ptr: *mut *mut cty::c_char,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn strlen(__s: *const cty::c_char) -> cty::c_uint;
}
extern "C" {
    pub fn strnlen(__string: *const cty::c_char, __maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn strerror(__errnum: cty::c_int) -> *mut cty::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: cty::c_int,
        __buf: *mut cty::c_char,
        __buflen: size_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn strerror_l(__errnum: cty::c_int, __l: locale_t) -> *mut cty::c_char;
}
extern "C" {
    pub fn bcmp(__s1: *const cty::c_void, __s2: *const cty::c_void, __n: size_t) -> cty::c_int;
}
extern "C" {
    pub fn bcopy(__src: *const cty::c_void, __dest: *mut cty::c_void, __n: size_t);
}
extern "C" {
    pub fn bzero(__s: *mut cty::c_void, __n: cty::c_uint);
}
extern "C" {
    pub fn index(__s: *const cty::c_char, __c: cty::c_int) -> *mut cty::c_char;
}
extern "C" {
    pub fn rindex(__s: *const cty::c_char, __c: cty::c_int) -> *mut cty::c_char;
}
extern "C" {
    pub fn ffs(__i: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn ffsl(__l: cty::c_long) -> cty::c_int;
}
extern "C" {
    pub fn ffsll(__ll: cty::c_longlong) -> cty::c_int;
}
extern "C" {
    pub fn strcasecmp(__s1: *const cty::c_char, __s2: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const cty::c_char,
        __s2: *const cty::c_char,
        __n: cty::c_uint,
    ) -> cty::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const cty::c_char,
        __s2: *const cty::c_char,
        __loc: locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const cty::c_char,
        __s2: *const cty::c_char,
        __n: size_t,
        __loc: locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut cty::c_void, __n: size_t);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut cty::c_char,
        __delim: *const cty::c_char,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn strsignal(__sig: cty::c_int) -> *mut cty::c_char;
}
extern "C" {
    pub fn __stpcpy(__dest: *mut cty::c_char, __src: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn stpcpy(__dest: *mut cty::c_char, __src: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut cty::c_char,
        __src: *const cty::c_char,
        __n: size_t,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut cty::c_char,
        __src: *const cty::c_char,
        __n: cty::c_uint,
    ) -> *mut cty::c_char;
}
#[doc = " TYPE-DEFINE STRUCT/ENUM/UNION DEFINITIONS"]
#[doc = ""]
#[doc = " Standard C data types typedef"]
pub type rlUInt8_t = cty::c_uchar;
pub type rlUInt16_t = cty::c_ushort;
pub type rlUInt32_t = cty::c_uint;
pub type rlUInt64_t = cty::c_ulonglong;
pub type rlInt64_t = cty::c_longlong;
pub type rlInt8_t = cty::c_char;
pub type rlSInt8_t = cty::c_schar;
pub type rlInt16_t = cty::c_short;
pub type rlInt32_t = cty::c_int;
pub type rlVoid_t = cty::c_void;
#[doc = " \\brief"]
#[doc = " Communication Interface Handle"]
pub type rlComIfHdl_t = *mut cty::c_void;
#[doc = " \\brief"]
#[doc = " OS Message Queue Object Handle"]
pub type rlOsiMsgQHdl_t = *mut cty::c_void;
#[doc = " \\brief"]
#[doc = " OS Semaphore Object Handle"]
pub type rlOsiSemHdl_t = *mut cty::c_void;
#[doc = " \\brief"]
#[doc = " OS Mutex Object Handle"]
pub type rlOsiMutexHdl_t = *mut cty::c_void;
#[doc = " \\brief"]
#[doc = " OS Time data type"]
pub type rlOsiTime_t = rlUInt32_t;
#[doc = " \\brief"]
#[doc = " mmWaveLink API return type"]
pub type rlReturnVal_t = rlInt32_t;
#[doc = " \\brief"]
#[doc = " mmWaveLink Support CRC type"]
pub type rlCrcType_t = rlUInt8_t;
#[doc = " \\brief"]
#[doc = " mmWaveLink Spawn Task Function"]
pub type RL_P_OSI_SPAWN_ENTRY =
    ::core::option::Option<unsafe extern "C" fn(pValue: *const cty::c_void)>;
#[doc = " \\brief"]
#[doc = " mmWaveLink Event Handler callback"]
pub type RL_P_EVENT_HANDLER =
    ::core::option::Option<unsafe extern "C" fn(deviceIndex: rlUInt8_t, pValue: *mut cty::c_void)>;
#[doc = " \\brief"]
#[doc = " Communication interface(SPI, MailBox, UART etc) callback functions"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlComIfCbs {
    #[doc = " @fn rlComIfHdl_t (*rlComIfOpen)(rlUInt8_t deviceIndex, rlUInt32_t flags)"]
    #[doc = ""]
    #[doc = "...@brief Open Communication interface"]
    #[doc = "   @param[in] deviceIndex - Communication Interface to Open"]
    #[doc = "   @param[in] flags - Flags to configure the interface"]
    #[doc = ""]
    #[doc = "   @return rlComIfHdl_t Handle to access the communication interface"]
    #[doc = ""]
    #[doc = "   Open Communication interface"]
    pub rlComIfOpen: ::core::option::Option<
        unsafe extern "C" fn(deviceIndex: rlUInt8_t, flags: rlUInt32_t) -> rlComIfHdl_t,
    >,
    #[doc = " @fn rlInt32_t (*rlComIfRead)(rlComIfHdl_t fd, rlUInt8_t *pBuff, rlUInt16_t len)"]
    #[doc = ""]
    #[doc = "   @brief Read Data from Communication interface"]
    #[doc = "   @param[in] fd - Handle to access the communication interface"]
    #[doc = "   @param[out] pBuff - Buffer to store data from communication interface"]
    #[doc = "   @param[in] len - Read size in bytes"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Length of received data"]
    #[doc = ""]
    #[doc = "   Read Data from Communication interface"]
    pub rlComIfRead: ::core::option::Option<
        unsafe extern "C" fn(fd: rlComIfHdl_t, pBuff: *mut rlUInt8_t, len: rlUInt16_t) -> rlInt32_t,
    >,
    #[doc = " @fn rlInt32_t (*rlComIfWrite)(rlComIfHdl_t fd, rlUInt8_t *pBuff, rlUInt16_t len)"]
    #[doc = ""]
    #[doc = "   @brief Write Data over Communication interface"]
    #[doc = "   @param[in] fd - Handle to access the communication interface"]
    #[doc = "   @param[in] pBuff - Buffer containing data to write over communication interface"]
    #[doc = "   @param[in] len - write size in bytes"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Length of data sent"]
    #[doc = ""]
    #[doc = "   Write Data over Communication interface"]
    pub rlComIfWrite: ::core::option::Option<
        unsafe extern "C" fn(fd: rlComIfHdl_t, pBuff: *mut rlUInt8_t, len: rlUInt16_t) -> rlInt32_t,
    >,
    #[doc = " @fn rlInt32_t (*rlComIfClose)(rlComIfHdl_t fd)"]
    #[doc = ""]
    #[doc = "   @brief Close the Communication interface"]
    #[doc = "   @param[in] fd - Handle to access the communication interface"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   Close the Communication interface"]
    pub rlComIfClose: ::core::option::Option<unsafe extern "C" fn(fd: rlComIfHdl_t) -> rlInt32_t>,
}
#[test]
fn bindgen_test_layout_rlComIfCbs() {
    assert_eq!(
        ::core::mem::size_of::<rlComIfCbs>(),
        16usize,
        concat!("Size of: ", stringify!(rlComIfCbs))
    );
    assert_eq!(
        ::core::mem::align_of::<rlComIfCbs>(),
        4usize,
        concat!("Alignment of ", stringify!(rlComIfCbs))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlComIfCbs>())).rlComIfOpen as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlComIfCbs),
            "::",
            stringify!(rlComIfOpen)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlComIfCbs>())).rlComIfRead as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlComIfCbs),
            "::",
            stringify!(rlComIfRead)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlComIfCbs>())).rlComIfWrite as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlComIfCbs),
            "::",
            stringify!(rlComIfWrite)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlComIfCbs>())).rlComIfClose as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlComIfCbs),
            "::",
            stringify!(rlComIfClose)
        )
    );
}
pub type rlComIfCbs_t = rlComIfCbs;
#[doc = " \\brief"]
#[doc = " OS mutex callback functions"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlOsiMutexCbs {
    #[doc = " @fn rlInt32_t (*rlOsiMutexCreate)(rlOsiMutexHdl_t* mutexHdl, rlInt8_t* name)"]
    #[doc = ""]
    #[doc = "   @brief Create Mutex Object"]
    #[doc = "   @param[in] name      - Name to associate with Mutex Object"]
    #[doc = "   @param[out] mutexHdl - Pointer to Mutex object"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   Create Mutex Object"]
    pub rlOsiMutexCreate: ::core::option::Option<
        unsafe extern "C" fn(mutexHdl: *mut rlOsiMutexHdl_t, name: *mut rlInt8_t) -> rlInt32_t,
    >,
    #[doc = " @fn rlInt32_t (*rlOsiMutexLock)(rlOsiMutexHdl_t* mutexHdl, rlOsiTime_t timeout)"]
    #[doc = ""]
    #[doc = "   @brief Lock Mutex Object"]
    #[doc = "   @param[in] mutexHdl - Pointer to Mutex object"]
    #[doc = "   @param[in] timeout  - Maximum Time to wait for Mutex Lock"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   OSI Lock Mutex Object."]
    #[doc = "   mmWaveLink requires this Mutex object to be locked to avoid any parallel API"]
    #[doc = "   call for the same device instance. In one of the case when mmWaveLink is"]
    #[doc = "   underway for a command-response and device sends Async-event message in between,"]
    #[doc = "   so at this instance mmWaveLink will try to lock the same Mutex again. Expectation"]
    #[doc = "   is that command-response sequence should complete first and that flow unlocks this Mutex"]
    #[doc = "   and then only at other context mmWaveLink will cater the Async-event (HostIrq) request."]
    #[doc = "   mmWaveLink passes timeout as max value, where it expects to lock the Mutex for max period."]
    #[doc = "   Any non-zero return value will be treated as error and mmWaveLink will generate"]
    #[doc = "   async-event message [SBID RL_RET_CODE_RADAR_OSIF_ERROR] with payload of error code (-10)."]
    #[doc = "   This error async-event will be generated only in the interrupt context while catering any"]
    #[doc = "   AWR device's async-event message whereas during the CMD-RSP flow that API will return with"]
    #[doc = "   error code (-10)."]
    pub rlOsiMutexLock: ::core::option::Option<
        unsafe extern "C" fn(mutexHdl: *mut rlOsiMutexHdl_t, timeout: rlOsiTime_t) -> rlInt32_t,
    >,
    #[doc = " @fn rlInt32_t (*rlOsiMutexUnLock)(rlOsiMutexHdl_t* mutexHdl)"]
    #[doc = ""]
    #[doc = "   @brief Unlock Mutex Object"]
    #[doc = "   @param[in] mutexHdl - Pointer to Mutex object"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   Unlock Mutex Object. Any non-zero return value will be treated as error and mmWaveLink"]
    #[doc = "   will return its own error code (-10)."]
    pub rlOsiMutexUnLock:
        ::core::option::Option<unsafe extern "C" fn(mutexHdl: *mut rlOsiMutexHdl_t) -> rlInt32_t>,
    #[doc = " @fn rlInt32_t (*rlOsiMutexDelete)(rlOsiMutexHdl_t* mutexHdl)"]
    #[doc = ""]
    #[doc = "   @brief Destroy Mutex Object"]
    #[doc = "   @param[in] mutexHdl - Pointer to Mutex object"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   Destroy Mutex Object"]
    pub rlOsiMutexDelete:
        ::core::option::Option<unsafe extern "C" fn(mutexHdl: *mut rlOsiMutexHdl_t) -> rlInt32_t>,
}
#[test]
fn bindgen_test_layout_rlOsiMutexCbs() {
    assert_eq!(
        ::core::mem::size_of::<rlOsiMutexCbs>(),
        16usize,
        concat!("Size of: ", stringify!(rlOsiMutexCbs))
    );
    assert_eq!(
        ::core::mem::align_of::<rlOsiMutexCbs>(),
        4usize,
        concat!("Alignment of ", stringify!(rlOsiMutexCbs))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlOsiMutexCbs>())).rlOsiMutexCreate as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlOsiMutexCbs),
            "::",
            stringify!(rlOsiMutexCreate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlOsiMutexCbs>())).rlOsiMutexLock as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlOsiMutexCbs),
            "::",
            stringify!(rlOsiMutexLock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlOsiMutexCbs>())).rlOsiMutexUnLock as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlOsiMutexCbs),
            "::",
            stringify!(rlOsiMutexUnLock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlOsiMutexCbs>())).rlOsiMutexDelete as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlOsiMutexCbs),
            "::",
            stringify!(rlOsiMutexDelete)
        )
    );
}
pub type rlOsiMutexCbs_t = rlOsiMutexCbs;
#[doc = " \\brief"]
#[doc = " OS semaphore callback functions"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlOsiSemCbs {
    #[doc = " @fn rlInt32_t (*rlOsiSemCreate)(rlOsiSemHdl_t* semHdl, rlInt8_t* name)"]
    #[doc = ""]
    #[doc = "   @brief Create Semaphore Object"]
    #[doc = "   @param[in] name      - Name to associate with Sem Object"]
    #[doc = "   @param[out] semHdl   - Pointer to Sem object"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   Create Semaphore Object"]
    pub rlOsiSemCreate: ::core::option::Option<
        unsafe extern "C" fn(semHdl: *mut rlOsiSemHdl_t, name: *mut rlInt8_t) -> rlInt32_t,
    >,
    #[doc = " @fn rlInt32_t (*rlOsiSemWait)(rlOsiSemHdl_t* semHdl, rlOsiTime_t timeout)"]
    #[doc = ""]
    #[doc = "   @brief Wait for Semaphore"]
    #[doc = "   @param[in] semHdl   - Pointer to Sem object"]
    #[doc = "   @param[in] timeout  - Maximum Time to wait for Semaphore"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   Wait for Semaphore"]
    pub rlOsiSemWait: ::core::option::Option<
        unsafe extern "C" fn(semHdl: *mut rlOsiSemHdl_t, timeout: rlOsiTime_t) -> rlInt32_t,
    >,
    #[doc = " @fn rlInt32_t (*rlOsiSemSignal)(rlOsiSemHdl_t* semHdl)"]
    #[doc = ""]
    #[doc = "   @brief Release Semaphore"]
    #[doc = "   @param[in] semHdl - Pointer to Sem object"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   Release Semaphore"]
    pub rlOsiSemSignal:
        ::core::option::Option<unsafe extern "C" fn(semHdl: *mut rlOsiSemHdl_t) -> rlInt32_t>,
    #[doc = " @fn rlInt32_t (*rlOsiSemDelete)(rlOsiSemHdl_t* semHdl)"]
    #[doc = ""]
    #[doc = "   @brief Destroy Semaphore Object"]
    #[doc = "   @param[in] semHdl - Pointer to Sem object"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   Destroy Semaphore Object"]
    pub rlOsiSemDelete:
        ::core::option::Option<unsafe extern "C" fn(semHdl: *mut rlOsiSemHdl_t) -> rlInt32_t>,
}
#[test]
fn bindgen_test_layout_rlOsiSemCbs() {
    assert_eq!(
        ::core::mem::size_of::<rlOsiSemCbs>(),
        16usize,
        concat!("Size of: ", stringify!(rlOsiSemCbs))
    );
    assert_eq!(
        ::core::mem::align_of::<rlOsiSemCbs>(),
        4usize,
        concat!("Alignment of ", stringify!(rlOsiSemCbs))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlOsiSemCbs>())).rlOsiSemCreate as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlOsiSemCbs),
            "::",
            stringify!(rlOsiSemCreate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlOsiSemCbs>())).rlOsiSemWait as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlOsiSemCbs),
            "::",
            stringify!(rlOsiSemWait)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlOsiSemCbs>())).rlOsiSemSignal as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlOsiSemCbs),
            "::",
            stringify!(rlOsiSemSignal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlOsiSemCbs>())).rlOsiSemDelete as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlOsiSemCbs),
            "::",
            stringify!(rlOsiSemDelete)
        )
    );
}
pub type rlOsiSemCbs_t = rlOsiSemCbs;
#[doc = " \\brief"]
#[doc = " OS message queue/Spawn callback functions"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlOsiMsgQCbs {
    #[doc = " @fn rlInt32_t (*rlOsiSpawn)(RL_P_OSI_SPAWN_ENTRY pEntry, void* pValue, rlUInt32_t flags)"]
    #[doc = ""]
    #[doc = "   @brief Calls a function in a different context"]
    #[doc = "   @param[in] pEntry - Pointer to Entry Function"]
    #[doc = "   @param[in] pValue - Pointer to data passed to function"]
    #[doc = "   @param[in] flags  - Flag to indicate preference"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   Calls a function in a different context. mmWaveLink Driver Interrupt handler function"]
    #[doc = "   invokes this interface to switch context so that Interrupt Service Routine is executed"]
    #[doc = "   immediately. mmWaveLink uses this callback function to invoke 'rlDriverMsgReadSpawnCtx'"]
    #[doc = "   funtion to read the async-event message in different interrupt context. Host should"]
    #[doc = "   able to handle the error code generated by 'rlDriverMsgReadSpawnCtx' spawned function."]
    pub rlOsiSpawn: ::core::option::Option<
        unsafe extern "C" fn(
            pEntry: RL_P_OSI_SPAWN_ENTRY,
            pValue: *const cty::c_void,
            flags: rlUInt32_t,
        ) -> rlInt32_t,
    >,
}
#[test]
fn bindgen_test_layout_rlOsiMsgQCbs() {
    assert_eq!(
        ::core::mem::size_of::<rlOsiMsgQCbs>(),
        4usize,
        concat!("Size of: ", stringify!(rlOsiMsgQCbs))
    );
    assert_eq!(
        ::core::mem::align_of::<rlOsiMsgQCbs>(),
        4usize,
        concat!("Alignment of ", stringify!(rlOsiMsgQCbs))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlOsiMsgQCbs>())).rlOsiSpawn as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlOsiMsgQCbs),
            "::",
            stringify!(rlOsiSpawn)
        )
    );
}
pub type rlOsiMsgQCbs_t = rlOsiMsgQCbs;
#[doc = " \\brief"]
#[doc = " OS services callback functions"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlOsiCbs {
    #[doc = " \\brief"]
    #[doc = " Mutex callback functions."]
    pub mutex: rlOsiMutexCbs_t,
    #[doc = " \\brief"]
    #[doc = " Semaphore callback functions."]
    pub sem: rlOsiSemCbs_t,
    #[doc = " \\brief"]
    #[doc = " OS message queue/Spawn callback functions."]
    pub queue: rlOsiMsgQCbs_t,
}
#[test]
fn bindgen_test_layout_rlOsiCbs() {
    assert_eq!(
        ::core::mem::size_of::<rlOsiCbs>(),
        36usize,
        concat!("Size of: ", stringify!(rlOsiCbs))
    );
    assert_eq!(
        ::core::mem::align_of::<rlOsiCbs>(),
        4usize,
        concat!("Alignment of ", stringify!(rlOsiCbs))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlOsiCbs>())).mutex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlOsiCbs),
            "::",
            stringify!(mutex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlOsiCbs>())).sem as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlOsiCbs),
            "::",
            stringify!(sem)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlOsiCbs>())).queue as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rlOsiCbs),
            "::",
            stringify!(queue)
        )
    );
}
pub type rlOsiCbs_t = rlOsiCbs;
#[doc = " \\brief"]
#[doc = " mmWaveLink Asynchronous event callback function"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlEventCbs {
    #[doc = " @fn void (*rlAsyncEvent)(rlUInt8_t devIndex, rlUInt16_t sbId, rlUInt16_t sbLen,"]
    #[doc = "                            rlUInt8_t *payload)"]
    #[doc = ""]
    #[doc = "   @brief Reports Asynchronous events from mmwave radar device such as"]
    #[doc = "   device status, exceptions etc"]
    #[doc = "   @param[in] devIndex - Device Index to identify source of event"]
    #[doc = "   @param[in] subId -  Sub-block Id"]
    #[doc = "   @param[in] subLen -  Sub-block data length"]
    #[doc = "   @param[in] payload - Sub-block data starting memory address"]
    #[doc = ""]
    #[doc = "   Reports Asynchronous events from mmwave radar device such as"]
    #[doc = "   device status, exceptions etc"]
    pub rlAsyncEvent: ::core::option::Option<
        unsafe extern "C" fn(
            devIndex: rlUInt8_t,
            subId: rlUInt16_t,
            subLen: rlUInt16_t,
            payload: *mut rlUInt8_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_rlEventCbs() {
    assert_eq!(
        ::core::mem::size_of::<rlEventCbs>(),
        4usize,
        concat!("Size of: ", stringify!(rlEventCbs))
    );
    assert_eq!(
        ::core::mem::align_of::<rlEventCbs>(),
        4usize,
        concat!("Alignment of ", stringify!(rlEventCbs))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlEventCbs>())).rlAsyncEvent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlEventCbs),
            "::",
            stringify!(rlAsyncEvent)
        )
    );
}
pub type rlEventCbs_t = rlEventCbs;
#[doc = " \\brief"]
#[doc = " mmWaveLink Timer callback functions"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlTimerCbs {
    pub rlDelay: ::core::option::Option<unsafe extern "C" fn(delay: rlUInt32_t) -> rlInt32_t>,
}
#[test]
fn bindgen_test_layout_rlTimerCbs() {
    assert_eq!(
        ::core::mem::size_of::<rlTimerCbs>(),
        4usize,
        concat!("Size of: ", stringify!(rlTimerCbs))
    );
    assert_eq!(
        ::core::mem::align_of::<rlTimerCbs>(),
        4usize,
        concat!("Alignment of ", stringify!(rlTimerCbs))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlTimerCbs>())).rlDelay as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlTimerCbs),
            "::",
            stringify!(rlDelay)
        )
    );
}
pub type rlTimerCbs_t = rlTimerCbs;
#[doc = " \\brief"]
#[doc = " mmWaveLink callback functions for Command parser"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlCmdParserCbs {
    pub rlCmdParser: ::core::option::Option<
        unsafe extern "C" fn(rxMsgClass: rlUInt8_t, inVal: rlInt32_t) -> rlInt32_t,
    >,
    pub rlPostCnysStep:
        ::core::option::Option<unsafe extern "C" fn(devIndex: rlUInt8_t) -> rlInt32_t>,
}
#[test]
fn bindgen_test_layout_rlCmdParserCbs() {
    assert_eq!(
        ::core::mem::size_of::<rlCmdParserCbs>(),
        8usize,
        concat!("Size of: ", stringify!(rlCmdParserCbs))
    );
    assert_eq!(
        ::core::mem::align_of::<rlCmdParserCbs>(),
        4usize,
        concat!("Alignment of ", stringify!(rlCmdParserCbs))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCmdParserCbs>())).rlCmdParser as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCmdParserCbs),
            "::",
            stringify!(rlCmdParser)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCmdParserCbs>())).rlPostCnysStep as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCmdParserCbs),
            "::",
            stringify!(rlPostCnysStep)
        )
    );
}
pub type rlCmdParserCbs_t = rlCmdParserCbs;
#[doc = " \\brief"]
#[doc = " mmWaveLink CRC callback function"]
#[doc = " @note : Device SPI protocol Limitation for AWR1243: The CRC length of the message"]
#[doc = " or Async-event shall be multiple of 4 bytes to enable reliable retry recovery"]
#[doc = " mechanism in case of any checksum failure in a message."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlCrcCbs {
    #[doc = " @fn rlInt32_t (*rlComputeCRC)(rlUInt8_t* data, rlUInt32_t dataLen, rlUInt8_t crcType,"]
    #[doc = "                  rlUInt8_t* crc)"]
    #[doc = ""]
    #[doc = "   @brief Compute CRC on the input message"]
    #[doc = "   @param[in] data - input message"]
    #[doc = "   @param[in] dataLen - size of input message in bytes"]
    #[doc = "   @param[in] crcType  - CRC type (0:RL_CRC_TYPE_16BIT_CCITT, 1:RL_CRC_TYPE_32BIT,"]
    #[doc = "                         2:RL_CRC_TYPE_64BIT_ISO)"]
    #[doc = "   @param[out] crc   - Computed CRC"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   Compute CRC on the input message"]
    pub rlComputeCRC: ::core::option::Option<
        unsafe extern "C" fn(
            data: *mut rlUInt8_t,
            dataLen: rlUInt32_t,
            crcType: rlUInt8_t,
            crc: *mut rlUInt8_t,
        ) -> rlInt32_t,
    >,
}
#[test]
fn bindgen_test_layout_rlCrcCbs() {
    assert_eq!(
        ::core::mem::size_of::<rlCrcCbs>(),
        4usize,
        concat!("Size of: ", stringify!(rlCrcCbs))
    );
    assert_eq!(
        ::core::mem::align_of::<rlCrcCbs>(),
        4usize,
        concat!("Alignment of ", stringify!(rlCrcCbs))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCrcCbs>())).rlComputeCRC as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCrcCbs),
            "::",
            stringify!(rlComputeCRC)
        )
    );
}
pub type rlCrcCbs_t = rlCrcCbs;
#[doc = " \\brief"]
#[doc = " mmWaveLink Device Control, Interrupt callback functions"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlDeviceCtrlCbs {
    #[doc = " @fn rlInt32_t (*rlDeviceEnable)(rlUInt8_t deviceIndex)"]
    #[doc = ""]
    #[doc = "   @brief Bring mmWave radar device out of Reset"]
    #[doc = "   @param[in] deviceIndex -  Index of the device to be enabled"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   Bring mmWave radar device out of Reset. Implement this function to assert the nReset"]
    #[doc = "   Pin in mmWave device. Optionally It might require to assert Sense on Power(SOP) Pins"]
    pub rlDeviceEnable:
        ::core::option::Option<unsafe extern "C" fn(deviceIndex: rlUInt8_t) -> rlInt32_t>,
    #[doc = " @fn rlInt32_t (*rlDeviceDisable)(rlUInt8_t deviceIndex)"]
    #[doc = ""]
    #[doc = "   @brief Power off mmWave radar device"]
    #[doc = "   @param[in] deviceIndex -  Index of the device to be disbaled"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   Power off mmWave radar device. Implement this function to de-assert the Reset"]
    #[doc = "   Pin in mmWave device"]
    pub rlDeviceDisable:
        ::core::option::Option<unsafe extern "C" fn(deviceIndex: rlUInt8_t) -> rlInt32_t>,
    #[doc = " @fn void (*rlDeviceMaskHostIrq)(rlComIfHdl_t fd)"]
    #[doc = ""]
    #[doc = "   @brief Masks Host Interrupt"]
    #[doc = "   @param[in] fd -  Handle of the device for which interrupt need to be masked"]
    #[doc = ""]
    #[doc = "   Masks Host Interrupt. If GPIO Interrupt is Level Triggered,"]
    #[doc = "   host need to mask the interrupt until the interrupt is serviced"]
    pub rlDeviceMaskHostIrq: ::core::option::Option<unsafe extern "C" fn(fd: rlComIfHdl_t)>,
    #[doc = " @fn void (*rlDeviceUnMaskHostIrq)(rlComIfHdl_t fd)"]
    #[doc = ""]
    #[doc = "   @brief Unmask Host Interrupt"]
    #[doc = "   @param[in] fd -  Handle of the device for which interrupt need to be unmasked"]
    #[doc = ""]
    #[doc = "   Unmask Host Interrupt. If GPIO Interrupt is Level Triggered,"]
    #[doc = "   host need to unmask the interrupt once interrupt is processed"]
    pub rlDeviceUnMaskHostIrq: ::core::option::Option<unsafe extern "C" fn(fd: rlComIfHdl_t)>,
    #[doc = " @fn rlInt32_t (*rlDeviceWaitIrqStatus)(rlComIfHdl_t fd, rlUInt8_t highLow)"]
    #[doc = ""]
    #[doc = "   @brief Polls Host Interrupt Status"]
    #[doc = "   @param[in] fd -  Handle of the device for which interrupt need to be polled"]
    #[doc = "   @param[in] highLow - Wait for IRQ Level(high/low)"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t IRQ Line Low - 0, IRQ Line High - 1"]
    #[doc = ""]
    #[doc = "   mmWave Radar device asserts host IRQ pin to get Host attention. After receiving host"]
    #[doc = "   interrupt, host polls Host Interrupt Status, Low on Host IRQ indicate that mmWave device"]
    #[doc = "   has written data on communication Interface. This callback should Wait for the IRQ status."]
    #[doc = "   The function waits for the IRQ Level(low/high) based on second argument returns once the"]
    #[doc = "   IRQ Level occurs. If HostIRQ is not toggled within timeout (less than ackTimeout), it"]
    #[doc = "   should return '-1' value so that it won't be blocked for infinite duration."]
    pub rlDeviceWaitIrqStatus: ::core::option::Option<
        unsafe extern "C" fn(fd: rlComIfHdl_t, highLow: rlUInt8_t) -> rlInt32_t,
    >,
    #[doc = " @fn rlUInt16_t (*rlCommIfAssertIrq)(rlUInt8_t highLow)"]
    #[doc = ""]
    #[doc = "   @brief It assert/de-assert Host IRQ hig/low on MSS to Host for SPI communication"]
    #[doc = "   @param[in] highLow - High/low value for Host IRQ"]
    #[doc = ""]
    #[doc = "   @return rlUInt16_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   It assert/de-assert Host IRQ hig/low on MSS to Host for SPI communication"]
    pub rlCommIfAssertIrq:
        ::core::option::Option<unsafe extern "C" fn(highLow: rlUInt8_t) -> rlUInt16_t>,
    #[doc = " @fn rlInt32_t (*rlRegisterInterruptHandler)(rlUInt8_t deviceIndex,"]
    #[doc = "                                               RL_P_EVENT_HANDLER pHandler, void* pValue)"]
    #[doc = ""]
    #[doc = "   @brief Register Host Interrupt Handler"]
    #[doc = "   @param[in] deviceIndex - Device Index to identify source of Host Interrupt"]
    #[doc = "   @param[in] pHandler - Interrupt Handler routine"]
    #[doc = "   @param[in] pValue   - To Pass any additional data"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success - 0, Failure - Error code"]
    #[doc = ""]
    #[doc = "   Register Host Interrupt Handler. The Application should store this function handler"]
    #[doc = "   and invoke when it receives host Interrupt. The application need to enable GPIO interrupt"]
    #[doc = "   in this callback. Event Handler Callback doesn't process the interrupt in the same context"]
    #[doc = "   so it is safe to call this handler from ISR directly."]
    pub rlRegisterInterruptHandler: ::core::option::Option<
        unsafe extern "C" fn(
            deviceIndex: rlUInt8_t,
            pHandler: RL_P_EVENT_HANDLER,
            pValue: *mut cty::c_void,
        ) -> rlInt32_t,
    >,
}
#[test]
fn bindgen_test_layout_rlDeviceCtrlCbs() {
    assert_eq!(
        ::core::mem::size_of::<rlDeviceCtrlCbs>(),
        28usize,
        concat!("Size of: ", stringify!(rlDeviceCtrlCbs))
    );
    assert_eq!(
        ::core::mem::align_of::<rlDeviceCtrlCbs>(),
        4usize,
        concat!("Alignment of ", stringify!(rlDeviceCtrlCbs))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlDeviceCtrlCbs>())).rlDeviceEnable as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDeviceCtrlCbs),
            "::",
            stringify!(rlDeviceEnable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlDeviceCtrlCbs>())).rlDeviceDisable as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDeviceCtrlCbs),
            "::",
            stringify!(rlDeviceDisable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlDeviceCtrlCbs>())).rlDeviceMaskHostIrq as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDeviceCtrlCbs),
            "::",
            stringify!(rlDeviceMaskHostIrq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlDeviceCtrlCbs>())).rlDeviceUnMaskHostIrq as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDeviceCtrlCbs),
            "::",
            stringify!(rlDeviceUnMaskHostIrq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlDeviceCtrlCbs>())).rlDeviceWaitIrqStatus as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDeviceCtrlCbs),
            "::",
            stringify!(rlDeviceWaitIrqStatus)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlDeviceCtrlCbs>())).rlCommIfAssertIrq as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDeviceCtrlCbs),
            "::",
            stringify!(rlCommIfAssertIrq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlDeviceCtrlCbs>())).rlRegisterInterruptHandler as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDeviceCtrlCbs),
            "::",
            stringify!(rlRegisterInterruptHandler)
        )
    );
}
pub type rlDeviceCtrlCbs_t = rlDeviceCtrlCbs;
#[doc = " \\brief"]
#[doc = " mmWaveLink print function prototype"]
pub type rlPrintFptr =
    ::core::option::Option<unsafe extern "C" fn(format: *const rlInt8_t, ...) -> rlInt32_t>;
#[doc = " \\brief"]
#[doc = " mmWaveLink debug callback structure"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlDbgCb {
    #[doc = " @fn rlInt32_t (*rlPrint)(const rlInt8_t* format, ...)"]
    #[doc = ""]
    #[doc = "   @brief Print input message as per the format in the input arguments"]
    #[doc = "   @param[in] format  - Format of message and arguments to be printed"]
    #[doc = "   @param[in] ...     - Multiple input arguments to be printed"]
    #[doc = ""]
    #[doc = "   @return rlInt32_t Success- Length of the message written in user's output console in bytes"]
    #[doc = "                     Failure- Negative value"]
    #[doc = ""]
    #[doc = "   Print input message as per the format in the input arguments"]
    pub rlPrint: rlPrintFptr,
    #[doc = " @brief User needs to set debug level such as error, warning, debug, verbose"]
    pub dbgLevel: rlUInt8_t,
}
#[test]
fn bindgen_test_layout_rlDbgCb() {
    assert_eq!(
        ::core::mem::size_of::<rlDbgCb>(),
        8usize,
        concat!("Size of: ", stringify!(rlDbgCb))
    );
    assert_eq!(
        ::core::mem::align_of::<rlDbgCb>(),
        4usize,
        concat!("Alignment of ", stringify!(rlDbgCb))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlDbgCb>())).rlPrint as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDbgCb),
            "::",
            stringify!(rlPrint)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlDbgCb>())).dbgLevel as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDbgCb),
            "::",
            stringify!(dbgLevel)
        )
    );
}
pub type rlDbgCb_t = rlDbgCb;
#[doc = " \\brief"]
#[doc = " mmWaveLink client callback structure"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlClientCbs {
    #[doc = " @brief  Comunication Interface Callback"]
    pub comIfCb: rlComIfCbs_t,
    #[doc = " @brief  Operating System Callback"]
    pub osiCb: rlOsiCbs_t,
    #[doc = " @brief  Event Callback, required to receive notification"]
    pub eventCb: rlEventCbs_t,
    #[doc = " @brief  Device Control Callback"]
    pub devCtrlCb: rlDeviceCtrlCbs_t,
    #[doc = " @brief  Timer Callback, required when ACK is enabled"]
    pub timerCb: rlTimerCbs_t,
    #[doc = " @brief Call back for parsing the Command received at MSS from the Host"]
    #[doc = "TI Internal Use only"]
    pub cmdParserCb: rlCmdParserCbs_t,
    #[doc = " @brief  CRC Callback, required when CRC is enabled"]
    pub crcCb: rlCrcCbs_t,
    #[doc = " @brief  CRC Types rlCrcType_t 16/32/64"]
    pub crcType: rlCrcType_t,
    #[doc = " @brief  ACK wait timeout in Milliseconds, 0 - No ACK"]
    #[doc = "Configuration of the timeout should consider interrupt"]
    #[doc = "latency in the processor."]
    pub ackTimeout: rlUInt32_t,
    #[doc = " @brief  0x0: mmWaveLink runs on Ext Host, \\n"]
    #[doc = "0x1: mmWaveLink runs on MSS, \\n"]
    #[doc = "0x2: mmWaveLink runs on DSS  \\n"]
    pub platform: rlUInt8_t,
    #[doc = " @brief  xWR1243 + HOST = 0x0, xWR1443 MSS = 0x1, xWR1642 MSS/DSS = 0x2, \\n"]
    #[doc = "xWR1843 MSS/DSS = 0x3, xWR6843 MSS/DSS = 0x4 \\n"]
    pub arDevType: rlUInt8_t,
    #[doc = " @brief  Debug Callback, required to receive Debug information"]
    pub dbgCb: rlDbgCb_t,
}
#[test]
fn bindgen_test_layout_rlClientCbs() {
    assert_eq!(
        ::core::mem::size_of::<rlClientCbs>(),
        120usize,
        concat!("Size of: ", stringify!(rlClientCbs))
    );
    assert_eq!(
        ::core::mem::align_of::<rlClientCbs>(),
        4usize,
        concat!("Alignment of ", stringify!(rlClientCbs))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlClientCbs>())).comIfCb as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlClientCbs),
            "::",
            stringify!(comIfCb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlClientCbs>())).osiCb as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlClientCbs),
            "::",
            stringify!(osiCb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlClientCbs>())).eventCb as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(rlClientCbs),
            "::",
            stringify!(eventCb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlClientCbs>())).devCtrlCb as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(rlClientCbs),
            "::",
            stringify!(devCtrlCb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlClientCbs>())).timerCb as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(rlClientCbs),
            "::",
            stringify!(timerCb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlClientCbs>())).cmdParserCb as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(rlClientCbs),
            "::",
            stringify!(cmdParserCb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlClientCbs>())).crcCb as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(rlClientCbs),
            "::",
            stringify!(crcCb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlClientCbs>())).crcType as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(rlClientCbs),
            "::",
            stringify!(crcType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlClientCbs>())).ackTimeout as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(rlClientCbs),
            "::",
            stringify!(ackTimeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlClientCbs>())).platform as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(rlClientCbs),
            "::",
            stringify!(platform)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlClientCbs>())).arDevType as *const _ as usize },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(rlClientCbs),
            "::",
            stringify!(arDevType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlClientCbs>())).dbgCb as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(rlClientCbs),
            "::",
            stringify!(dbgCb)
        )
    );
}
pub type rlClientCbs_t = rlClientCbs;
#[doc = " \\brief"]
#[doc = " mmWaveLink Init Complete data structure for event RL_DEV_AE_MSSPOWERUPDONE_SB"]
#[doc = " @note : The functional APIs shall be sent to radar device only after receiving"]
#[doc = "         RL_DEV_AE_MSSPOWERUPDONE_SB Async-event after power cycle."]
#[doc = "         In case of boot over SPI then functional APIs shall be sent to radar device only after"]
#[doc = "         receiving AWR_AE_MSS_BOOTERRORSTATUS_SB Async-event."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlInitComplete {
    #[doc = " @brief  masterSS powerup time, 1LSB = 5ns"]
    pub powerUpTime: rlUInt32_t,
    #[doc = " @brief  masterSS Bootup Status over SPI, 0 - PASS, 1- Fail \\n"]
    #[doc = "Bit   Error-description                                    \\n"]
    #[doc = "0     certificate authentication failure                   \\n"]
    #[doc = "1     certificate parser failure                           \\n"]
    #[doc = "2     Rprc image1 authentication failure                   \\n"]
    #[doc = "3     Rprc image2 authentication failure                   \\n"]
    #[doc = "4     Rprc image3 authentication failure                   \\n"]
    #[doc = "5     Rprc header not found                                \\n"]
    #[doc = "6     Meta header not found                                \\n"]
    #[doc = "7     S/W anti roll back check failure                     \\n"]
    #[doc = "8     Efuse integrity failure                              \\n"]
    #[doc = "9     certificate field validity failure                   \\n"]
    #[doc = "10    certificate field invalid authentication key index   \\n"]
    #[doc = "11    certificate field invalid hash type                  \\n"]
    #[doc = "12    certificate field invalid subsystem                  \\n"]
    #[doc = "13    certificate field invalid decrypt key index          \\n"]
    #[doc = "14    certificate field check efuse mismatch               \\n"]
    #[doc = "15    certificate field check 1 efuse mismatch             \\n"]
    #[doc = "16    certificate field check 2 efuse mismatch             \\n"]
    #[doc = "17    certificate field invalid subsystem bank allocation  \\n"]
    #[doc = "18    certificate field invalid total banks allocation     \\n"]
    #[doc = "19    Rprc parser file length mismatch                     \\n"]
    #[doc = "20    Rprc parser MSS file offset mismatch                 \\n"]
    #[doc = "21    Rprc parser BSS file offset mismatch                 \\n"]
    #[doc = "22    Rprc parser DSS file offset mismatch                 \\n"]
    #[doc = "23    certificate field invalid decrypt key                \\n"]
    #[doc = "24    certificate field invalid authentication key         \\n"]
    #[doc = "25    HS device certificate not present                    \\n"]
    #[doc = "26    Error in 2K image                                    \\n"]
    #[doc = "27    Shared memory allocation failed                      \\n"]
    #[doc = "28    MSS image not found                                  \\n"]
    #[doc = "29    Meta header num files error                          \\n"]
    #[doc = "30    Meta header CRC failure                              \\n"]
    #[doc = "31    Rprc image authentication failure                    \\n"]
    pub powerUpStatus1: rlUInt32_t,
    #[doc = " @brief  masterSS Bootup Status over SPI, 0 - PASS, 1- Fail \\n"]
    #[doc = "Bit   Error-description                                    \\n"]
    #[doc = "0     Rprc parser config file offset mismatch              \\n"]
    #[doc = "1     Boot extension extraction failure                    \\n"]
    #[doc = "2     Device user ID bad size                              \\n"]
    #[doc = "3     Key derived function bad size                        \\n"]
    #[doc = "4     HMAC bad size                                        \\n"]
    #[doc = "5     AES initialization vector bad size                   \\n"]
    #[doc = "6     Secure dev TI key erase failure                      \\n"]
    #[doc = "7     SOP5 SFlash not found                                \\n"]
    #[doc = "16    XTAL clock detection failure                         \\n"]
    #[doc = "17    Continue bootup on XTAL                              \\n"]
    #[doc = "18    DSP powerup timeout error                            \\n"]
    #[doc = "19    MSS LBIST failure                                    \\n"]
    #[doc = "20    DSP LBIST PBIST failure                              \\n"]
    #[doc = "21    PBIST single port memory failure                     \\n"]
    #[doc = "22    PBIST two port memory failure                        \\n"]
    #[doc = "23    Memory init failure                                  \\n"]
    #[doc = "24    MSS ROM PBIST CRC computation failure                \\n"]
    #[doc = "25    VMON error detected                                  \\n"]
    #[doc = "31    ESM NERROR detected                                  \\n"]
    pub powerUpStatus2: rlUInt32_t,
    #[doc = " @brief  masterSS Boot Test Status, 0 - PASS, 1 - FAIL \\n"]
    #[doc = "Bit      Status Information                      \\n"]
    #[doc = "0        MibSPI self-test                        \\n"]
    #[doc = "1        DMA self-test                           \\n"]
    #[doc = "2        RESERVED                                \\n"]
    #[doc = "3        RTI self-test                           \\n"]
    #[doc = "4        ESM self-test                           \\n"]
    #[doc = "5        EDMA self-test                          \\n"]
    #[doc = "6        CRC self-test                           \\n"]
    #[doc = "7        VIM self-test                           \\n"]
    #[doc = "8        MPU self-test                           \\n"]
    #[doc = "9        Mailbox self-test                       \\n"]
    #[doc = "10       RESERVED                                \\n"]
    #[doc = "11       RESERVED                                \\n"]
    #[doc = "12       RESERVED                                \\n"]
    #[doc = "13       MibSPI single bit error test            \\n"]
    #[doc = "14       MibSPI double bit error test            \\n"]
    #[doc = "15       DMA Parity error test                   \\n"]
    #[doc = "16       TCMA Single bit error test              \\n"]
    #[doc = "17       TCMB Single bit error test              \\n"]
    #[doc = "18       RESERVED                                \\n"]
    #[doc = "19       RESERVED                                \\n"]
    #[doc = "20       RESERVED                                \\n"]
    #[doc = "21       RESERVED                                \\n"]
    #[doc = "22       VIM lockstep test                       \\n"]
    #[doc = "23       CCM R4 lockstep test                    \\n"]
    #[doc = "24       DMA MPU region test                     \\n"]
    #[doc = "25       MSS Mailbox single bit error test       \\n"]
    #[doc = "26       MSS Mailbox double bit error test       \\n"]
    #[doc = "27       BSS Mailbox single bit error test       \\n"]
    #[doc = "28       BSS Mailbox double bit error test       \\n"]
    #[doc = "29       EDMA MPU test                           \\n"]
    #[doc = "30       EDMA parity test                        \\n"]
    #[doc = "31       RESERVED                                \\n"]
    pub bootTestStatus1: rlUInt32_t,
    #[doc = " @brief  masterSS Boot Test Status, 0 - PASS, 1 - FAIL \\n"]
    #[doc = "Bit      Status Information                      \\n"]
    #[doc = "0        RESERVED                                \\n"]
    #[doc = "1        RESERVED                                \\n"]
    #[doc = "2        PCR test                                \\n"]
    #[doc = "3        VIM RAM parity test                     \\n"]
    #[doc = "4        SCI boot time test                      \\n"]
    #[doc = "31:5     RESERVED                                \\n"]
    pub bootTestStatus2: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlInitComplete() {
    assert_eq!(
        ::core::mem::size_of::<rlInitComplete>(),
        20usize,
        concat!("Size of: ", stringify!(rlInitComplete))
    );
    assert_eq!(
        ::core::mem::align_of::<rlInitComplete>(),
        4usize,
        concat!("Alignment of ", stringify!(rlInitComplete))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlInitComplete>())).powerUpTime as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlInitComplete),
            "::",
            stringify!(powerUpTime)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlInitComplete>())).powerUpStatus1 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlInitComplete),
            "::",
            stringify!(powerUpStatus1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlInitComplete>())).powerUpStatus2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlInitComplete),
            "::",
            stringify!(powerUpStatus2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlInitComplete>())).bootTestStatus1 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlInitComplete),
            "::",
            stringify!(bootTestStatus1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlInitComplete>())).bootTestStatus2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlInitComplete),
            "::",
            stringify!(bootTestStatus2)
        )
    );
}
pub type rlInitComplete_t = rlInitComplete;
#[doc = " \\brief"]
#[doc = " mmWaveLink RF Start Complete data structure for event RL_DEV_AE_RFPOWERUPDONE_SB"]
#[doc = " @note : Bootup digital monitoring status are not applicable for QM devices"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlStartComplete {
    #[doc = " @brief  radarSS Boot Status, 1 - PASS, 0 - FAIL  \\n"]
    #[doc = "Bit Status Information                   \\n"]
    #[doc = "0    ROM CRC check                       \\n"]
    #[doc = "1    CR4 and VIM lockstep test           \\n"]
    #[doc = "2    RESERVED                            \\n"]
    #[doc = "3    VIM test (Not supported in 1st Gen devices, refer latest release note) \\n"]
    #[doc = "4    STC test of diagnostic              \\n"]
    #[doc = "5    CR4 STC                             \\n"]
    #[doc = "6    CRC test                            \\n"]
    #[doc = "7    RAMPGEN memory ECC test             \\n"]
    #[doc = "8    DFE Parity test (RESERVED in xWR6x43 devices) \\n"]
    #[doc = "9    DFE memory ECC                      \\n"]
    #[doc = "10   RAMPGEN lockstep test               \\n"]
    #[doc = "11   FRC lockstep test                   \\n"]
    #[doc = "12   DFE memory PBIST                    \\n"]
    #[doc = "13   RAMPGEN memory PBIST                \\n"]
    #[doc = "14   PBIST test                          \\n"]
    #[doc = "15   WDT test                            \\n"]
    #[doc = "16   ESM test                            \\n"]
    #[doc = "17   DFE STC                             \\n"]
    #[doc = "18   RESERVED                            \\n"]
    #[doc = "19   ATCM, BTCM ECC test                 \\n"]
    #[doc = "20   ATCM, BTCM parity test              \\n"]
    #[doc = "21   RESERVED                            \\n"]
    #[doc = "22   RESERVED                            \\n"]
    #[doc = "23   RESERVED                            \\n"]
    #[doc = "24   FFT test                            \\n"]
    #[doc = "25   RTI test                            \\n"]
    #[doc = "26   PCR test                            \\n"]
    #[doc = "27-31 RESERVED"]
    pub status: rlUInt32_t,
    #[doc = " @brief  radarSS powerup time, 1LSB = 5ns"]
    pub powerUpTime: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlStartComplete() {
    assert_eq!(
        ::core::mem::size_of::<rlStartComplete>(),
        16usize,
        concat!("Size of: ", stringify!(rlStartComplete))
    );
    assert_eq!(
        ::core::mem::align_of::<rlStartComplete>(),
        4usize,
        concat!("Alignment of ", stringify!(rlStartComplete))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlStartComplete>())).status as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlStartComplete),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlStartComplete>())).powerUpTime as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlStartComplete),
            "::",
            stringify!(powerUpTime)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlStartComplete>())).reserved0 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlStartComplete),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlStartComplete>())).reserved1 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlStartComplete),
            "::",
            stringify!(reserved1)
        )
    );
}
pub type rlStartComplete_t = rlStartComplete;
#[doc = " \\brief"]
#[doc = " Structure to hold the MSS ESM Fault data structure for event RL_DEV_AE_MSS_ESMFAULT_SB"]
#[doc = " @note : The FRC lockstep fatal error(BSS module error) is connected to MSS ESM Group 1 lines,"]
#[doc = "         This fatal error must be handled in Host in AWR1243 device (MSS or DSS in xWR1642,"]
#[doc = "         xWR1843 and xWR6843 devices)"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMssEsmFault {
    #[doc = " @brief  Bits Definition (0 -- No Error , 1 -- ESM Error)"]
    #[doc = "0  NERROR in sync \\n"]
    #[doc = "1  RESERVED \\n"]
    #[doc = "2  DMA MPU Region tests \\n"]
    #[doc = "3  DMA Parity error \\n"]
    #[doc = "4  RESERVED \\n"]
    #[doc = "5  RESERVED \\n"]
    #[doc = "6  DSS CSI parity error \\n"]
    #[doc = "7  TPCC parity error \\n"]
    #[doc = "8  CBUF ECC single bit error \\n"]
    #[doc = "9  CBUF ECC double bit error \\n"]
    #[doc = "10 RESERVED \\n"]
    #[doc = "11 RESERVED \\n"]
    #[doc = "12 RESERVED \\n"]
    #[doc = "13 Error response from the Peripheral when a DMA transfer is done \\n"]
    #[doc = "14 RESERVED \\n"]
    #[doc = "15 VIM RAM double bit errors \\n"]
    #[doc = "16 RESERVED \\n"]
    #[doc = "17 MibSPI double bit error test \\n"]
    #[doc = "18 DSS TPTC0 read MPU error \\n"]
    #[doc = "19 RESERVED \\n"]
    #[doc = "20 VIM RAM single bit errors \\n"]
    #[doc = "21 RESERVED \\n"]
    #[doc = "22 FRC Lockstep error \\n"]
    #[doc = "23 RESERVED \\n"]
    #[doc = "24 RESERVED \\n"]
    #[doc = "25 MibSPI single bit error test \\n"]
    #[doc = "26 TCMB0 RAM single bit errors \\n"]
    #[doc = "27 STC error \\n"]
    #[doc = "28 TCMB1 RAM single bit errors \\n"]
    #[doc = "29 DSS TPTC0 write MPU error \\n"]
    #[doc = "30 DCC compare error \\n"]
    #[doc = "31 CR4F self-test error.(test of error path by error forcing)  \\n"]
    pub esmGrp1Err: rlUInt32_t,
    #[doc = " @brief  Bits Definition \\n"]
    #[doc = "0  TCMA RAM single bit errors \\n"]
    #[doc = "1  RESERVED \\n"]
    #[doc = "2  RESERVED \\n"]
    #[doc = "3  DSS TPTC1 read MPU error \\n"]
    #[doc = "4  DSS TPTC1 write MPU error \\n"]
    #[doc = "5  RESERVED \\n"]
    #[doc = "6  Access error interrupt from FFT ACC \\n"]
    #[doc = "7  VIM Self-Test Error \\n"]
    #[doc = "8  RESERVED \\n"]
    #[doc = "9  RESERVED \\n"]
    #[doc = "10 RESERVED \\n"]
    #[doc = "11 RESERVED \\n"]
    #[doc = "12 RESERVED \\n"]
    #[doc = "13 RESERVED \\n"]
    #[doc = "14 RESERVED \\n"]
    #[doc = "15 RESERVED \\n"]
    #[doc = "16 RESERVED \\n"]
    #[doc = "17 RESERVED \\n"]
    #[doc = "18 RESERVED \\n"]
    #[doc = "19 RESERVED \\n"]
    #[doc = "20 RESERVED \\n"]
    #[doc = "21 RESERVED \\n"]
    #[doc = "22 RESERVED \\n"]
    #[doc = "23 RESERVED \\n"]
    #[doc = "24 RESERVED \\n"]
    #[doc = "25 radarSS to MSS ESM G2 Trigger \\n"]
    #[doc = "26 radarSS Mailbox single bit errors \\n"]
    #[doc = "27 radarSS Mailbox double bit errors \\n"]
    #[doc = "28 MSS Mailbox single bit errors \\n"]
    #[doc = "29 MSS Mailbox double bit errors \\n"]
    #[doc = "30 RESERVED \\n"]
    #[doc = "31 RESERVED \\n"]
    pub esmGrp2Err: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMssEsmFault() {
    assert_eq!(
        ::core::mem::size_of::<rlMssEsmFault>(),
        16usize,
        concat!("Size of: ", stringify!(rlMssEsmFault))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMssEsmFault>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMssEsmFault))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMssEsmFault>())).esmGrp1Err as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssEsmFault),
            "::",
            stringify!(esmGrp1Err)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMssEsmFault>())).esmGrp2Err as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssEsmFault),
            "::",
            stringify!(esmGrp2Err)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMssEsmFault>())).reserved0 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssEsmFault),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMssEsmFault>())).reserved1 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssEsmFault),
            "::",
            stringify!(reserved1)
        )
    );
}
pub type rlMssEsmFault_t = rlMssEsmFault;
#[doc = " \\brief"]
#[doc = " Structure to hold the MSS Boot error status data strucutre when booted over SPI"]
#[doc = " for event RL_DEV_AE_MSS_BOOTERRSTATUS_SB"]
#[doc = " @note : The functional APIs shall be sent to radar device only after receiving"]
#[doc = "         RL_DEV_AE_MSS_BOOTERRSTATUS_SB Async-event after boot over SPI (Flash is not connected)."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMssBootErrStatus {
    #[doc = " @brief  masterSS powerup time, 1LSB = 5ns"]
    pub powerUpTime: rlUInt32_t,
    #[doc = " @brief  masterSS Bootup Status over SPI, 0 - PASS, 1- Fail \\n"]
    #[doc = "Bit   Error-description                                    \\n"]
    #[doc = "0     certificate authentication failure                   \\n"]
    #[doc = "1     certificate parser failure                           \\n"]
    #[doc = "2     Rprc image1 authentication failure                   \\n"]
    #[doc = "3     Rprc image2 authentication failure                   \\n"]
    #[doc = "4     Rprc image3 authentication failure                   \\n"]
    #[doc = "5     Rprc header not found                                \\n"]
    #[doc = "6     Meta header not found                                \\n"]
    #[doc = "7     S/W anti roll back check failure                     \\n"]
    #[doc = "8     Efuse integrity failure                              \\n"]
    #[doc = "9     certificate field validity failure                   \\n"]
    #[doc = "10    certificate field invalid authentication key index   \\n"]
    #[doc = "11    certificate field invalid hash type                  \\n"]
    #[doc = "12    certificate field invalid subsystem                  \\n"]
    #[doc = "13    certificate field invalid decrypt key index          \\n"]
    #[doc = "14    certificate field check efuse mismatch               \\n"]
    #[doc = "15    certificate field check 1 efuse mismatch             \\n"]
    #[doc = "16    certificate field check 2 efuse mismatch             \\n"]
    #[doc = "17    certificate field invalid subsystem bank allocation  \\n"]
    #[doc = "18    certificate field invalid total banks allocation     \\n"]
    #[doc = "19    Rprc parser file length mismatch                     \\n"]
    #[doc = "20    Rprc parser MSS file offset mismatch                 \\n"]
    #[doc = "21    Rprc parser BSS file offset mismatch                 \\n"]
    #[doc = "22    Rprc parser DSS file offset mismatch                 \\n"]
    #[doc = "23    certificate field invalid decrypt key                \\n"]
    #[doc = "24    certificate field invalid authentication key         \\n"]
    #[doc = "25    HS device certificate not present                    \\n"]
    #[doc = "26    Error in 2K image                                    \\n"]
    #[doc = "27    Shared memory allocation failed                      \\n"]
    #[doc = "28    MSS image not found                                  \\n"]
    #[doc = "29    Meta header num files error                          \\n"]
    #[doc = "30    Meta header CRC failure                              \\n"]
    #[doc = "31    Rprc image authentication failure                    \\n"]
    pub powerUpStatus1: rlUInt32_t,
    #[doc = " @brief  masterSS Bootup Status over SPI, 0 - PASS, 1- Fail \\n"]
    #[doc = "Bit   Error-description                                    \\n"]
    #[doc = "0     Rprc parser config file offset mismatch              \\n"]
    #[doc = "1     Boot extension extraction failure                    \\n"]
    #[doc = "2     Device user ID bad size                              \\n"]
    #[doc = "3     Key derived function bad size                        \\n"]
    #[doc = "4     HMAC bad size                                        \\n"]
    #[doc = "5     AES initialization vector bad size                   \\n"]
    #[doc = "6     Secure dev TI key erase failure                      \\n"]
    #[doc = "7     SOP5 SFlash not found                                \\n"]
    #[doc = "16    XTAL clock detection failure                         \\n"]
    #[doc = "17    Continue bootup on XTAL                              \\n"]
    #[doc = "18    DSP powerup timeout error                            \\n"]
    #[doc = "19    MSS LBIST failure                                    \\n"]
    #[doc = "20    DSP LBIST PBIST failure                              \\n"]
    #[doc = "21    PBIST single port memory failure                     \\n"]
    #[doc = "22    PBIST two port memory failure                        \\n"]
    #[doc = "23    Memory init failure                                  \\n"]
    #[doc = "24    MSS ROM PBIST CRC computation failure                \\n"]
    #[doc = "25    VMON error detected                                  \\n"]
    #[doc = "31    ESM NERROR detected                                  \\n"]
    pub powerUpStatus2: rlUInt32_t,
    #[doc = " @brief  masterSS Boot Test Status, 0 - PASS, 1 - FAIL \\n"]
    #[doc = "Bit      Status Information                      \\n"]
    #[doc = "0        MibSPI self-test                        \\n"]
    #[doc = "1        DMA self-test                           \\n"]
    #[doc = "2        RESERVED                                \\n"]
    #[doc = "3        RTI self-test                           \\n"]
    #[doc = "4        ESM self-test                           \\n"]
    #[doc = "5        EDMA self-test                          \\n"]
    #[doc = "6        CRC self-test                           \\n"]
    #[doc = "7        VIM self-test                           \\n"]
    #[doc = "8        MPU self-test                           \\n"]
    #[doc = "9        Mailbox self-test                       \\n"]
    #[doc = "10       RESERVED                                \\n"]
    #[doc = "11       RESERVED                                \\n"]
    #[doc = "12       RESERVED                                \\n"]
    #[doc = "13       MibSPI single bit error test            \\n"]
    #[doc = "14       MibSPI double bit error test            \\n"]
    #[doc = "15       DMA Parity error test                   \\n"]
    #[doc = "16       TCMA Single bit error test              \\n"]
    #[doc = "17       TCMB Single bit error test              \\n"]
    #[doc = "18       RESERVED                                \\n"]
    #[doc = "19       RESERVED                                \\n"]
    #[doc = "20       RESERVED                                \\n"]
    #[doc = "21       RESERVED                                \\n"]
    #[doc = "22       VIM lockstep test                       \\n"]
    #[doc = "23       CCM R4 lockstep test                    \\n"]
    #[doc = "24       DMA MPU region test                     \\n"]
    #[doc = "25       MSS Mailbox single bit error test       \\n"]
    #[doc = "26       MSS Mailbox double bit error test       \\n"]
    #[doc = "27       BSS Mailbox single bit error test       \\n"]
    #[doc = "28       BSS Mailbox double bit error test       \\n"]
    #[doc = "29       EDMA MPU test                           \\n"]
    #[doc = "30       EDMA parity test                        \\n"]
    #[doc = "31       RESERVED                                \\n"]
    pub bootTestStatus1: rlUInt32_t,
    #[doc = " @brief  masterSS Boot Test Status, 0 - PASS, 1 - FAIL \\n"]
    #[doc = "Bit      Status Information                      \\n"]
    #[doc = "0        RESERVED                                \\n"]
    #[doc = "1        RESERVED                                \\n"]
    #[doc = "2        PCR test                                \\n"]
    #[doc = "3        VIM RAM parity test                     \\n"]
    #[doc = "4        SCI boot time test                      \\n"]
    #[doc = "31:5     RESERVED                                \\n"]
    pub bootTestStatus2: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMssBootErrStatus() {
    assert_eq!(
        ::core::mem::size_of::<rlMssBootErrStatus>(),
        20usize,
        concat!("Size of: ", stringify!(rlMssBootErrStatus))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMssBootErrStatus>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMssBootErrStatus))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMssBootErrStatus>())).powerUpTime as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssBootErrStatus),
            "::",
            stringify!(powerUpTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMssBootErrStatus>())).powerUpStatus1 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssBootErrStatus),
            "::",
            stringify!(powerUpStatus1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMssBootErrStatus>())).powerUpStatus2 as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssBootErrStatus),
            "::",
            stringify!(powerUpStatus2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMssBootErrStatus>())).bootTestStatus1 as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssBootErrStatus),
            "::",
            stringify!(bootTestStatus1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMssBootErrStatus>())).bootTestStatus2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssBootErrStatus),
            "::",
            stringify!(bootTestStatus2)
        )
    );
}
pub type rlMssBootErrStatus_t = rlMssBootErrStatus;
#[doc = " \\brief"]
#[doc = " Structure to hold the test status report of the latent fault tests data strucutre"]
#[doc = " for event RL_DEV_AE_MSS_LATENTFLT_TEST_REPORT_SB"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMssLatentFaultReport {
    #[doc = " @brief  1 - PASS, 0 - FAIL \\n"]
    #[doc = "Bits   Definition \\n"]
    #[doc = "0      RESERVED \\n"]
    #[doc = "1      DMA self-test \\n"]
    #[doc = "2      RESERVED \\n"]
    #[doc = "3      RTI self-test \\n"]
    #[doc = "4      RESERVED \\n"]
    #[doc = "5      EDMA self-test \\n"]
    #[doc = "6      CRC self-test \\n"]
    #[doc = "7      VIM self-test \\n"]
    #[doc = "8      RESERVED \\n"]
    #[doc = "9      Mailbox self-test \\n"]
    #[doc = "10     RESERVED \\n"]
    #[doc = "11     RESERVED \\n"]
    #[doc = "12     Generating NERROR \\n"]
    #[doc = "13     MibSPI single bit error test \\n"]
    #[doc = "14     MibSPI double bit error test \\n"]
    #[doc = "15     DMA Parity error \\n"]
    #[doc = "16     TCMA RAM single bit errors (Not supported, refer latest release note) \\n"]
    #[doc = "17     TCMB RAM single bit errors (Not supported, refer latest release note) \\n"]
    #[doc = "18     TCMA RAM double bit errors (Not supported, refer latest release note) \\n"]
    #[doc = "19     TCMB RAM double bit errors (Not supported, refer latest release note) \\n"]
    #[doc = "20     TCMA RAM parity errors (Not supported, refer latest release note) \\n"]
    #[doc = "21     TCMB RAM parity errors (Not supported, refer latest release note) \\n"]
    #[doc = "22     RESERVED \\n"]
    #[doc = "23     RESERVED \\n"]
    #[doc = "24     DMA MPU Region tests \\n"]
    #[doc = "25     MSS Mailbox single bit errors \\n"]
    #[doc = "26     MSS Mailbox double bit errors \\n"]
    #[doc = "27     radarSS Mailbox single bit errors \\n"]
    #[doc = "28     radarSS Mailbox double bit errors \\n"]
    #[doc = "29     EDMA MPU test \\n"]
    #[doc = "30     EDMA parity test \\n"]
    #[doc = "31     CSI2 parity test \\n"]
    pub testStatusFlg1: rlUInt32_t,
    #[doc = " @brief  1 - PASS, 0 - FAIL \\n"]
    #[doc = "Bits   Definition \\n"]
    #[doc = "0      RESERVED \\n"]
    #[doc = "1      RESERVED \\n"]
    #[doc = "2      RESERVED \\n"]
    #[doc = "3      VIM RAM parity test \\n"]
    #[doc = "4      SCI boot time test \\n"]
    #[doc = "31:5   RESERVED \\n"]
    pub testStatusFlg2: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMssLatentFaultReport() {
    assert_eq!(
        ::core::mem::size_of::<rlMssLatentFaultReport>(),
        12usize,
        concat!("Size of: ", stringify!(rlMssLatentFaultReport))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMssLatentFaultReport>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMssLatentFaultReport))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMssLatentFaultReport>())).testStatusFlg1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssLatentFaultReport),
            "::",
            stringify!(testStatusFlg1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMssLatentFaultReport>())).testStatusFlg2 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssLatentFaultReport),
            "::",
            stringify!(testStatusFlg2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMssLatentFaultReport>())).reserved as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssLatentFaultReport),
            "::",
            stringify!(reserved)
        )
    );
}
pub type rlMssLatentFaultReport_t = rlMssLatentFaultReport;
#[doc = " \\brief"]
#[doc = " Structure to hold data strucutre for test status of the periodic tests"]
#[doc = " for event RL_DEV_AE_MSS_PERIODIC_TEST_STATUS_SB"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMssPeriodicTestStatus {
    #[doc = " @brief  1 - PASS, 0 - FAIL \\n"]
    #[doc = "Bits Definition \\n"]
    #[doc = "0    Periodic read back of static registers \\n"]
    #[doc = "1    ESM self-test \\n"]
    #[doc = "31:2 RESERVED \\n"]
    pub testStatusFlg: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMssPeriodicTestStatus() {
    assert_eq!(
        ::core::mem::size_of::<rlMssPeriodicTestStatus>(),
        8usize,
        concat!("Size of: ", stringify!(rlMssPeriodicTestStatus))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMssPeriodicTestStatus>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMssPeriodicTestStatus))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMssPeriodicTestStatus>())).testStatusFlg as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssPeriodicTestStatus),
            "::",
            stringify!(testStatusFlg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMssPeriodicTestStatus>())).reserved as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssPeriodicTestStatus),
            "::",
            stringify!(reserved)
        )
    );
}
pub type rlMssPeriodicTestStatus_t = rlMssPeriodicTestStatus;
#[doc = " \\brief"]
#[doc = " Structure to hold data strucutre for RF-error status send by MSS"]
#[doc = " for event RL_DEV_AE_MSS_RF_ERROR_STATUS_SB"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMssRfErrStatus {
    #[doc = " @brief  Value    Definition \\n"]
    #[doc = "0     No fault \\n"]
    #[doc = "1     radarSS FW assert \\n"]
    #[doc = "2     radarSS FW abort \\n"]
    #[doc = "3     radarSS ESM GROUP1 ERROR \\n"]
    #[doc = "4     radarSS ESM GROUP2 ERROR \\n"]
    #[doc = "6:5   RESERVED \\n"]
    #[doc = "7     BSS monitoring failure in Mode 1(Quiet mode) \\n"]
    #[doc = "31:8  RESERVED \\n"]
    pub errStatusFlg: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMssRfErrStatus() {
    assert_eq!(
        ::core::mem::size_of::<rlMssRfErrStatus>(),
        8usize,
        concat!("Size of: ", stringify!(rlMssRfErrStatus))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMssRfErrStatus>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMssRfErrStatus))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMssRfErrStatus>())).errStatusFlg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssRfErrStatus),
            "::",
            stringify!(errStatusFlg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMssRfErrStatus>())).reserved as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMssRfErrStatus),
            "::",
            stringify!(reserved)
        )
    );
}
pub type rlMssRfErrStatus_t = rlMssRfErrStatus;
#[doc = " \\brief"]
#[doc = " Structure to hold the BSS ESM Fault data strucutre for event RL_RF_AE_ESMFAULT_SB"]
#[doc = " @note : The Programmable filter Parity error and double bit ECC errors are fatal errors but"]
#[doc = "         connected to ESM Group 1 lines, these shuld be treated as fatal errors on the Host ."]
#[doc = "         (MSS or DSS in xWR1642, xWR1843 and xWR6843 devices)"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlBssEsmFault {
    #[doc = " @brief  Bits Definition   (0 -- No Error , 1 -- ESM Error)"]
    #[doc = "0   Ramp gen sub block error \\n"]
    #[doc = "1   RESERVED \\n"]
    #[doc = "2   GPADC RAM sub block error \\n"]
    #[doc = "3   VIM RAM sub block error \\n"]
    #[doc = "4   DFE self test error (RESERVED in xWR6x43 devices) \\n"]
    #[doc = "5   VIM self test error \\n"]
    #[doc = "6   B0 TCM sub block error \\n"]
    #[doc = "7   B1 TCM sub block error \\n"]
    #[doc = "8   CCMR4 selftest error \\n"]
    #[doc = "9   ATCM sub block error \\n"]
    #[doc = "10  Ramp gen self test error \\n"]
    #[doc = "11  Ramp gen parity self test error \\n"]
    #[doc = "12  Sequence extinguisher self test error \\n"]
    #[doc = "13  Sequence extinguisher sub block error \\n"]
    #[doc = "14  Programmable Filter Fatal Parity error (RESERVED in xWR6x43 devices) \\n"]
    #[doc = "15  AGC RAM sub block error \\n"]
    #[doc = "16  B1 TCM parity check error \\n"]
    #[doc = "17  B0 TCM parity check error \\n"]
    #[doc = "18  ATCM parity check error \\n"]
    #[doc = "19  Mailbox MSS to BSS sub block error \\n"]
    #[doc = "20  Mailbox BSS to MSS sub block error \\n"]
    #[doc = "24:21  RESERVED \\n"]
    #[doc = "25  Programmable Filter Fatal DB ECC error \\n"]
    #[doc = "31:26  RESERVED \\n"]
    pub esmGrp1Err: rlUInt32_t,
    #[doc = " @brief  Bits Definition \\n"]
    #[doc = "0   DFE STC error \\n"]
    #[doc = "1   CR4 STC error \\n"]
    #[doc = "2   CCMR4 comparator error \\n"]
    #[doc = "3   B0TCM DB error \\n"]
    #[doc = "4   B1TCM DB error \\n"]
    #[doc = "5   ATCM DB error \\n"]
    #[doc = "6   DCC error \\n"]
    #[doc = "7   Sequence extinguisher error \\n"]
    #[doc = "8   Synthesizer frequency monitoring error \\n"]
    #[doc = "9   DFE parity error \\n"]
    #[doc = "10  Ramp gen DB error \\n"]
    #[doc = "11  Bubble correctin fail \\n"]
    #[doc = "12  Ramp gen lockstep error \\n"]
    #[doc = "13  RTI reset error \\n"]
    #[doc = "14  GPADC RAM DB error \\n"]
    #[doc = "15  VIM comparator error \\n"]
    #[doc = "16  CR4 live clock error \\n"]
    #[doc = "17  Watch dog timer NMI error \\n"]
    #[doc = "18  VIM RAM DB error \\n"]
    #[doc = "19  Ramp gen parity error \\n"]
    #[doc = "20  Sequence extinguisher DB error \\n"]
    #[doc = "21  DMA MPU error \\n"]
    #[doc = "22  AGC RAM DB error \\n"]
    #[doc = "23  CRC comparator error \\n"]
    #[doc = "24  Wakeup status error \\n"]
    #[doc = "25  Short circuit error \\n"]
    #[doc = "26  B1 TCM parity error \\n"]
    #[doc = "27  B0 TCM parity error \\n"]
    #[doc = "28  ATCM parity error \\n"]
    #[doc = "29  Mailbox MSS to BSS DB error \\n"]
    #[doc = "30  Mailbox BSS to MSS DB error \\n"]
    #[doc = "31  CCC error \\n"]
    pub esmGrp2Err: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlBssEsmFault() {
    assert_eq!(
        ::core::mem::size_of::<rlBssEsmFault>(),
        8usize,
        concat!("Size of: ", stringify!(rlBssEsmFault))
    );
    assert_eq!(
        ::core::mem::align_of::<rlBssEsmFault>(),
        4usize,
        concat!("Alignment of ", stringify!(rlBssEsmFault))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlBssEsmFault>())).esmGrp1Err as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlBssEsmFault),
            "::",
            stringify!(esmGrp1Err)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlBssEsmFault>())).esmGrp2Err as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlBssEsmFault),
            "::",
            stringify!(esmGrp2Err)
        )
    );
}
pub type rlBssEsmFault_t = rlBssEsmFault;
#[doc = " \\brief"]
#[doc = "  This sub block indicates fault in analog supplies or LDO short circuit condition. Once a fault"]
#[doc = "  is detected the functionality cannot be resumed from then on and the sensor needs to be"]
#[doc = "  re-started. This Async Event is generated with SB-ID RL_DEV_AE_MSS_VMON_ERROR_STATUS_SB."]
#[doc = "  @note : This API Async Event is not supported."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlVmonErrStatus {
    #[doc = " @brief  Value  Definition          \\n"]
    #[doc = "          0     NO FAULT            \\n"]
    #[doc = "          1     ANALOG_SUPPLY_FAULT \\n"]
    #[doc = "      Others    RESERVED            \\n"]
    pub faultType: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt16_t,
    #[doc = " @brief  Fault signature \\n"]
    #[doc = "         Bit  Definition \\n"]
    #[doc = "          0   VDDIN under voltage indication \\n"]
    #[doc = "          1   VDDIN over voltage indication  \\n"]
    #[doc = "          2   VIN_18CLK supply fault         \\n"]
    #[doc = "          3   VIOIN supply fault (Unable to resolve between 1.8V and 3.3V) \\n"]
    #[doc = "          4   VIN_SRAM under voltage indication \\n"]
    #[doc = "          5   VIOIN_18 supply fault             \\n"]
    #[doc = "          6   APLL_VCO_LDO short circuit        \\n"]
    #[doc = "        31:7  RESERVED"]
    pub faultSig: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved2: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlVmonErrStatus() {
    assert_eq!(
        ::core::mem::size_of::<rlVmonErrStatus>(),
        12usize,
        concat!("Size of: ", stringify!(rlVmonErrStatus))
    );
    assert_eq!(
        ::core::mem::align_of::<rlVmonErrStatus>(),
        4usize,
        concat!("Alignment of ", stringify!(rlVmonErrStatus))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlVmonErrStatus>())).faultType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlVmonErrStatus),
            "::",
            stringify!(faultType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlVmonErrStatus>())).reserved0 as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rlVmonErrStatus),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlVmonErrStatus>())).reserved1 as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlVmonErrStatus),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlVmonErrStatus>())).faultSig as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlVmonErrStatus),
            "::",
            stringify!(faultSig)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlVmonErrStatus>())).reserved2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlVmonErrStatus),
            "::",
            stringify!(reserved2)
        )
    );
}
pub type rlVmonErrStatus_t = rlVmonErrStatus;
#[doc = " \\brief"]
#[doc = "  This async event is in response to the command (RL_DEV_CONFIG_SET_MSG:"]
#[doc = "  RL_DEV_RX_DATA_PATH_CONF_SET_SB) which indicates ADC data needs to be transferred over"]
#[doc = "  SPI. This async event contains the ADC data followed by more such async events for"]
#[doc = "  additional data. SB-ID : RL_DEV_AE_MSS_ADC_DATA_SB"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rlRcvAdcData {
    #[doc = " @brief  Number of remaining chunks expected. (Remaining length / 220 bytes)"]
    pub remChunks: rlUInt16_t,
    #[doc = " @brief  ADC data captured by the MMIC. Variable length [4-220] Bytes."]
    pub adcData: [rlSInt8_t; 220usize],
}
#[test]
fn bindgen_test_layout_rlRcvAdcData() {
    assert_eq!(
        ::core::mem::size_of::<rlRcvAdcData>(),
        222usize,
        concat!("Size of: ", stringify!(rlRcvAdcData))
    );
    assert_eq!(
        ::core::mem::align_of::<rlRcvAdcData>(),
        2usize,
        concat!("Alignment of ", stringify!(rlRcvAdcData))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRcvAdcData>())).remChunks as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRcvAdcData),
            "::",
            stringify!(remChunks)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRcvAdcData>())).adcData as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRcvAdcData),
            "::",
            stringify!(adcData)
        )
    );
}
impl Default for rlRcvAdcData {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
pub type rlRcvAdcData_t = rlRcvAdcData;
#[doc = " \\brief"]
#[doc = " mmWaveLink RF Init Complete data structure for event RL_RF_AE_INITCALIBSTATUS_SB"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlRfInitComplete {
    #[doc = " @brief  RF Calibration Status, bit value: 1 - SUCCESS, 0 - FAILURE \\n"]
    #[doc = "Bit Calibration \\n"]
    #[doc = "0   RESERVED \\n"]
    #[doc = "1   APLL tuning \\n"]
    #[doc = "2   SYNTH VCO1 tuning \\n"]
    #[doc = "3   SYNTH VCO2 tuning \\n"]
    #[doc = "4   LODIST calibration \\n"]
    #[doc = "5   RX ADC DC offset calibration \\n"]
    #[doc = "6   HPF cutoff calibration \\n"]
    #[doc = "7   LPF cutoff calibration \\n"]
    #[doc = "8   Peak detector calibration \\n"]
    #[doc = "9   TX Power calibration \\n"]
    #[doc = "10  RX gain calibration \\n"]
    #[doc = "11  TX Phase calibration \\n"]
    #[doc = "12  RX IQMM calibration \\n"]
    #[doc = "31:13   [Reserved] \\n"]
    #[doc = "@note : CALIBRATION_STATUS should be checked only if CALIBRATION_ENABLE \\n"]
    #[doc = "bit is set to 1. \\n"]
    pub calibStatus: rlUInt32_t,
    #[doc = " @brief  this field is set only for updated calibration. It has same bit definition as \\n"]
    #[doc = "CALIBRATION_STATUS  \\n"]
    pub calibUpdate: rlUInt32_t,
    #[doc = " @brief Measured temperature, based on average of temperature sensors near all enabled TX \\n"]
    #[doc = "and RX channels at the time of calibration. \\n"]
    #[doc = "1 LSB = 1o Celsius \\n"]
    pub temperature: rlUInt16_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt16_t,
    #[doc = " @brief  This field indicates when the calibration updates were performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon exceeding allotted bit \\n"]
    #[doc = "width) \\n"]
    pub timeStamp: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlRfInitComplete() {
    assert_eq!(
        ::core::mem::size_of::<rlRfInitComplete>(),
        20usize,
        concat!("Size of: ", stringify!(rlRfInitComplete))
    );
    assert_eq!(
        ::core::mem::align_of::<rlRfInitComplete>(),
        4usize,
        concat!("Alignment of ", stringify!(rlRfInitComplete))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRfInitComplete>())).calibStatus as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfInitComplete),
            "::",
            stringify!(calibStatus)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRfInitComplete>())).calibUpdate as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfInitComplete),
            "::",
            stringify!(calibUpdate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRfInitComplete>())).temperature as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfInitComplete),
            "::",
            stringify!(temperature)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRfInitComplete>())).reserved0 as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfInitComplete),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRfInitComplete>())).timeStamp as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfInitComplete),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRfInitComplete>())).reserved1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfInitComplete),
            "::",
            stringify!(reserved1)
        )
    );
}
pub type rlRfInitComplete_t = rlRfInitComplete;
#[doc = " \\brief"]
#[doc = " mmWaveLink RF Run time calibration report for event RL_RF_AE_RUN_TIME_CALIB_REPORT_SB"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlRfRunTimeCalibReport {
    #[doc = " @brief  1 = calibration is passed, 0 = calibration is failed or not enabled/performed at \\n"]
    #[doc = "least once. \\n"]
    #[doc = "Bit: Calibration \\n"]
    #[doc = "0: [Reserved] \\n"]
    #[doc = "1: APLL tuning \\n"]
    #[doc = "2: SYNTH VCO1 tuning \\n"]
    #[doc = "3: SYNTH VCO2 tuning \\n"]
    #[doc = "4: LODIST calibration \\n"]
    #[doc = "5: [Reserved] \\n"]
    #[doc = "6: [Reserved] \\n"]
    #[doc = "7: [Reserved] \\n"]
    #[doc = "8: PD calibration \\n"]
    #[doc = "9: TX Power calibration \\n"]
    #[doc = "10: RX gain calibration \\n"]
    #[doc = "11: [Reserved] \\n"]
    #[doc = "12: [Reserved] \\n"]
    #[doc = "31:13: [Reserved] \\n"]
    pub calibErrorFlag: rlUInt32_t,
    #[doc = " @brief  Whether each calibration resulted in a reconfiguration of RF is indicated by a \\n"]
    #[doc = "value of 1 in the respective bit in this field. It has bit definition as \\n"]
    #[doc = "above \\n"]
    pub calibUpdateStatus: rlUInt32_t,
    #[doc = " @brief  Measured temperature, based on average of temperature sensors near all enabled \\n"]
    #[doc = "TX and RX channels at the time of calibration. \\n"]
    #[doc = "Note that this temperature will be updated only when a run-time calibration is"]
    #[doc = "executed due to a change in temperature by more than 10 deg C. \\n"]
    #[doc = "1 LSB = 1 degree Celsius \\n"]
    pub temperature: rlInt16_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt16_t,
    #[doc = " @brief  This field indicates when the calibration updates were performed. \\n"]
    #[doc = "1 LSB = 1 millisecond \\n"]
    #[doc = "(the stamp rolls over upon exceeding allotted bit width)  \\n"]
    pub timeStamp: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlRfRunTimeCalibReport() {
    assert_eq!(
        ::core::mem::size_of::<rlRfRunTimeCalibReport>(),
        20usize,
        concat!("Size of: ", stringify!(rlRfRunTimeCalibReport))
    );
    assert_eq!(
        ::core::mem::align_of::<rlRfRunTimeCalibReport>(),
        4usize,
        concat!("Alignment of ", stringify!(rlRfRunTimeCalibReport))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlRfRunTimeCalibReport>())).calibErrorFlag as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfRunTimeCalibReport),
            "::",
            stringify!(calibErrorFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlRfRunTimeCalibReport>())).calibUpdateStatus as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfRunTimeCalibReport),
            "::",
            stringify!(calibUpdateStatus)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlRfRunTimeCalibReport>())).temperature as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfRunTimeCalibReport),
            "::",
            stringify!(temperature)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlRfRunTimeCalibReport>())).reserved0 as *const _ as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfRunTimeCalibReport),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlRfRunTimeCalibReport>())).timeStamp as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfRunTimeCalibReport),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlRfRunTimeCalibReport>())).reserved1 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfRunTimeCalibReport),
            "::",
            stringify!(reserved1)
        )
    );
}
pub type rlRfRunTimeCalibReport_t = rlRfRunTimeCalibReport;
#[doc = " \\brief"]
#[doc = " API APLL closed loop cal Status Get Sub block structure"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlRfApllCalDone {
    pub apllClCalStatus: rlUInt16_t,
    #[doc = " @brief  Tolerance"]
    pub cccTolerance: rlUInt16_t,
    #[doc = " @brief  Window"]
    pub cccCount0: rlUInt16_t,
    #[doc = " @brief  Measured 0.1/3 MHz Unit"]
    pub measFreqCount: rlUInt16_t,
    #[doc = " @brief  Expected"]
    pub cccCount1: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlRfApllCalDone() {
    assert_eq!(
        ::core::mem::size_of::<rlRfApllCalDone>(),
        12usize,
        concat!("Size of: ", stringify!(rlRfApllCalDone))
    );
    assert_eq!(
        ::core::mem::align_of::<rlRfApllCalDone>(),
        4usize,
        concat!("Alignment of ", stringify!(rlRfApllCalDone))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlRfApllCalDone>())).apllClCalStatus as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfApllCalDone),
            "::",
            stringify!(apllClCalStatus)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRfApllCalDone>())).cccTolerance as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfApllCalDone),
            "::",
            stringify!(cccTolerance)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRfApllCalDone>())).cccCount0 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfApllCalDone),
            "::",
            stringify!(cccCount0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRfApllCalDone>())).measFreqCount as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfApllCalDone),
            "::",
            stringify!(measFreqCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRfApllCalDone>())).cccCount1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRfApllCalDone),
            "::",
            stringify!(cccCount1)
        )
    );
}
pub type rlRfApllCalDone_t = rlRfApllCalDone;
#[doc = " \\brief"]
#[doc = " Structure to hold the MSS/radarSS CPU Fault data strucutre for"]
#[doc = " event RL_DEV_AE_MSS_CPUFAULT_SB and RL_RF_AE_CPUFAULT_SB"]
#[doc = " @note : All the Monitoring Async events will be sent out periodically at calibMonTimeUnit"]
#[doc = "         frame rate (FTTI). The RadarSS/BSS has a queue to hold max 8 transmit API messages"]
#[doc = "         (AEs or Responses), the host shall service all the AEs before start of the next FTTI"]
#[doc = "         epoch to avoid RadarSS Queue full CPU fault fatal error."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlCpuFault {
    #[doc = " @brief  0x0    RF Processor Undefined Instruction Abort \\n"]
    #[doc = "0x1    RF Processor Instruction pre-fetch Abort \\n"]
    #[doc = "0x2    RF Processor Data Access Abort \\n"]
    #[doc = "0x3    RF Processor Firmware Fatal Error \\n"]
    #[doc = "0x4 - 0xFF Reserved \\n"]
    pub faultType: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt8_t,
    #[doc = " @brief  Valid only in case of FAULT type is 0x3, provides the source \\n"]
    #[doc = "line number at which fatal error occurred. \\n"]
    pub lineNum: rlUInt16_t,
    #[doc = " @brief  The instruction PC address at which Fault occurred"]
    pub faultLR: rlUInt32_t,
    #[doc = " @brief  The return address of the function from which fault function \\n"]
    #[doc = "has been called (Call stack LR) \\n"]
    pub faultPrevLR: rlUInt32_t,
    #[doc = " @brief  The CPSR register value at which fault occurred"]
    pub faultSpsr: rlUInt32_t,
    #[doc = " @brief  The SP register value at which fault occurred"]
    pub faultSp: rlUInt32_t,
    #[doc = " @brief  The address access at which Fault occurred (valid only for fault \\n"]
    #[doc = "type 0x0 to 0x2) \\n"]
    pub faultAddr: rlUInt32_t,
    #[doc = " @brief  The status of Error (Error Cause type - valid only for \\n"]
    #[doc = "fault type 0x0 to 0x2) \\n"]
    #[doc = "0x000  BACKGROUND_ERR \\n"]
    #[doc = "0x001  ALIGNMENT_ERR \\n"]
    #[doc = "0x002  DEBUG_EVENT \\n"]
    #[doc = "0x00D  PERMISSION_ERR \\n"]
    #[doc = "0x008  SYNCH_EXTER_ERR \\n"]
    #[doc = "0x406  ASYNCH_EXTER_ERR \\n"]
    #[doc = "0x409  SYNCH_ECC_ERR \\n"]
    #[doc = "0x408  ASYNCH_ECC_ERR \\n"]
    pub faultErrStatus: rlUInt16_t,
    #[doc = " @brief  The Source of the Error (Error Source type- valid only for fault type 0x0 to 0x2)\\n"]
    #[doc = "0x0  ERR_SOURCE_AXI_MASTER \\n"]
    #[doc = "0x1  ERR_SOURCE_ATCM \\n"]
    #[doc = "0x2  ERR_SOURCE_BTCM  \\n"]
    pub faultErrSrc: rlUInt8_t,
    #[doc = " @brief  The AXI Error type (Error Source type - valid only for fault type 0x0 to 0x2) \\n"]
    #[doc = "0x0  AXI_DECOD_ERR \\n"]
    #[doc = "0x1  AXI_SLAVE_ERR  \\n"]
    pub faultAxiErrType: rlUInt8_t,
    #[doc = " @brief  The Error Access type (Error Access type- valid only for fault type 0x0 to 0x2) \\n"]
    #[doc = "0x0  READ_ERR \\n"]
    #[doc = "0x1  WRITE_ERR \\n"]
    pub faultAccType: rlUInt8_t,
    #[doc = " @brief  The Error Recovery type (Error Recovery type - Valid only for fault \\n"]
    #[doc = "type 0x0 to 0x2) \\n"]
    #[doc = "0x0  UNRECOVERY \\n"]
    #[doc = "0x1  RECOVERY  \\n"]
    pub faultRecovType: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt16_t,
}
#[test]
fn bindgen_test_layout_rlCpuFault() {
    assert_eq!(
        ::core::mem::size_of::<rlCpuFault>(),
        32usize,
        concat!("Size of: ", stringify!(rlCpuFault))
    );
    assert_eq!(
        ::core::mem::align_of::<rlCpuFault>(),
        4usize,
        concat!("Alignment of ", stringify!(rlCpuFault))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).faultType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(faultType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).reserved0 as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).lineNum as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(lineNum)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).faultLR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(faultLR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).faultPrevLR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(faultPrevLR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).faultSpsr as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(faultSpsr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).faultSp as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(faultSp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).faultAddr as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(faultAddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).faultErrStatus as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(faultErrStatus)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).faultErrSrc as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(faultErrSrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).faultAxiErrType as *const _ as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(faultAxiErrType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).faultAccType as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(faultAccType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).faultRecovType as *const _ as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(faultRecovType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlCpuFault>())).reserved1 as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCpuFault),
            "::",
            stringify!(reserved1)
        )
    );
}
pub type rlCpuFault_t = rlCpuFault;
#[doc = " \\brief"]
#[doc = " mmWaveLink firmware version structure"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlFwVersionParam {
    #[doc = " @brief  HW variant number"]
    pub hwVarient: rlUInt8_t,
    #[doc = " @brief  HW version major number"]
    pub hwMajor: rlUInt8_t,
    #[doc = " @brief  HW version minor number"]
    pub hwMinor: rlUInt8_t,
    #[doc = " @brief  FW version major number"]
    pub fwMajor: rlUInt8_t,
    #[doc = " @brief  FW version major number"]
    pub fwMinor: rlUInt8_t,
    #[doc = " @brief  FW version build number"]
    pub fwBuild: rlUInt8_t,
    #[doc = " @brief  FW version debug number"]
    pub fwDebug: rlUInt8_t,
    #[doc = " @brief  FW Release Year"]
    pub fwYear: rlUInt8_t,
    #[doc = " @brief  FW Release Month"]
    pub fwMonth: rlUInt8_t,
    #[doc = " @brief  FW Release Day"]
    pub fwDay: rlUInt8_t,
    #[doc = " @brief  Patch version major number"]
    pub patchMajor: rlUInt8_t,
    #[doc = " @brief  Patch version minor number"]
    pub patchMinor: rlUInt8_t,
    #[doc = " @brief  Patch Release Year"]
    pub patchYear: rlUInt8_t,
    #[doc = " @brief  Patch Release Month"]
    pub patchMonth: rlUInt8_t,
    #[doc = " @brief  Patch Release Day"]
    pub patchDay: rlUInt8_t,
    #[doc = " @brief  Debug and build version"]
    #[doc = "         b3:0   Debug version"]
    #[doc = "         b7:4   Build version"]
    pub patchBuildDebug: rlUInt8_t,
}
#[test]
fn bindgen_test_layout_rlFwVersionParam() {
    assert_eq!(
        ::core::mem::size_of::<rlFwVersionParam>(),
        16usize,
        concat!("Size of: ", stringify!(rlFwVersionParam))
    );
    assert_eq!(
        ::core::mem::align_of::<rlFwVersionParam>(),
        1usize,
        concat!("Alignment of ", stringify!(rlFwVersionParam))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).hwVarient as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(hwVarient)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).hwMajor as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(hwMajor)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).hwMinor as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(hwMinor)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).fwMajor as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(fwMajor)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).fwMinor as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(fwMinor)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).fwBuild as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(fwBuild)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).fwDebug as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(fwDebug)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).fwYear as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(fwYear)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).fwMonth as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(fwMonth)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).fwDay as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(fwDay)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).patchMajor as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(patchMajor)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).patchMinor as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(patchMinor)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).patchYear as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(patchYear)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).patchMonth as *const _ as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(patchMonth)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFwVersionParam>())).patchDay as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(patchDay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlFwVersionParam>())).patchBuildDebug as *const _ as usize
        },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFwVersionParam),
            "::",
            stringify!(patchBuildDebug)
        )
    );
}
pub type rlFwVersionParam_t = rlFwVersionParam;
#[doc = " \\brief"]
#[doc = " mmwavelink software version structure"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlSwVersionParam {
    #[doc = " @brief  SW version major number"]
    pub major: rlUInt8_t,
    #[doc = " @brief  SW version minor number"]
    pub minor: rlUInt8_t,
    #[doc = " @brief  SW version buid number"]
    pub build: rlUInt8_t,
    #[doc = " @brief  SW version debug number"]
    pub debug: rlUInt8_t,
    #[doc = " @brief  Software Release Year"]
    pub year: rlUInt8_t,
    #[doc = " @brief  Software Release Month"]
    pub month: rlUInt8_t,
    #[doc = " @brief  Software Release Day"]
    pub day: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt8_t,
}
#[test]
fn bindgen_test_layout_rlSwVersionParam() {
    assert_eq!(
        ::core::mem::size_of::<rlSwVersionParam>(),
        8usize,
        concat!("Size of: ", stringify!(rlSwVersionParam))
    );
    assert_eq!(
        ::core::mem::align_of::<rlSwVersionParam>(),
        1usize,
        concat!("Alignment of ", stringify!(rlSwVersionParam))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlSwVersionParam>())).major as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlSwVersionParam),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlSwVersionParam>())).minor as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rlSwVersionParam),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlSwVersionParam>())).build as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlSwVersionParam),
            "::",
            stringify!(build)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlSwVersionParam>())).debug as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(rlSwVersionParam),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlSwVersionParam>())).year as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlSwVersionParam),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlSwVersionParam>())).month as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlSwVersionParam),
            "::",
            stringify!(month)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlSwVersionParam>())).day as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlSwVersionParam),
            "::",
            stringify!(day)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlSwVersionParam>())).reserved as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(rlSwVersionParam),
            "::",
            stringify!(reserved)
        )
    );
}
pub type rlSwVersionParam_t = rlSwVersionParam;
#[doc = " \\brief"]
#[doc = " mmwavelink version structure"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlVersion {
    #[doc = " @brief  Master Sub System version"]
    pub master: rlFwVersionParam_t,
    #[doc = " @brief  RF Sub System version"]
    pub rf: rlFwVersionParam_t,
    #[doc = " @brief  mmWaveLink version"]
    pub mmWaveLink: rlSwVersionParam_t,
}
#[test]
fn bindgen_test_layout_rlVersion() {
    assert_eq!(
        ::core::mem::size_of::<rlVersion>(),
        40usize,
        concat!("Size of: ", stringify!(rlVersion))
    );
    assert_eq!(
        ::core::mem::align_of::<rlVersion>(),
        1usize,
        concat!("Alignment of ", stringify!(rlVersion))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlVersion>())).master as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlVersion),
            "::",
            stringify!(master)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlVersion>())).rf as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlVersion),
            "::",
            stringify!(rf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlVersion>())).mmWaveLink as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rlVersion),
            "::",
            stringify!(mmWaveLink)
        )
    );
}
pub type rlVersion_t = rlVersion;
#[doc = " \\brief"]
#[doc = " GPADC measurement data for sensors"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlGpAdcData {
    #[doc = " @brief  Min value of GP ADC data"]
    pub min: rlUInt16_t,
    #[doc = " @brief  Max value of GP ADC data"]
    pub max: rlUInt16_t,
    #[doc = " @brief  Avg value of GP ADC data"]
    pub avg: rlUInt16_t,
}
#[test]
fn bindgen_test_layout_rlGpAdcData() {
    assert_eq!(
        ::core::mem::size_of::<rlGpAdcData>(),
        6usize,
        concat!("Size of: ", stringify!(rlGpAdcData))
    );
    assert_eq!(
        ::core::mem::align_of::<rlGpAdcData>(),
        2usize,
        concat!("Alignment of ", stringify!(rlGpAdcData))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlGpAdcData>())).min as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlGpAdcData),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlGpAdcData>())).max as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlGpAdcData),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlGpAdcData>())).avg as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlGpAdcData),
            "::",
            stringify!(avg)
        )
    );
}
pub type rlGpAdcData_t = rlGpAdcData;
#[doc = " \\brief"]
#[doc = " Sensors GPADC measurement data for event RL_RF_AE_GPADC_MEAS_DATA_SB"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlRecvdGpAdcData {
    #[doc = " @brief  collected all GP ADC data"]
    pub sensor: [rlGpAdcData_t; 6usize],
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: [rlUInt16_t; 4usize],
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: [rlUInt32_t; 7usize],
}
#[test]
fn bindgen_test_layout_rlRecvdGpAdcData() {
    assert_eq!(
        ::core::mem::size_of::<rlRecvdGpAdcData>(),
        72usize,
        concat!("Size of: ", stringify!(rlRecvdGpAdcData))
    );
    assert_eq!(
        ::core::mem::align_of::<rlRecvdGpAdcData>(),
        4usize,
        concat!("Alignment of ", stringify!(rlRecvdGpAdcData))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRecvdGpAdcData>())).sensor as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRecvdGpAdcData),
            "::",
            stringify!(sensor)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRecvdGpAdcData>())).reserved0 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRecvdGpAdcData),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRecvdGpAdcData>())).reserved1 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRecvdGpAdcData),
            "::",
            stringify!(reserved1)
        )
    );
}
pub type rlRecvdGpAdcData_t = rlRecvdGpAdcData;
#[doc = " \\brief"]
#[doc = " Analog fault strucure for event RL_RF_AE_ANALOG_FAULT_SB"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlAnalogFaultReportData {
    #[doc = " @brief  Indicates the analog fault type"]
    #[doc = "         Value   Definition"]
    #[doc = "           0     No fault"]
    #[doc = "           1     Analog supply fault"]
    #[doc = "         Others  RESERVED"]
    pub faultType: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt16_t,
    #[doc = " @brief  Indicates which analog supply is in fault"]
    #[doc = "         Bit    Definition"]
    #[doc = "          0     1.8V BB Analog supply fault"]
    #[doc = "          1     1.3V/1.0V RF supply fault"]
    #[doc = "          2     Synth VCO LDO short circuit detected"]
    #[doc = "          3     PA LDO short circuit detected"]
    #[doc = "          31:4  RESERVED"]
    pub faultSig: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved2: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlAnalogFaultReportData() {
    assert_eq!(
        ::core::mem::size_of::<rlAnalogFaultReportData>(),
        12usize,
        concat!("Size of: ", stringify!(rlAnalogFaultReportData))
    );
    assert_eq!(
        ::core::mem::align_of::<rlAnalogFaultReportData>(),
        4usize,
        concat!("Alignment of ", stringify!(rlAnalogFaultReportData))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlAnalogFaultReportData>())).faultType as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlAnalogFaultReportData),
            "::",
            stringify!(faultType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlAnalogFaultReportData>())).reserved0 as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rlAnalogFaultReportData),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlAnalogFaultReportData>())).reserved1 as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlAnalogFaultReportData),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlAnalogFaultReportData>())).faultSig as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlAnalogFaultReportData),
            "::",
            stringify!(faultSig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlAnalogFaultReportData>())).reserved2 as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlAnalogFaultReportData),
            "::",
            stringify!(reserved2)
        )
    );
}
pub type rlAnalogFaultReportData_t = rlAnalogFaultReportData;
#[doc = " \\brief"]
#[doc = " Calibration monitoring timing error data for event RL_RF_AE_MON_TIMING_FAIL_REPORT_SB"]
#[doc = " @note : In QM devices (non safety), Periodic Digital and Analog Monitoring are not supported."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlCalMonTimingErrorReportData {
    #[doc = " @brief  [b0] 1 = Total monitoring time does not fit in one CALIB_MON_TIME_UNIT when one \\n"]
    #[doc = "time calibration is enabled, \\n"]
    #[doc = "0 = No failure \\n"]
    #[doc = "[b1] 1 = Total monitoring and calibration time don't fit in one calibMonTimeUnit \\n"]
    #[doc = "when periodic calibration is enabled, \\n"]
    #[doc = "0 = No failure \\n"]
    #[doc = "[b2] 1 = Runtime timing violation: Monitoring functions or calibrations could \\n"]
    #[doc = "not be completed in one calibMonTimeUnit, \\n"]
    #[doc = "0 = No failure \\n"]
    #[doc = "[b3-b15] RESERVED  \\n"]
    pub timingFailCode: rlUInt16_t,
    pub reserved: rlUInt16_t,
}
#[test]
fn bindgen_test_layout_rlCalMonTimingErrorReportData() {
    assert_eq!(
        ::core::mem::size_of::<rlCalMonTimingErrorReportData>(),
        4usize,
        concat!("Size of: ", stringify!(rlCalMonTimingErrorReportData))
    );
    assert_eq!(
        ::core::mem::align_of::<rlCalMonTimingErrorReportData>(),
        2usize,
        concat!("Alignment of ", stringify!(rlCalMonTimingErrorReportData))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlCalMonTimingErrorReportData>())).timingFailCode as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCalMonTimingErrorReportData),
            "::",
            stringify!(timingFailCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlCalMonTimingErrorReportData>())).reserved as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlCalMonTimingErrorReportData),
            "::",
            stringify!(reserved)
        )
    );
}
pub type rlCalMonTimingErrorReportData_t = rlCalMonTimingErrorReportData;
#[doc = " \\brief"]
#[doc = " Latent fault digital monitoring status data for event RL_RF_AE_DIG_LATENTFAULT_REPORT_AE_SB"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlDigLatentFaultReportData {
    #[doc = " @brief  1 - PASS, 0 - FAIL \\n"]
    #[doc = "Bit     Definition \\n"]
    #[doc = "0       RESERVED \\n"]
    #[doc = "1       CR4_VIM_LOCKSTEP_MONITORING \\n"]
    #[doc = "2       RESERVED \\n"]
    #[doc = "3       VIM_MONITORING \\n"]
    #[doc = "4       RESERVED \\n"]
    #[doc = "5       RESERVED \\n"]
    #[doc = "6       CRC_MONITORING \\n"]
    #[doc = "7       RAMPGEN_ECC_MONITORING (Not supported in 1st Gen devices, refer latest"]
    #[doc = "release note) \\n"]
    #[doc = "8       DFE_PARITY_MONITORNG (RESERVED in xWR6x43 devices) \\n"]
    #[doc = "9       DFE_ECC_MONITORING \\n"]
    #[doc = "10      RAMPGEN_LOCKSTEP_MONITORING \\n"]
    #[doc = "11      FRC_LOCKSTEP_MONITORING \\n"]
    #[doc = "12      RESERVED \\n"]
    #[doc = "13      RESERVED \\n"]
    #[doc = "14      RESERVED \\n"]
    #[doc = "15      RESERVED \\n"]
    #[doc = "16      ESM_MONITORING \\n"]
    #[doc = "17      DFE_STC_MONITORING \\n"]
    #[doc = "18      RESERVED \\n"]
    #[doc = "19      ATCM_BTCM_ECC_MONITORING  \\n"]
    #[doc = "20      ATCM_BTCM_PARITY_MONITORING \\n"]
    #[doc = "21      RESERVED \\n"]
    #[doc = "22      RESERVED \\n"]
    #[doc = "23      RESERVED \\n"]
    #[doc = "24      FFT_MONITORING \\n"]
    #[doc = "25      RTI_MONITORING \\n"]
    #[doc = "31:26   RESERVED  \\n"]
    pub digMonLatentFault: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlDigLatentFaultReportData() {
    assert_eq!(
        ::core::mem::size_of::<rlDigLatentFaultReportData>(),
        4usize,
        concat!("Size of: ", stringify!(rlDigLatentFaultReportData))
    );
    assert_eq!(
        ::core::mem::align_of::<rlDigLatentFaultReportData>(),
        4usize,
        concat!("Alignment of ", stringify!(rlDigLatentFaultReportData))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlDigLatentFaultReportData>())).digMonLatentFault as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDigLatentFaultReportData),
            "::",
            stringify!(digMonLatentFault)
        )
    );
}
pub type rlDigLatentFaultReportData_t = rlDigLatentFaultReportData;
#[doc = " \\brief"]
#[doc = " The report header includes common information across all enabled monitors"]
#[doc = " like current FTTI number and current temperature. event: RL_RF_AE_MON_REPORT_HEADER_SB"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonReportHdrData {
    #[doc = " @brief  FTTI free running counter value, incremented every CAL_MON_TIME_UNIT"]
    pub fttiCount: rlUInt32_t,
    #[doc = " @brief  Average temperature at which was monitoring performed \\n"]
    #[doc = "         1 LSB = 1 deg C"]
    pub avgTemp: rlUInt16_t,
    #[doc = " @brief  Reserved for future use \\n"]
    pub reserved0: rlUInt16_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonReportHdrData() {
    assert_eq!(
        ::core::mem::size_of::<rlMonReportHdrData>(),
        12usize,
        concat!("Size of: ", stringify!(rlMonReportHdrData))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonReportHdrData>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonReportHdrData))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonReportHdrData>())).fttiCount as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonReportHdrData),
            "::",
            stringify!(fttiCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonReportHdrData>())).avgTemp as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonReportHdrData),
            "::",
            stringify!(avgTemp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonReportHdrData>())).reserved0 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonReportHdrData),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonReportHdrData>())).reserved1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonReportHdrData),
            "::",
            stringify!(reserved1)
        )
    );
}
pub type rlMonReportHdrData_t = rlMonReportHdrData;
#[doc = " \\brief"]
#[doc = " This async event is sent periodically to indicate the status of periodic"]
#[doc = " digital monitoring tests.Event: RL_RF_AE_MON_DIG_PERIODIC_REPORT_SB"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlDigPeriodicReportData {
    #[doc = " @brief  1 - PASS, 0 - FAIL \\n"]
    #[doc = "Bit    Monitoring type \\n"]
    #[doc = "[0]    PERIODIC_CONFG_REGISTER_READ \\n"]
    #[doc = "[1]    RESERVED \\n"]
    #[doc = "[2]    DFE_STC \\n"]
    #[doc = "[3]    FRAME_TIMING_MONITORING \\n"]
    #[doc = "[31:4] RESERVED  \\n"]
    pub digMonPeriodicStatus: rlUInt32_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1millisecond (the stamp rolls over upon exceeding allotted bit \\n"]
    #[doc = "width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlDigPeriodicReportData() {
    assert_eq!(
        ::core::mem::size_of::<rlDigPeriodicReportData>(),
        8usize,
        concat!("Size of: ", stringify!(rlDigPeriodicReportData))
    );
    assert_eq!(
        ::core::mem::align_of::<rlDigPeriodicReportData>(),
        4usize,
        concat!("Alignment of ", stringify!(rlDigPeriodicReportData))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlDigPeriodicReportData>())).digMonPeriodicStatus as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDigPeriodicReportData),
            "::",
            stringify!(digMonPeriodicStatus)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlDigPeriodicReportData>())).timeStamp as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDigPeriodicReportData),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlDigPeriodicReportData_t = rlDigPeriodicReportData;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends to the host,"]
#[doc = " containing the measured temperature near various RF analog and digital modules."]
#[doc = " The xWR device sends this to host at the programmed periodicity or when failure occurs,"]
#[doc = " as programmed by the configuration API SB. Event:RL_RF_AE_MON_TEMPERATURE_REPORT_SB"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonTempReportData {
    #[doc = " @brief  Status flags indicating pass fail results corresponding to \\n"]
    #[doc = "various threshold checks under this monitor. \\n"]
    #[doc = "Bit  STATUS_FLAG for monitor \\n"]
    #[doc = "[0]  STATUS_ANA_TEMP_MIN \\n"]
    #[doc = "[1]  STATUS_ANA_TEMP_MAX \\n"]
    #[doc = "[2]  STATUS_DIG_TEMP_MIN \\n"]
    #[doc = "[3]  STATUS_DIG_TEMP_MAX \\n"]
    #[doc = "[4]  STATUS_TEMP_DIFF_THRESH \\n"]
    #[doc = "[15:5]RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS  \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  The measured onchip temperatures are reported here. \\n"]
    #[doc = "Byte numbers corresponding to different temperature sensors \\n"]
    #[doc = "reported in this field are here: \\n"]
    #[doc = "Bytes       SIGNAL \\n"]
    #[doc = "[1:0]       TEMP_RX0 \\n"]
    #[doc = "[3:2]       TEMP_RX1 \\n"]
    #[doc = "[5:4]       TEMP_RX2 \\n"]
    #[doc = "[7:6]       TEMP_RX3 \\n"]
    #[doc = "[9:8]       TEMP_TX0 \\n"]
    #[doc = "[11:10]     TEMP_TX1 \\n"]
    #[doc = "[13:12]     TEMP_TX2 \\n"]
    #[doc = "[15:14]     TEMP_PM \\n"]
    #[doc = "[17:16]     TEMP_DIG1 \\n"]
    #[doc = "[19:18]     TEMP_DIG2 (Applicable only in xWR1642 & xWR1843) \\n"]
    #[doc = "1 LSB = 1 degree C, signed number  \\n"]
    pub tempValues: [rlInt16_t; 10usize],
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt32_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond  \\n"]
    #[doc = "(the stamp rolls over upon exceeding allotted bit width)  \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonTempReportData() {
    assert_eq!(
        ::core::mem::size_of::<rlMonTempReportData>(),
        32usize,
        concat!("Size of: ", stringify!(rlMonTempReportData))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonTempReportData>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonTempReportData))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonTempReportData>())).statusFlags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTempReportData),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTempReportData>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTempReportData),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTempReportData>())).tempValues as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTempReportData),
            "::",
            stringify!(tempValues)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTempReportData>())).reserved as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTempReportData),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTempReportData>())).timeStamp as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTempReportData),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonTempReportData_t = rlMonTempReportData;
#[doc = " \\brief"]
#[doc = " This API is a Monitoring report which RadarSS sends to the host,"]
#[doc = " containing the measured RX gain and phase values,Loopback Power and Noise Power. Noise Power can"]
#[doc = " be used by the Host to detect the presence of interference. RadarSS sends this to host at the \\n"]
#[doc = " programmed periodicity or when failure occurs, as programmed by the configuration API SB."]
#[doc = " Event: RL_RF_AE_MON_RX_GAIN_PHASE_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonRxGainPhRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding \\n"]
    #[doc = "to various threshold checks under this monitor. \\n"]
    #[doc = "Bit  STATUS_FLAG for monitor \\n"]
    #[doc = "[0]  STATUS_RX_GAIN_ABS \\n"]
    #[doc = "[1]  STATUS_RX_GAIN_MISMATCH \\n"]
    #[doc = "[2]  STATUS_RX_GAIN_FLATNESS \\n"]
    #[doc = "[3]  STATUS_RX_PHASE_MISMATCH \\n"]
    #[doc = "[15:4]RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS  \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring  Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  Profile Index for which this monitoring report applies."]
    pub profIndex: rlUInt8_t,
    #[doc = " @brief  The measured average loop-back power across RX channels at each enabled"]
    #[doc = "         RF1 frequency (i.e. Lowest, center and highest with 60MHz dither in the"]
    #[doc = "         profile's RF band) at LNA input is reported here. \\n"]
    #[doc = "         b4:b0 RF1 \\n"]
    #[doc = "         b7-b5: reserved \\n"]
    #[doc = "         1LSB = -2 dBm \\n"]
    #[doc = "         Valid range = -62dBm to 0dBm. \\n"]
    #[doc = "         Only the entries of enabled RF frequencies are valid. \\n"]
    #[doc = "         The LB power might be bad/corrupted under interference conditions, and unreliable"]
    #[doc = "         at temperatures far away from room temperature. So, their usage is discouraged and"]
    #[doc = "         not supported for production usage. \\n"]
    pub loopbackPowerRF1: rlUInt8_t,
    #[doc = " @brief  The measured average loop-back power across RX channels at each enabled"]
    #[doc = "         RF2 frequency (i.e. Lowest, center and highest with 60MHz dither in the"]
    #[doc = "         profile's RF band) at LNA input is reported here. \\n"]
    #[doc = "         b4:b0 RF2 \\n"]
    #[doc = "         b7-b5: reserved \\n"]
    #[doc = "         1LSB = -2 dBm \\n"]
    #[doc = "         Valid range = -62dBm to 0dBm. \\n"]
    #[doc = "         Only the entries of enabled RF frequencies are valid. \\n"]
    #[doc = "         The LB power might be bad/corrupted under interference conditions, and unreliable"]
    #[doc = "         at temperatures far away from room temperature. So, their usage is discouraged and"]
    #[doc = "         not supported for production usage. \\n"]
    pub loopbackPowerRF2: rlUInt8_t,
    #[doc = " @brief  The measured average loop-back power across RX channels at each enabled"]
    #[doc = "         RF3 frequency (i.e. Lowest, center and highest with 60MHz dither in the"]
    #[doc = "         profile's RF band) at LNA input is reported here. \\n"]
    #[doc = "         b4:b0 RF3 \\n"]
    #[doc = "         b7-b5: reserved \\n"]
    #[doc = "         1LSB = -2 dBm \\n"]
    #[doc = "         Valid range = -62dBm to 0dBm. \\n"]
    #[doc = "         Only the entries of enabled RF frequencies are valid. \\n"]
    #[doc = "         The LB power might be bad/corrupted under interference conditions, and unreliable"]
    #[doc = "         at temperatures far away from room temperature. So, their usage is discouraged and"]
    #[doc = "         not supported for production usage. \\n"]
    pub loopbackPowerRF3: rlUInt8_t,
    #[doc = " @brief  The measured RX gain for each enabled channel, at each enabled RF frequency \\n"]
    #[doc = "(i.e., lowest, center and highest in the profile's RF band) is reported \\n"]
    #[doc = "here. Byte numbers corresponding to different RX and RF, in this field \\n"]
    #[doc = "are here: \\n"]
    #[doc = "RF1     RF2     RF3 \\n"]
    #[doc = "RX0     1:0     9:8     17:16 \\n"]
    #[doc = "RX1     3:2     11:10   19:18 \\n"]
    #[doc = "RX2     5:4     13:12   21:20 \\n"]
    #[doc = "RX3     7:6     15:14   23:22 \\n"]
    #[doc = "1 LSB = 0.1 dB \\n"]
    #[doc = "Only the entries of enabled RF Frequencies and enabled RX channels are \\n"]
    #[doc = "valid. \\n"]
    #[doc = "The RX gain is measured using only ADC power and under assumption of a fixed"]
    #[doc = "LB power for all RF1, RF2 and RF3 frequencies to avoid interference"]
    #[doc = "impact. \\n Therefore, RX gain shows around 10 dB deviation from"]
    #[doc = "programmed RX gain across full temperature range. \\n"]
    #[doc = "For xWR1xxx devices: \\n"]
    #[doc = "The actual Rx gain of the device in dB = RX GAIN VALUE(Rf freq, Rx) +"]
    #[doc = "(-38dBm)  LOOPBACK_POWER_TEMP_dBm(Temp[C]) \\n"]
    #[doc = "Where LOOPBACK_POWER_TEMP_dBm (Temp[C]) = -0.07*Temp[C]  34 \\n"]
    #[doc = "Loopback power is -38 dBm around 50 C, and decreases with slope of"]
    #[doc = "-7 dBm/100C. These formulae can be used for monitoring reports not affected"]
    #[doc = "by interference. \\n"]
    #[doc = "For xWR6x43 devices: \\n"]
    #[doc = "RX gain value reported by the device assumes a constant loopback power."]
    #[doc = "Please refer to monitoring application notes for more information on"]
    #[doc = "computing the actual RX gain from the device reported gain value. \\n"]
    pub rxGainVal: [rlUInt16_t; 12usize],
    #[doc = " @brief  The measured RX phase for each enabled channel, at each enabled RF frequency is \\n"]
    #[doc = "reported here. Byte numbers corresponding to different RX and RF,  \\n"]
    #[doc = "in this field are here: \\n"]
    #[doc = "RF1     RF2     RF3 \\n"]
    #[doc = "RX0     1:0     9:8     17:16 \\n"]
    #[doc = "RX1     3:2     11:10   19:18 \\n"]
    #[doc = "RX2     5:4     13:12   21:20 \\n"]
    #[doc = "RX3     7:6     15:14   23:22 \\n"]
    #[doc = "LSB = 360 (degree)/2^16. \\n"]
    #[doc = "Only the entries of enabled RF Frequencies and enabled RX channels are \\n"]
    #[doc = "valid. \\n"]
    #[doc = "@note : these phases include an unknown bias common to all RX channels. \\n"]
    pub rxPhaseVal: [rlUInt16_t; 12usize],
    #[doc = " @brief  The measured RX noise power for each enabled channel, at RF1 & RF2 frequencies \\n"]
    #[doc = "(i.e., lowest and center in the profile's RF band) are reported here. Bit \\n"]
    #[doc = "numbers corresponding to different RX and RF, in this field are here: \\n"]
    #[doc = ""]
    #[doc = "| Bit         |   4:0   |   9:5   |  14:10  |  19:15  |  24:20  |  29:25  |"]
    #[doc = "| ----------: |         |         |         |         |         |         |"]
    #[doc = "| **RX & RF** | RX0.RF1 | RX1.RF1 | RX2.RF1 | RX3.RF1 | RX0.RF2 | RX1.RF2 |"]
    #[doc = ""]
    #[doc = "bit 31:30 - Reserved \\n"]
    #[doc = "1 LSB = -2 dBm. \\n"]
    #[doc = "Range: 0 to -62dBm \\n"]
    #[doc = "Noise Power shows a decreasing trend with temperature with average noise"]
    #[doc = "power being -43 dBm at 50 C and decreasing with slope = -8 dBm/100C. \\n"]
    #[doc = "Noise_Power_dBm (Temp[C]) =-0.08 * Temp [C] - 39 \\n"]
    #[doc = "Noise Power can be used for detecting the monitoring reports impacted by"]
    #[doc = "interference. \\n"]
    #[doc = ""]
    pub rxNoisePower1: rlUInt32_t,
    #[doc = " @brief  The measured RX noise power for each enabled channel, at RF2 & RF3 frequencies \\n"]
    #[doc = "(i.e., center and highest in the profile's RF band) are reported here. Bit \\n"]
    #[doc = "numbers corresponding to different RX and RF, in this field are here: \\n"]
    #[doc = ""]
    #[doc = "| Bit         |   4:0   |   9:5   |  14:10  |  19:15  |  24:20  |  29:25  |"]
    #[doc = "| ------:     |         |         |         |         |         |         |"]
    #[doc = "| **RX & RF** | RX2.RF2 | RX3.RF2 | RX0.RF3 | RX1.RF3 | RX2.RF3 | RX3.RF3 |"]
    #[doc = ""]
    #[doc = "bit 31:30 - Reserved \\n"]
    #[doc = "1 LSB = -2 dBm. \\n"]
    #[doc = "Range: 0 to -62dBm \\n"]
    #[doc = "Noise Power shows a decreasing trend with temperature with average noise"]
    #[doc = "power being -43 dBm at 50 C and decreasing with slope = -8 dBm/100C. \\n"]
    #[doc = "Noise_Power_dBm (Temp[C]) =-0.08 * Temp [C] - 39 \\n"]
    #[doc = "Noise Power can be used for detecting the monitoring reports impacted by"]
    #[doc = "interference. \\n"]
    pub rxNoisePower2: rlUInt32_t,
    #[doc = " @brief  This field indicates when the last monitoring  in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon exceeding allotted bit \\n"]
    #[doc = "width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonRxGainPhRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonRxGainPhRep>(),
        68usize,
        concat!("Size of: ", stringify!(rlMonRxGainPhRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonRxGainPhRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonRxGainPhRep))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxGainPhRep>())).statusFlags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxGainPhRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxGainPhRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxGainPhRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxGainPhRep>())).profIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxGainPhRep),
            "::",
            stringify!(profIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonRxGainPhRep>())).loopbackPowerRF1 as *const _ as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxGainPhRep),
            "::",
            stringify!(loopbackPowerRF1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonRxGainPhRep>())).loopbackPowerRF2 as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxGainPhRep),
            "::",
            stringify!(loopbackPowerRF2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonRxGainPhRep>())).loopbackPowerRF3 as *const _ as usize
        },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxGainPhRep),
            "::",
            stringify!(loopbackPowerRF3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxGainPhRep>())).rxGainVal as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxGainPhRep),
            "::",
            stringify!(rxGainVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxGainPhRep>())).rxPhaseVal as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxGainPhRep),
            "::",
            stringify!(rxPhaseVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxGainPhRep>())).rxNoisePower1 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxGainPhRep),
            "::",
            stringify!(rxNoisePower1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxGainPhRep>())).rxNoisePower2 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxGainPhRep),
            "::",
            stringify!(rxNoisePower2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxGainPhRep>())).timeStamp as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxGainPhRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonRxGainPhRep_t = rlMonRxGainPhRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends"]
#[doc = " to the host, containing the measured RX noise figure values"]
#[doc = " corresponding to the full IF band of a profile. RadarSS sends"]
#[doc = " this to host at the programmed periodicity or when failure occurs,"]
#[doc = " as programmed by the configuration API SB. Event: RL_RF_AE_MON_RX_NOISE_FIG_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonRxNoiseFigRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding to various threshold \\n"]
    #[doc = "checks under this monitor. \\n"]
    #[doc = "Bit  STATUS_FLAG for monitor \\n"]
    #[doc = "[0]  STATUS_RX_NOISE_FIGURE \\n"]
    #[doc = "[15:1]RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS  \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  Profile Index for which this monitoring report applies."]
    pub profIndex: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt16_t,
    #[doc = " @brief  TThe measured RX input referred for each enabled channel, at each enabled RF \\n"]
    #[doc = "frequency is reported here. Byte numbers corresponding to different RX \\n"]
    #[doc = "and RF, in this field are here: \\n"]
    #[doc = "RF1     RF2     RF3 \\n"]
    #[doc = "RX0     1:0     9:8     17:16 \\n"]
    #[doc = "RX1     3:2     11:10   19:18 \\n"]
    #[doc = "RX2     5:4     13:12   21:20 \\n"]
    #[doc = "RX3     7:6     15:14   23:22 \\n"]
    #[doc = "1 LSB = 0.1 dB \\n"]
    #[doc = "Only the entries of enabled RF Frequencies and enabled RX channels are \\n"]
    #[doc = "valid. \\n"]
    pub rxNoiseFigVal: [rlUInt16_t; 12usize],
    #[doc = " @brief  Reserved for future use"]
    pub reserved2: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved3: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved4: rlUInt32_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon \\n"]
    #[doc = "exceeding allotted bit width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonRxNoiseFigRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonRxNoiseFigRep>(),
        48usize,
        concat!("Size of: ", stringify!(rlMonRxNoiseFigRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonRxNoiseFigRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonRxNoiseFigRep))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxNoiseFigRep>())).statusFlags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxNoiseFigRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxNoiseFigRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxNoiseFigRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxNoiseFigRep>())).profIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxNoiseFigRep),
            "::",
            stringify!(profIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxNoiseFigRep>())).reserved0 as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxNoiseFigRep),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxNoiseFigRep>())).reserved1 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxNoiseFigRep),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonRxNoiseFigRep>())).rxNoiseFigVal as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxNoiseFigRep),
            "::",
            stringify!(rxNoiseFigVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxNoiseFigRep>())).reserved2 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxNoiseFigRep),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxNoiseFigRep>())).reserved3 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxNoiseFigRep),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxNoiseFigRep>())).reserved4 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxNoiseFigRep),
            "::",
            stringify!(reserved4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxNoiseFigRep>())).timeStamp as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxNoiseFigRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonRxNoiseFigRep_t = rlMonRxNoiseFigRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends to the host, containing the measured"]
#[doc = " RX IF filter attenuation values at the given IF frequencies. RadarSS sends this to host"]
#[doc = " at the programmed periodicity or when failure occurs, as programmed by the configuration API SB."]
#[doc = " Event: RL_RF_AE_MON_RX_IF_STAGE_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonRxIfStageRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding to various threshold \\n"]
    #[doc = "checks under this monitor. \\n"]
    #[doc = "Bit  STATUS_FLAG for monitor \\n"]
    #[doc = "[0]  STATUS_RX_HPF_ERROR \\n"]
    #[doc = "[1]  RESERVED \\n"]
    #[doc = "[2]  STATUS_RX_IFA_GAIN_ERROR \\n"]
    #[doc = "[15:3]RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS  \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  Profile Index for which this monitoring report applies."]
    pub profIndex: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt16_t,
    #[doc = " @brief  The deviations of RX IFA HPF cutoff frequency from the ideally expected values \\n"]
    #[doc = "for all the enabled RX channels are reported here. \\n"]
    #[doc = "HPF_CUTOFF_FREQ_ERROR = 100*(Measured Cutoff Frequency /  \\n"]
    #[doc = "Expected Cutoff Frequency) - 100, \\n"]
    #[doc = "for RX IF filter in the HPF region. \\n"]
    #[doc = "Byte numbers corresponding to measured cutoff frequency error  \\n"]
    #[doc = "on different RX channels, in this field are here: \\n"]
    #[doc = "I channel   Q channel \\n"]
    #[doc = "RX0     0           4 \\n"]
    #[doc = "RX1     1           5 \\n"]
    #[doc = "RX2     2           6 \\n"]
    #[doc = "RX3     3           7 \\n"]
    #[doc = "1 LSB = 1%, signed number \\n"]
    #[doc = "Applicable only for the enabled channels. \\n"]
    pub hpfCutOffFreqEr: [rlInt8_t; 8usize],
    #[doc = " @brief  The deviations of RX IFA LPF cutoff frequency \\n"]
    #[doc = "from the ideally expected values for all the enabled \\n"]
    #[doc = "RX channels are reported here. \\n"]
    #[doc = "LPF_CUTOFF_FREQ_ERROR = 100*(Measured Cutoff Frequency / \\n"]
    #[doc = "Expected Cutoff Frequency) - 100, for RX IF filter in the LPF \\n"]
    #[doc = "region. \\n"]
    #[doc = "Byte numbers corresponding to measured cutoff frequency error \\n"]
    #[doc = "on different RX channels, in this field are here: \\n"]
    #[doc = "I channel   Q channel \\n"]
    #[doc = "RX0     0           4 \\n"]
    #[doc = "RX1     1           5 \\n"]
    #[doc = "RX2     2           6 \\n"]
    #[doc = "RX3     3           7 \\n"]
    #[doc = "1 LSB = 1%, signed number \\n"]
    #[doc = "Applicable only for the enabled channels. \\n"]
    #[doc = "@note : This field is not applicable in this release for all devices. This is a RESERVED"]
    #[doc = "field and will be set to 0."]
    pub lpfCutOffFreqEr: [rlInt8_t; 8usize],
    #[doc = " @brief  The deviations of RX IFA Gain from the ideally expected \\n"]
    #[doc = "values for all the enabled RX channels are reported here. \\n"]
    #[doc = "Byte numbers corresponding to measured cutoff frequency error \\n"]
    #[doc = "on different RX channels and HPF/LPF, in this field are here: \\n"]
    #[doc = "I channel   Q channel \\n"]
    #[doc = "RX0     0           4 \\n"]
    #[doc = "RX1     1           5 \\n"]
    #[doc = "RX2     2           6 \\n"]
    #[doc = "RX3     3           7 \\n"]
    #[doc = "1 LSB = 0.1dB, signed number \\n"]
    #[doc = "Applicable only for the enabled channels. \\n"]
    pub rxIfaGainErVal: [rlInt8_t; 8usize],
    #[doc = " @brief  Expected IF gain"]
    #[doc = " 1 LSB = 1 dB, 8 bit signed number"]
    pub ifGainExp: rlInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved2: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved3: rlUInt16_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved4: rlUInt32_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon exceeding allotted bit width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonRxIfStageRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonRxIfStageRep>(),
        44usize,
        concat!("Size of: ", stringify!(rlMonRxIfStageRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonRxIfStageRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonRxIfStageRep))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIfStageRep>())).statusFlags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIfStageRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIfStageRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIfStageRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIfStageRep>())).profIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIfStageRep),
            "::",
            stringify!(profIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIfStageRep>())).reserved0 as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIfStageRep),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIfStageRep>())).reserved1 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIfStageRep),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonRxIfStageRep>())).hpfCutOffFreqEr as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIfStageRep),
            "::",
            stringify!(hpfCutOffFreqEr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonRxIfStageRep>())).lpfCutOffFreqEr as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIfStageRep),
            "::",
            stringify!(lpfCutOffFreqEr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonRxIfStageRep>())).rxIfaGainErVal as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIfStageRep),
            "::",
            stringify!(rxIfaGainErVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIfStageRep>())).ifGainExp as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIfStageRep),
            "::",
            stringify!(ifGainExp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIfStageRep>())).reserved2 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIfStageRep),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIfStageRep>())).reserved3 as *const _ as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIfStageRep),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIfStageRep>())).reserved4 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIfStageRep),
            "::",
            stringify!(reserved4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIfStageRep>())).timeStamp as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIfStageRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonRxIfStageRep_t = rlMonRxIfStageRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends to the host, containing the"]
#[doc = " measured TX power values during an explicit monitoring chirp. RadarSS sends this to"]
#[doc = " host at the programmed periodicity or when failure occurs, as programmed by the"]
#[doc = " configuration API SB. Same structure is application for Tx0/Tx1/Tx2 power report."]
#[doc = " Event: RL_RF_AE_MON_TXn_POWER_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonTxPowRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding \\n"]
    #[doc = "to various threshold checks under this monitor. \\n"]
    #[doc = "Bit  STATUS_FLAG for monitor \\n"]
    #[doc = "[0]  STATUS_ABS_ERR \\n"]
    #[doc = "[1]  STATUS_FLATNESS_ERR \\n"]
    #[doc = "[15:2]RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS  \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  Profile Index for which this monitoring report applies."]
    pub profIndex: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt16_t,
    #[doc = " @brief  The measured TX power for each enabled channel, at each enabled RF frequency is \\n"]
    #[doc = "reported here. Byte numbers corresponding to different TX and RF, in this \\n"]
    #[doc = "field are here: \\n"]
    #[doc = "RF1     RF2     RF3 \\n"]
    #[doc = "TX      1:0     3:2     5:4 \\n"]
    #[doc = "(other bytes are reserved) \\n"]
    #[doc = "1 LSB = 0.1 dBm, signed number \\n"]
    #[doc = "Only the entries of enabled RF Frequencies and enabled RX \\n"]
    #[doc = "channels are valid. \\n"]
    pub txPowVal: [rlInt16_t; 3usize],
    #[doc = " @brief  Reserved for future use"]
    pub reserved2: rlUInt16_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon \\n"]
    #[doc = "exceeding allotted bit width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonTxPowRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonTxPowRep>(),
        20usize,
        concat!("Size of: ", stringify!(rlMonTxPowRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonTxPowRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonTxPowRep))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxPowRep>())).statusFlags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxPowRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxPowRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxPowRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxPowRep>())).profIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxPowRep),
            "::",
            stringify!(profIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxPowRep>())).reserved0 as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxPowRep),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxPowRep>())).reserved1 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxPowRep),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxPowRep>())).txPowVal as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxPowRep),
            "::",
            stringify!(txPowVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxPowRep>())).reserved2 as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxPowRep),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxPowRep>())).timeStamp as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxPowRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonTxPowRep_t = rlMonTxPowRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends to the host, containing the measured"]
#[doc = " TX reflection coefficient's magnitude values, meant for detecting TX ball break. RadarSS sends"]
#[doc = " this to host at the programmed periodicity or when failure occurs, as programmed by the"]
#[doc = " configuration API SB."]
#[doc = " Same strucuture is applicable for Tx0/Tx1/Tx2 ball break report."]
#[doc = " Event: RL_RF_AE_MON_TXn_BALLBREAK_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonTxBallBreakRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding \\n"]
    #[doc = "to various threshold checks under this monitor. \\n"]
    #[doc = "Bit  STATUS_FLAG for monitor \\n"]
    #[doc = "[0]  STATUS_TXn_BALLBREAK \\n"]
    #[doc = "[15:1]RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS  \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  The TX reflection coefficient's magnitude for this channel is reported here. \\n"]
    #[doc = "1 LSB = 0.1 dB, signed number \\n"]
    pub txReflCoefVal: rlInt16_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt16_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt32_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon \\n"]
    #[doc = "exceeding allotted bit width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonTxBallBreakRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonTxBallBreakRep>(),
        16usize,
        concat!("Size of: ", stringify!(rlMonTxBallBreakRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonTxBallBreakRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonTxBallBreakRep))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonTxBallBreakRep>())).statusFlags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBallBreakRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxBallBreakRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBallBreakRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonTxBallBreakRep>())).txReflCoefVal as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBallBreakRep),
            "::",
            stringify!(txReflCoefVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxBallBreakRep>())).reserved0 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBallBreakRep),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxBallBreakRep>())).reserved1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBallBreakRep),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxBallBreakRep>())).timeStamp as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBallBreakRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonTxBallBreakRep_t = rlMonTxBallBreakRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends to the host, containing the measured Tx"]
#[doc = " gain and phase mismatch values during an explicit monitoring chirp. RadarSS sends this to host"]
#[doc = " at the programmed periodicity or when failure occurs, as programmed by the configuration API SB."]
#[doc = " Event: RL_RF_AE_MON_TX_GAIN_MISMATCH_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonTxGainPhaMisRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding \\n"]
    #[doc = "to various threshold checks under this monitor. \\n"]
    #[doc = "Bit  STATUS_FLAG for monitor \\n"]
    #[doc = "[0]  STATUS_TX_GAIN_MISMATCH \\n"]
    #[doc = "[1]  STATUS_TX_PHASE_MISMATCH \\n"]
    #[doc = "[15:2]RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  Profile Index for which this monitoring report applies."]
    pub profIndex: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt16_t,
    #[doc = " @brief   The measured TX PA loopback tone power at the RX ADC input, \\n"]
    #[doc = "for each enabled TX channel, at each enabled RF frequency is reported \\n"]
    #[doc = "here. Byte numbers corresponding to different TX and RF, in this field are \\n"]
    #[doc = "here: \\n"]
    #[doc = "RF1     RF2     RF3 \\n"]
    #[doc = "TX0     1:0     7:6     13:12 \\n"]
    #[doc = "TX1     3:2     9:8     15:14 \\n"]
    #[doc = "TX2     5:4     11:10   17:16 \\n"]
    #[doc = "1 LSB = 0.1dBm, signed number \\n"]
    #[doc = "Only the entries of enabled RF Frequencies and enabled TX channels are valid. \\n"]
    pub txGainVal: [rlInt16_t; 9usize],
    #[doc = " @brief  The measured TX phase for each enabled channel, at each enabled RF \\n"]
    #[doc = "frequency is reported here.Byte numbers corresponding to different TX and \\n"]
    #[doc = "RF, in this field are here: \\n"]
    #[doc = "RF1     RF2     RF3 \\n"]
    #[doc = "TX0     1:0     7:6     13:12 \\n"]
    #[doc = "TX1     3:2     9:8     15:14 \\n"]
    #[doc = "TX2     5:4     11:10   17:16 \\n"]
    #[doc = "1 LSB = 360(degree)/2^16. \\n"]
    #[doc = "Only the entries of enabled RF Frequencies and enabled TX channels are \\n"]
    #[doc = "valid. \\n"]
    #[doc = "Note: these phases include an unknown bias common to all TX channels. \\n"]
    pub txPhaVal: [rlUInt16_t; 9usize],
    #[doc = " @brief  Reserved for future use"]
    pub reserved2: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved3: rlUInt32_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon exceeding allotted bit width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonTxGainPhaMisRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonTxGainPhaMisRep>(),
        56usize,
        concat!("Size of: ", stringify!(rlMonTxGainPhaMisRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonTxGainPhaMisRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonTxGainPhaMisRep))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonTxGainPhaMisRep>())).statusFlags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxGainPhaMisRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxGainPhaMisRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxGainPhaMisRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxGainPhaMisRep>())).profIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxGainPhaMisRep),
            "::",
            stringify!(profIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxGainPhaMisRep>())).reserved0 as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxGainPhaMisRep),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxGainPhaMisRep>())).reserved1 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxGainPhaMisRep),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxGainPhaMisRep>())).txGainVal as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxGainPhaMisRep),
            "::",
            stringify!(txGainVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxGainPhaMisRep>())).txPhaVal as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxGainPhaMisRep),
            "::",
            stringify!(txPhaVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxGainPhaMisRep>())).reserved2 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxGainPhaMisRep),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxGainPhaMisRep>())).reserved3 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxGainPhaMisRep),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxGainPhaMisRep>())).timeStamp as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxGainPhaMisRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonTxGainPhaMisRep_t = rlMonTxGainPhaMisRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends to the host, containing the measured"]
#[doc = " TX1 BPM error values. RadarSS sends this to host at the programmed periodicity or when failure"]
#[doc = " occurs, as programmed by the configuration API SB. Same structure is applicable for"]
#[doc = " Tx0/Tx1/Tx2 BPM report data."]
#[doc = " Event: RL_RF_AE_MON_TXn_BPM_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonTxBpmRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding \\n"]
    #[doc = "to various threshold checks under this monitor. \\n"]
    #[doc = "Bit  STATUS_FLAG for monitor \\n"]
    #[doc = "[0]  STATUS_TXn_BPM_PHASE \\n"]
    #[doc = "[1]  STATUS_TXn_BPM_AMPLITUDE \\n"]
    #[doc = "[2]  RESERVED \\n"]
    #[doc = "[15:3]RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS  \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  Profile Index for which this monitoring report applies."]
    pub profIndex: rlUInt8_t,
    #[doc = " @brief  MSB of phase shifter monitor 2 for TX. \\n"]
    #[doc = "phaseShifterMonVal2 = phaseShifterMonVal2Msb * pow(2,8) + \\n"]
    #[doc = "phaseShifterMonVal2Lsb \\n"]
    #[doc = "1 LSB = (360 degree) / pow(2,16) \\n"]
    pub phaseShifterMonVal2Msb: rlUInt8_t,
    #[doc = " @brief  Monitored phase shift for phase shifter monitor 1 for TX"]
    #[doc = "1 LSB = (360 degree) / pow(2,16) \\n"]
    pub phaseShifterMonVal1: rlUInt16_t,
    #[doc = " @brief  The TX output phase difference between the two BPM settings (phase for TX BPM \\n"]
    #[doc = "setting 0 - phase for TX BPM setting 1) is reported here. \\n"]
    #[doc = "1 LSB = 360(degree)/2^16. \\n"]
    pub txBpmPhaDiff: rlUInt16_t,
    #[doc = " @brief  The deviation of the TX output amplitude difference between the two \\n"]
    #[doc = "BPM settings (amplitude for TX BPM setting 0 - amplitude for TX \\n"]
    #[doc = "BPM setting 1) from the ideal 0dB is reported here. \\n"]
    #[doc = "1 LSB = 0.1dB, signed number \\n"]
    pub txBpmAmpDiff: rlInt8_t,
    #[doc = " @brief  LSB of phase shifter monitor 2 for TX. \\n"]
    #[doc = "phaseShifterMonVal2 = phaseShifterMonVal2Msb * pow(2,8) + \\n"]
    #[doc = "phaseShifterMonVal2Lsb \\n"]
    #[doc = "1 LSB = (360 degree) / pow(2,16) \\n"]
    pub phaseShifterMonVal2Lsb: rlUInt8_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon exceeding allotted bit \\n"]
    #[doc = "width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonTxBpmRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonTxBpmRep>(),
        16usize,
        concat!("Size of: ", stringify!(rlMonTxBpmRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonTxBpmRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonTxBpmRep))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxBpmRep>())).statusFlags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBpmRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxBpmRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBpmRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxBpmRep>())).profIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBpmRep),
            "::",
            stringify!(profIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonTxBpmRep>())).phaseShifterMonVal2Msb as *const _ as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBpmRep),
            "::",
            stringify!(phaseShifterMonVal2Msb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonTxBpmRep>())).phaseShifterMonVal1 as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBpmRep),
            "::",
            stringify!(phaseShifterMonVal1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxBpmRep>())).txBpmPhaDiff as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBpmRep),
            "::",
            stringify!(txBpmPhaDiff)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxBpmRep>())).txBpmAmpDiff as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBpmRep),
            "::",
            stringify!(txBpmAmpDiff)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonTxBpmRep>())).phaseShifterMonVal2Lsb as *const _ as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBpmRep),
            "::",
            stringify!(phaseShifterMonVal2Lsb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxBpmRep>())).timeStamp as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxBpmRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonTxBpmRep_t = rlMonTxBpmRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends to the host, containing information"]
#[doc = " related to measured frequency error during the chirp. RadarSS sends this to host at the"]
#[doc = " programmed periodicity or when failure occurs, as programmed by the configuration API SB."]
#[doc = " Event: RL_RF_AE_MON_SYNTHESIZER_FREQ_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonSynthFreqRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding to various threshold \\n"]
    #[doc = "checks under this monitor. \\n"]
    #[doc = "Bit  STATUS_FLAG for monitor \\n"]
    #[doc = "[0]  STATUS_SYNTH_FREQ_ERR \\n"]
    #[doc = "[15:1]RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  Profile Index for which this monitoring report applies."]
    pub profIndex: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt16_t,
    #[doc = " @brief  This field indicates the maximum instantaneous frequency error measured  \\n"]
    #[doc = "during the chirps for which frequency monitoring has been enabled in the \\n"]
    #[doc = "previous monitoring period. \\n"]
    #[doc = "Bits    Parameter \\n"]
    #[doc = "31:0    Maximum frequency error value, signed number. 1 LSB = 1kHz. \\n"]
    pub maxFreqErVal: rlInt32_t,
    #[doc = " @brief  This field indicates the number of times during chirping in the previous \\n"]
    #[doc = "monitoring period in which the measured frequency error violated the \\n"]
    #[doc = "allowed threshold. Frequency error threshold violation is counted every \\n"]
    #[doc = "10ns. \\n"]
    #[doc = "Bits    Parameter \\n"]
    #[doc = "31:19   RESERVED \\n"]
    #[doc = "18:0    Failure count, unsigned number. \\n"]
    pub freqFailCnt: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved2: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved3: rlUInt32_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon exceeding allotted bit \\n"]
    #[doc = "width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonSynthFreqRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonSynthFreqRep>(),
        28usize,
        concat!("Size of: ", stringify!(rlMonSynthFreqRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonSynthFreqRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonSynthFreqRep))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonSynthFreqRep>())).statusFlags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonSynthFreqRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonSynthFreqRep>())).profIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqRep),
            "::",
            stringify!(profIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonSynthFreqRep>())).reserved0 as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqRep),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonSynthFreqRep>())).reserved1 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqRep),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonSynthFreqRep>())).maxFreqErVal as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqRep),
            "::",
            stringify!(maxFreqErVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonSynthFreqRep>())).freqFailCnt as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqRep),
            "::",
            stringify!(freqFailCnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonSynthFreqRep>())).reserved2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqRep),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonSynthFreqRep>())).reserved3 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqRep),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonSynthFreqRep>())).timeStamp as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonSynthFreqRep_t = rlMonSynthFreqRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends to the host, containing the external"]
#[doc = " signal voltage values measured using the GPADC. RadarSS sends this to host at the programmed"]
#[doc = " periodicity or when failure occurs, as programmed by the configuration API SB."]
#[doc = " Event: RL_RF_AE_MON_EXT_ANALOG_SIG_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonExtAnaSigRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding \\n"]
    #[doc = "to various threshold checks under this monitor. \\n"]
    #[doc = "Bit  STATUS_FLAG for monitor \\n"]
    #[doc = "0    STATUS_ANALOGTEST1 \\n"]
    #[doc = "1    STATUS_ANALOGTEST2 \\n"]
    #[doc = "2    STATUS_ANALOGTEST3 \\n"]
    #[doc = "3    STATUS_ANALOGTEST4 \\n"]
    #[doc = "4    STATUS_ANAMUX \\n"]
    #[doc = "5    STATUS_VSENSE \\n"]
    #[doc = "15:3 RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS  \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  MEASURED_VALUE \\n"]
    #[doc = "Bytes   SIGNAL \\n"]
    #[doc = "1:0     ANALOGTEST1 \\n"]
    #[doc = "3:2     ANALOGTEST2 \\n"]
    #[doc = "5:4     ANALOGTEST3 \\n"]
    #[doc = "7:6     ANALOGTEST4 \\n"]
    #[doc = "9:8     ANAMUX \\n"]
    #[doc = "11:10   VSENSE \\n"]
    #[doc = "1 LSB = 1.8V/1024  \\n"]
    pub extAnaSigVal: [rlInt16_t; 6usize],
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt32_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon exceeding allotted bit \\n"]
    #[doc = "width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonExtAnaSigRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonExtAnaSigRep>(),
        24usize,
        concat!("Size of: ", stringify!(rlMonExtAnaSigRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonExtAnaSigRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonExtAnaSigRep))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonExtAnaSigRep>())).statusFlags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonExtAnaSigRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonExtAnaSigRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonExtAnaSigRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonExtAnaSigRep>())).extAnaSigVal as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonExtAnaSigRep),
            "::",
            stringify!(extAnaSigVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonExtAnaSigRep>())).reserved as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonExtAnaSigRep),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonExtAnaSigRep>())).timeStamp as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonExtAnaSigRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonExtAnaSigRep_t = rlMonExtAnaSigRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends to the host, containing information"]
#[doc = " about Internal TX internal analog signals. RadarSS sends this to host at the programmed"]
#[doc = " periodicity or when failure occurs, as programmed by the configuration API SB. Same structure"]
#[doc = " is applicable for Tx0/Tx1/Tx2 monitoring report. Event: RL_RF_AE_MON_TXn_INT_ANA_SIG_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonTxIntAnaSigRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding to various threshold \\n"]
    #[doc = "checks under this monitor. \\n"]
    #[doc = "Bit  STATUS_FLAG for monitor \\n"]
    #[doc = "[0]  STATUS_SUPPLY_TXn \\n"]
    #[doc = "[1]  STATUS_DCBIAS_TXn \\n"]
    #[doc = "[2]  STATUS_PS_DAC_TXn \\n"]
    #[doc = "[15:3]RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS  \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  Profile Index for which this monitoring report applies."]
    pub profIndex: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt8_t,
    #[doc = " @brief  Phase shifter DAC I arm delta min value across different DAC settings"]
    #[doc = "1 LSB = 1.8V/1024"]
    #[doc = "@note : This field is applicable only for xWR6843 and xWR1843 devices only."]
    pub phShiftDacIdeltaMin: rlUInt8_t,
    #[doc = " @brief  Phase shifter DAC Q arm delta min value across different DAC settings"]
    #[doc = "1 LSB = 1.8V/1024"]
    #[doc = "@note : This field is applicable only for xWR6843 and xWR1843 devices only."]
    pub phShiftDacQdeltaMin: rlUInt8_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon \\n"]
    #[doc = "exceeding allotted bit width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonTxIntAnaSigRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonTxIntAnaSigRep>(),
        12usize,
        concat!("Size of: ", stringify!(rlMonTxIntAnaSigRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonTxIntAnaSigRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonTxIntAnaSigRep))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonTxIntAnaSigRep>())).statusFlags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxIntAnaSigRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxIntAnaSigRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxIntAnaSigRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxIntAnaSigRep>())).profIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxIntAnaSigRep),
            "::",
            stringify!(profIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxIntAnaSigRep>())).reserved0 as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxIntAnaSigRep),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonTxIntAnaSigRep>())).phShiftDacIdeltaMin as *const _
                as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxIntAnaSigRep),
            "::",
            stringify!(phShiftDacIdeltaMin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonTxIntAnaSigRep>())).phShiftDacQdeltaMin as *const _
                as usize
        },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxIntAnaSigRep),
            "::",
            stringify!(phShiftDacQdeltaMin)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonTxIntAnaSigRep>())).timeStamp as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonTxIntAnaSigRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonTxIntAnaSigRep_t = rlMonTxIntAnaSigRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends to the host, containing information"]
#[doc = " about Internal RX internal analog signals. RadarSS sends this to host at the programmed"]
#[doc = " periodicity or when failure occurs, as programmed by the configuration API SB."]
#[doc = " Event: RL_RF_AE_MON_RX_INT_ANALOG_SIG_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonRxIntAnaSigRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding to various threshold \\n"]
    #[doc = "checks under this monitor. \\n"]
    #[doc = "Bit      STATUS_FLAG for monitor \\n"]
    #[doc = "0        STATUS_SUPPLY_RX0 \\n"]
    #[doc = "1        STATUS_SUPPLY_RX1 \\n"]
    #[doc = "2        STATUS_SUPPLY_RX2 \\n"]
    #[doc = "3        STATUS_SUPPLY_RX3 \\n"]
    #[doc = "4        STATUS_DCBIAS_RX0 \\n"]
    #[doc = "5        STATUS_DCBIAS_RX1 \\n"]
    #[doc = "6        STATUS_DCBIAS_RX2 \\n"]
    #[doc = "7        STATUS_DCBIAS_RX3 \\n"]
    #[doc = "15:8    RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS  \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  Profile Index for which this monitoring report applies."]
    pub profIndex: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt16_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon exceeding allotted bit \\n"]
    #[doc = "width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonRxIntAnaSigRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonRxIntAnaSigRep>(),
        12usize,
        concat!("Size of: ", stringify!(rlMonRxIntAnaSigRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonRxIntAnaSigRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonRxIntAnaSigRep))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonRxIntAnaSigRep>())).statusFlags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIntAnaSigRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIntAnaSigRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIntAnaSigRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIntAnaSigRep>())).profIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIntAnaSigRep),
            "::",
            stringify!(profIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIntAnaSigRep>())).reserved0 as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIntAnaSigRep),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIntAnaSigRep>())).reserved1 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIntAnaSigRep),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxIntAnaSigRep>())).timeStamp as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxIntAnaSigRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonRxIntAnaSigRep_t = rlMonRxIntAnaSigRep;
#[doc = " \\brief"]
#[doc = " This API is a Monitoring Report API which the AWR device sends to the host, containing"]
#[doc = " information about Internal PM, CLK and LO subsystems' internal analog signals and in cascade"]
#[doc = " devices the 20GHz SYNC IN/OUT power. The AWR device sends this to host at the programmed"]
#[doc = " periodicity or when failure occurs, as programmed by the configuration API SB."]
#[doc = " Event: RL_RF_AE_MON_PMCLKLO_INT_ANA_SIG_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonPmclkloIntAnaSigRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding to various threshold \\n"]
    #[doc = "checks under this monitor. \\n"]
    #[doc = "Bit      STATUS_FLAG for monitor \\n"]
    #[doc = "0        STATUS_SUPPLY_PMCLKLO \\n"]
    #[doc = "1        STATUS_DCBIAS_PMCLKLO \\n"]
    #[doc = "2        STATUS_LVDS_PMCLKLO (Use this status bit only if LVDS is used, \\n"]
    #[doc = "else ignorethis) \\n"]
    #[doc = "3        RESERVED \\n"]
    #[doc = "15:4     RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS  \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  Profile Index for which this monitoring report applies."]
    pub profIndex: rlUInt8_t,
    #[doc = " @brief  Monitored 20GHz signal power, signed number \\n"]
    #[doc = "         1 LSB = 0.5 dBm \\n"]
    #[doc = "         The 20GHz SYNC monitor is done at 77GHz RF frequency. \\n"]
    #[doc = "         @note : This field is not supported in xWR6x43 devices."]
    pub sync20GPower: rlInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt16_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon \\n"]
    #[doc = "exceeding allotted bit width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonPmclkloIntAnaSigRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonPmclkloIntAnaSigRep>(),
        12usize,
        concat!("Size of: ", stringify!(rlMonPmclkloIntAnaSigRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonPmclkloIntAnaSigRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonPmclkloIntAnaSigRep))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonPmclkloIntAnaSigRep>())).statusFlags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonPmclkloIntAnaSigRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonPmclkloIntAnaSigRep>())).errorCode as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonPmclkloIntAnaSigRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonPmclkloIntAnaSigRep>())).profIndex as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonPmclkloIntAnaSigRep),
            "::",
            stringify!(profIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonPmclkloIntAnaSigRep>())).sync20GPower as *const _ as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonPmclkloIntAnaSigRep),
            "::",
            stringify!(sync20GPower)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonPmclkloIntAnaSigRep>())).reserved as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonPmclkloIntAnaSigRep),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonPmclkloIntAnaSigRep>())).timeStamp as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonPmclkloIntAnaSigRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonPmclkloIntAnaSigRep_t = rlMonPmclkloIntAnaSigRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends to the host, containing information"]
#[doc = " about the measured value of the GPADC input DC signals whose measurements were enabled."]
#[doc = " RadarSS sends this to host at the programmed periodicity or when failure occurs, as programmed"]
#[doc = " by the configuration API."]
#[doc = " SB. Event: RL_RF_AE_MON_GPADC_INT_ANA_SIG_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonGpadcIntAnaSigRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding to various threshold \\n"]
    #[doc = "checks under this monitor. \\n"]
    #[doc = "Bit      STATUS_FLAG for monitor \\n"]
    #[doc = "0        STATUS_GPADC_REF1 \\n"]
    #[doc = "1        STATUS_GPADC_REF2 \\n"]
    #[doc = "15:2     RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS  \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  The measured GPADC outputs corresponding to internal DC signal (GPADC_REF1, \\n"]
    #[doc = "expected level 0.45V) is reported here. \\n"]
    #[doc = "1 LSB = 1.8V/1024  \\n"]
    pub gpadcRef1Val: rlInt16_t,
    #[doc = " @brief  The measured GPADC outputs corresponding to internal DC signal (GPADC_REF2, \\n"]
    #[doc = "expected level 1.2V) is reported here. \\n"]
    #[doc = "1 LSB = 1.8V/1024  \\n"]
    pub gpadcRef2Val: rlUInt16_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt32_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon exceeding allotted bit \\n"]
    #[doc = "width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonGpadcIntAnaSigRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonGpadcIntAnaSigRep>(),
        16usize,
        concat!("Size of: ", stringify!(rlMonGpadcIntAnaSigRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonGpadcIntAnaSigRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonGpadcIntAnaSigRep))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonGpadcIntAnaSigRep>())).statusFlags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonGpadcIntAnaSigRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonGpadcIntAnaSigRep>())).errorCode as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonGpadcIntAnaSigRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonGpadcIntAnaSigRep>())).gpadcRef1Val as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonGpadcIntAnaSigRep),
            "::",
            stringify!(gpadcRef1Val)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonGpadcIntAnaSigRep>())).gpadcRef2Val as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonGpadcIntAnaSigRep),
            "::",
            stringify!(gpadcRef2Val)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonGpadcIntAnaSigRep>())).reserved as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonGpadcIntAnaSigRep),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonGpadcIntAnaSigRep>())).timeStamp as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonGpadcIntAnaSigRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonGpadcIntAnaSigRep_t = rlMonGpadcIntAnaSigRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends to the host, containing the measured PLL"]
#[doc = " control voltage values during explicit monitoring chirps. RadarSS sends this to host at the"]
#[doc = " programmed periodicity or when failure occurs, as programmed by the configuration API SB."]
#[doc = " Event: RL_RF_AE_MON_PLL_CONTROL_VOLT_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonPllConVoltRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding to various threshold \\n"]
    #[doc = "checks under this monitor. \\n"]
    #[doc = "Bit      STATUS_FLAG for monitor \\n"]
    #[doc = "0        STATUS_APLL_VCTRL \\n"]
    #[doc = "1        STATUS_SYNTH_VCO1_VCTRL_MAX_ FREQ \\n"]
    #[doc = "2        STATUS_SYNTH_VCO1_VCTRL_MIN_ FREQ \\n"]
    #[doc = "3        RESERVED \\n"]
    #[doc = "4        STATUS_SYNTH_VCO2_VCTRL_MAX_ FREQ \\n"]
    #[doc = "5        STATUS_SYNTH_VCO2_VCTRL_MIN_ FREQ \\n"]
    #[doc = "6        RESERVED \\n"]
    #[doc = "15:7     RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  The measured values of PLL control voltage levels and Synthesizer VCO slopes are \\n"]
    #[doc = "reported here. Byte numbers corresponding to different control voltage \\n"]
    #[doc = "values reported in this field are here:  \\n"]
    #[doc = "Bytes   SIGNAL                              1 LSB \\n"]
    #[doc = "1:0     APLL_VCTRL                          1mV  \\n"]
    #[doc = "3:2     SYNTH_VCO1_VCTRL_MAX_ FREQ          1mV \\n"]
    #[doc = "5:4     SYNTH_VCO1_VCTRL_MIN_ FREQ          1mV \\n"]
    #[doc = "7:6     SYNTH_VCO1_SLOPE                    1MHz/V \\n"]
    #[doc = "9:8     SYNTH_VCO2_VCTRL_MAX_ FREQ          1mV \\n"]
    #[doc = "11:10   SYNTH_VCO2_VCTRL_MIN_ FREQ          1mV \\n"]
    #[doc = "13:12   SYNTH_VCO2_SLOPE                    1MHz/V \\n"]
    #[doc = "15:14   RESERVED                            RESERVED \\n"]
    #[doc = "Only the fields corresponding to the enabled monitors are valid.  \\n"]
    #[doc = "The failure thresholds are based on the following: \\n"]
    #[doc = "Valid VCTRL values are [140 to 1400] mV. \\n"]
    #[doc = "Valid VCO1_SLOPE values are [1760 to 2640] MHz/V. \\n"]
    #[doc = "Valid VCO2_SLOPE values are [3520 to 5280] MHz/V. \\n"]
    #[doc = "@note : The VCOx SLOPE should be ignored when synth fault is injected. \\n"]
    pub pllContVoltVal: [rlInt16_t; 8usize],
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt32_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon exceeding allotted bit \\n"]
    #[doc = "width)"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonPllConVoltRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonPllConVoltRep>(),
        28usize,
        concat!("Size of: ", stringify!(rlMonPllConVoltRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonPllConVoltRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonPllConVoltRep))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonPllConVoltRep>())).statusFlags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonPllConVoltRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonPllConVoltRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonPllConVoltRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonPllConVoltRep>())).pllContVoltVal as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonPllConVoltRep),
            "::",
            stringify!(pllContVoltVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonPllConVoltRep>())).reserved as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonPllConVoltRep),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonPllConVoltRep>())).timeStamp as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonPllConVoltRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonPllConVoltRep_t = rlMonPllConVoltRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which RadarSS sends to the host, containing information about"]
#[doc = " the relative frequency measurements. RadarSS sends this to host at the programmed periodicity or"]
#[doc = " when failure occurs, as programmed by the configuration API SB."]
#[doc = " Event: RL_RF_AE_MON_DCC_CLK_FREQ_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonDccClkFreqRep {
    #[doc = " @brief  Status flags indicating pass fail results corresponding to various threshold \\n"]
    #[doc = "checks under this monitor. \\n"]
    #[doc = "Bit      STATUS_FLAG for monitor \\n"]
    #[doc = "0        STATUS_CLK_PAIR0 \\n"]
    #[doc = "1        STATUS_CLK_PAIR1 \\n"]
    #[doc = "2        STATUS_CLK_PAIR2 \\n"]
    #[doc = "3        STATUS_CLK_PAIR3 \\n"]
    #[doc = "4        STATUS_CLK_PAIR4 \\n"]
    #[doc = "15:5    RESERVED \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief  Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  The measured clock frequencies from the enabled clock pair measurements are \\n"]
    #[doc = "reported here.Byte numbers corresponding to different frequency measurement \\n"]
    #[doc = "values reported in this field are here: \\n"]
    #[doc = "Bytes   CLOCK PAIR  MEASURED CLOCK FREQUENCY \\n"]
    #[doc = "1:0     0           BSS_600M \\n"]
    #[doc = "3:2     1           BSS_200M \\n"]
    #[doc = "5:4     2           BSS_100M \\n"]
    #[doc = "7:6     3           GPADC_10M \\n"]
    #[doc = "9:8     4           RCOSC_10M \\n"]
    #[doc = "15:10   RESERVED    RESERVED \\n"]
    #[doc = "1 LSB = 0.1 MHz, unsigned number \\n"]
    pub freqMeasVal: [rlUInt16_t; 8usize],
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt32_t,
    #[doc = " @brief  This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon exceeding allotted bit \\n"]
    #[doc = "width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonDccClkFreqRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonDccClkFreqRep>(),
        28usize,
        concat!("Size of: ", stringify!(rlMonDccClkFreqRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonDccClkFreqRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonDccClkFreqRep))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonDccClkFreqRep>())).statusFlags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonDccClkFreqRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonDccClkFreqRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonDccClkFreqRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonDccClkFreqRep>())).freqMeasVal as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonDccClkFreqRep),
            "::",
            stringify!(freqMeasVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonDccClkFreqRep>())).reserved as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonDccClkFreqRep),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonDccClkFreqRep>())).timeStamp as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonDccClkFreqRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonDccClkFreqRep_t = rlMonDccClkFreqRep;
#[doc = " \\brief"]
#[doc = " This is the Monitoring report which the xWR device sends to the host, containing the"]
#[doc = " measured RX mixer input voltage swing values. The xWR device sends this to host at the"]
#[doc = " programmed periodicity or when failure occurs, as programmed by the configuration API SB."]
#[doc = " Event: RL_RF_AE_MON_RX_MIXER_IN_PWR_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonRxMixrInPwrRep {
    #[doc = " @brief Status flags indicating pass fail results corresponding \\n"]
    #[doc = "to various threshold checks under this monitor. \\n"]
    #[doc = "Bit      STATUS_FLAG for monitor \\n"]
    #[doc = "0        STATUS_MIXER_IN_POWER_RX0 \\n"]
    #[doc = "1        STATUS_MIXER_IN_POWER_RX1 \\n"]
    #[doc = "2        STATUS_MIXER_IN_POWER_RX2 \\n"]
    #[doc = "3        STATUS_MIXER_IN_POWER_RX3 \\n"]
    #[doc = "15:4     RESERVED          \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  Profile Index for which this monitoring report applies."]
    pub profIndex: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt16_t,
    #[doc = " @brief The measured RX mixer input voltage swing values are \\n"]
    #[doc = "reported here. The byte location of the value for each \\n"]
    #[doc = "receivers is tabulated here- \\n"]
    #[doc = "Byte location \\n"]
    #[doc = "Rx0  0  \\n"]
    #[doc = "Rx1  1  \\n"]
    #[doc = "Rx2  2  \\n"]
    #[doc = "Rx3  3  \\n"]
    #[doc = "1 LSB = 1800 mV/256, unsigned number \\n"]
    #[doc = "Only the entries of enabled RX channels are valid. \\n"]
    pub rxMixInVolt: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved2: rlUInt32_t,
    #[doc = " @brief This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon exceeding allotted bit width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonRxMixrInPwrRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonRxMixrInPwrRep>(),
        20usize,
        concat!("Size of: ", stringify!(rlMonRxMixrInPwrRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonRxMixrInPwrRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonRxMixrInPwrRep))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonRxMixrInPwrRep>())).statusFlags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxMixrInPwrRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxMixrInPwrRep>())).errorCode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxMixrInPwrRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxMixrInPwrRep>())).profIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxMixrInPwrRep),
            "::",
            stringify!(profIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxMixrInPwrRep>())).reserved0 as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxMixrInPwrRep),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxMixrInPwrRep>())).reserved1 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxMixrInPwrRep),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonRxMixrInPwrRep>())).rxMixInVolt as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxMixrInPwrRep),
            "::",
            stringify!(rxMixInVolt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxMixrInPwrRep>())).reserved2 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxMixrInPwrRep),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMonRxMixrInPwrRep>())).timeStamp as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonRxMixrInPwrRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonRxMixrInPwrRep_t = rlMonRxMixrInPwrRep;
#[doc = " \\brief"]
#[doc = " This is a Non live Monitoring report which device sends to the host, containing information"]
#[doc = " related to measured frequency error during the monitoring chirp for two profiles"]
#[doc = " configurations. The device sends this to host at the programmed periodicity or when failure"]
#[doc = " occurs, as programmed by the configuration API SB."]
#[doc = " This is a new feature addition in xWR6843 device only."]
#[doc = " Event: RL_RF_AE_MON_SYNTH_FREQ_NONLIVE_REPORT"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMonSynthFreqNonLiveRep {
    #[doc = " @brief Status flags indicating pass fail results corresponding \\n"]
    #[doc = "to various threshold checks under this monitor. \\n"]
    #[doc = "Bit      STATUS_FLAG for monitor \\n"]
    #[doc = "0        VCO1_SYNTH_FREQ_ERR_STATUS \\n"]
    #[doc = "1        VCO2_SYNTH_FREQ_ERR_STATUS \\n"]
    #[doc = "15:2     RESERVED          \\n"]
    #[doc = "0 - FAIL or check wasn't done, 1 - PASS \\n"]
    pub statusFlags: rlUInt16_t,
    #[doc = " @brief Indicates any error reported during monitoring Value of 0 indicates no error"]
    pub errorCode: rlUInt16_t,
    #[doc = " @brief  VCO1 Profile index for which this monitoring report applies."]
    pub profIndex0: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt16_t,
    #[doc = " @brief  This field indicates the maximum instantaneous frequency error measured during"]
    #[doc = "the monitoring chirp for which frequency monitoring has been enabled in the"]
    #[doc = "previous monitoring period for VCO1 profile. \\n"]
    #[doc = "Bits    Parameter \\n"]
    #[doc = "31:0    Maximum frequency error value, signed number. 1 LSB = 1kHz. \\n"]
    pub maxFreqErVal0: rlInt32_t,
    #[doc = " @brief  This field indicates the number of times during chirping in the previous"]
    #[doc = "monitoring period in which the measured frequency error violated the allowed"]
    #[doc = "threshold for VCO1 profile. Frequency error threshold violation is"]
    #[doc = "counted every 10 ns. \\n"]
    #[doc = "Bits    Parameter \\n"]
    #[doc = "31:19   RESERVED \\n"]
    #[doc = "18:0    Failure count, unsigned number. \\n"]
    pub freqFailCnt0: rlUInt32_t,
    #[doc = " @brief  This field indicates the time at which error occurred for VCO1 profile w.r.t. knee"]
    #[doc = "of the ramp. \\n"]
    #[doc = "1 LSB = 10ns \\n"]
    pub maxFreqFailTime0: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved2: rlUInt32_t,
    #[doc = " @brief  VCO2 Profile index for which this monitoring report applies."]
    pub profIndex1: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved3: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved4: rlUInt16_t,
    #[doc = " @brief  This field indicates the maximum instantaneous frequency error measured during"]
    #[doc = "the monitoring chirp for which frequency monitoring has been enabled in the"]
    #[doc = "previous monitoring period for VCO2 profile. \\n"]
    #[doc = "Bits    Parameter \\n"]
    #[doc = "31:0    Maximum frequency error value, signed number. 1 LSB = 1kHz. \\n"]
    pub maxFreqErVal1: rlInt32_t,
    #[doc = " @brief  This field indicates the number of times during chirping in the previous"]
    #[doc = "monitoring period in which the measured frequency error violated the allowed"]
    #[doc = "threshold for VCO2 profile. Frequency error threshold violation is"]
    #[doc = "counted every 10 ns. \\n"]
    #[doc = "Bits    Parameter \\n"]
    #[doc = "31:19   RESERVED \\n"]
    #[doc = "18:0    Failure count, unsigned number. \\n"]
    pub freqFailCnt1: rlUInt32_t,
    #[doc = " @brief  This field indicates the time at which error occurred for VCO2 profile w.r.t. knee"]
    #[doc = "of the ramp. \\n"]
    #[doc = "1 LSB = 10ns \\n"]
    pub maxFreqFailTime1: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved5: rlUInt32_t,
    #[doc = " @brief This field indicates when the last monitoring in the enabled set was performed. \\n"]
    #[doc = "1 LSB = 1 millisecond (the stamp rolls over upon exceeding allotted bit width) \\n"]
    pub timeStamp: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlMonSynthFreqNonLiveRep() {
    assert_eq!(
        ::core::mem::size_of::<rlMonSynthFreqNonLiveRep>(),
        48usize,
        concat!("Size of: ", stringify!(rlMonSynthFreqNonLiveRep))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMonSynthFreqNonLiveRep>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMonSynthFreqNonLiveRep))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).statusFlags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(statusFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).errorCode as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).profIndex0 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(profIndex0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).reserved0 as *const _ as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).reserved1 as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).maxFreqErVal0 as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(maxFreqErVal0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).freqFailCnt0 as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(freqFailCnt0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).maxFreqFailTime0 as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(maxFreqFailTime0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).reserved2 as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).profIndex1 as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(profIndex1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).reserved3 as *const _ as usize
        },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).reserved4 as *const _ as usize
        },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(reserved4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).maxFreqErVal1 as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(maxFreqErVal1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).freqFailCnt1 as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(freqFailCnt1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).maxFreqFailTime1 as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(maxFreqFailTime1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).reserved5 as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(reserved5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlMonSynthFreqNonLiveRep>())).timeStamp as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMonSynthFreqNonLiveRep),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub type rlMonSynthFreqNonLiveRep_t = rlMonSynthFreqNonLiveRep;
#[doc = " \\brief"]
#[doc = " This is an error status report internally generated from mmWaveLink when it finds any"]
#[doc = " issue with the recieved message or communication. Currently errorVal can be"]
#[doc = " RL_RET_CODE_CRC_FAILED, RL_RET_CODE_CHKSUM_FAILED or RL_RET_CODE_HOSTIRQ_TIMEOUT."]
#[doc = " Event: RL_MMWL_AE_MISMATCH_REPORT, RL_MMWL_AE_INTERNALERR_REPORT"]
#[doc = " ErroVal: RL_RET_CODE_CRC_FAILED, RL_RET_CODE_CHKSUM_FAILED or RL_RET_CODE_HOSTIRQ_TIMEOUT"]
#[doc = "          for RL_MMWL_AE_MISMATCH_REPORT Event and RL_RET_CODE_RADAR_OSIF_ERROR for"]
#[doc = "          RL_MMWL_AE_INTERNALERR_REPORT Event"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMmwlErrorStatus {
    pub errorVal: rlInt32_t,
}
#[test]
fn bindgen_test_layout_rlMmwlErrorStatus() {
    assert_eq!(
        ::core::mem::size_of::<rlMmwlErrorStatus>(),
        4usize,
        concat!("Size of: ", stringify!(rlMmwlErrorStatus))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMmwlErrorStatus>(),
        4usize,
        concat!("Alignment of ", stringify!(rlMmwlErrorStatus))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMmwlErrorStatus>())).errorVal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMmwlErrorStatus),
            "::",
            stringify!(errorVal)
        )
    );
}
pub type rlMmwlErrorStatus_t = rlMmwlErrorStatus;
#[doc = " \\brief"]
#[doc = " mmWaveLink API Error Type"]
pub type rlSysNRespType_t = rlUInt16_t;
#[doc = " \\brief"]
#[doc = " mmWaveLink API Error Sub block structure"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlErrorResp {
    #[doc = "@ brief  16 bits error type"]
    pub errorType: rlSysNRespType_t,
    #[doc = "@ brief  16 bits SBC ID"]
    pub sbcID: rlUInt16_t,
}
#[test]
fn bindgen_test_layout_rlErrorResp() {
    assert_eq!(
        ::core::mem::size_of::<rlErrorResp>(),
        4usize,
        concat!("Size of: ", stringify!(rlErrorResp))
    );
    assert_eq!(
        ::core::mem::align_of::<rlErrorResp>(),
        2usize,
        concat!("Alignment of ", stringify!(rlErrorResp))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlErrorResp>())).errorType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlErrorResp),
            "::",
            stringify!(errorType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlErrorResp>())).sbcID as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlErrorResp),
            "::",
            stringify!(sbcID)
        )
    );
}
pub type rlErrorResp_t = rlErrorResp;
#[doc = " \\brief"]
#[doc = " RHCP SYNC Pattern Structure"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlSyncPattern {
    pub sync1: rlUInt16_t,
    pub sync2: rlUInt16_t,
}
#[test]
fn bindgen_test_layout_rlSyncPattern() {
    assert_eq!(
        ::core::mem::size_of::<rlSyncPattern>(),
        4usize,
        concat!("Size of: ", stringify!(rlSyncPattern))
    );
    assert_eq!(
        ::core::mem::align_of::<rlSyncPattern>(),
        2usize,
        concat!("Alignment of ", stringify!(rlSyncPattern))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlSyncPattern>())).sync1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlSyncPattern),
            "::",
            stringify!(sync1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlSyncPattern>())).sync2 as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlSyncPattern),
            "::",
            stringify!(sync2)
        )
    );
}
pub type rlSyncPattern_t = rlSyncPattern;
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlOpcode {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
}
#[test]
fn bindgen_test_layout_rlOpcode() {
    assert_eq!(
        ::core::mem::size_of::<rlOpcode>(),
        2usize,
        concat!("Size of: ", stringify!(rlOpcode))
    );
    assert_eq!(
        ::core::mem::align_of::<rlOpcode>(),
        2usize,
        concat!("Alignment of ", stringify!(rlOpcode))
    );
}
impl rlOpcode {
    #[inline]
    pub fn b4Direction(&self) -> rlUInt16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_b4Direction(&mut self, val: rlUInt16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn b2MsgType(&self) -> rlUInt16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_b2MsgType(&mut self, val: rlUInt16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn b10MsgId(&self) -> rlUInt16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 10u8) as u16) }
    }
    #[inline]
    pub fn set_b10MsgId(&mut self, val: rlUInt16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        b4Direction: rlUInt16_t,
        b2MsgType: rlUInt16_t,
        b10MsgId: rlUInt16_t,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let b4Direction: u16 = unsafe { ::core::mem::transmute(b4Direction) };
            b4Direction as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let b2MsgType: u16 = unsafe { ::core::mem::transmute(b2MsgType) };
            b2MsgType as u64
        });
        __bindgen_bitfield_unit.set(6usize, 10u8, {
            let b10MsgId: u16 = unsafe { ::core::mem::transmute(b10MsgId) };
            b10MsgId as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type rlOpcode_t = rlOpcode;
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlHdrFlags {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
}
#[test]
fn bindgen_test_layout_rlHdrFlags() {
    assert_eq!(
        ::core::mem::size_of::<rlHdrFlags>(),
        2usize,
        concat!("Size of: ", stringify!(rlHdrFlags))
    );
    assert_eq!(
        ::core::mem::align_of::<rlHdrFlags>(),
        2usize,
        concat!("Alignment of ", stringify!(rlHdrFlags))
    );
}
impl rlHdrFlags {
    #[inline]
    pub fn b2RetryFlag(&self) -> rlUInt16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_b2RetryFlag(&mut self, val: rlUInt16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn b2AckFlag(&self) -> rlUInt16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_b2AckFlag(&mut self, val: rlUInt16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn b4Version(&self) -> rlUInt16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_b4Version(&mut self, val: rlUInt16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn b2Crc(&self) -> rlUInt16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_b2Crc(&mut self, val: rlUInt16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn b2CrcLen(&self) -> rlUInt16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_b2CrcLen(&mut self, val: rlUInt16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn b4SeqNum(&self) -> rlUInt16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_b4SeqNum(&mut self, val: rlUInt16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        b2RetryFlag: rlUInt16_t,
        b2AckFlag: rlUInt16_t,
        b4Version: rlUInt16_t,
        b2Crc: rlUInt16_t,
        b2CrcLen: rlUInt16_t,
        b4SeqNum: rlUInt16_t,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let b2RetryFlag: u16 = unsafe { ::core::mem::transmute(b2RetryFlag) };
            b2RetryFlag as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let b2AckFlag: u16 = unsafe { ::core::mem::transmute(b2AckFlag) };
            b2AckFlag as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let b4Version: u16 = unsafe { ::core::mem::transmute(b4Version) };
            b4Version as u64
        });
        __bindgen_bitfield_unit.set(8usize, 2u8, {
            let b2Crc: u16 = unsafe { ::core::mem::transmute(b2Crc) };
            b2Crc as u64
        });
        __bindgen_bitfield_unit.set(10usize, 2u8, {
            let b2CrcLen: u16 = unsafe { ::core::mem::transmute(b2CrcLen) };
            b2CrcLen as u64
        });
        __bindgen_bitfield_unit.set(12usize, 4u8, {
            let b4SeqNum: u16 = unsafe { ::core::mem::transmute(b4SeqNum) };
            b4SeqNum as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type rlHdrFlags_t = rlHdrFlags;
#[doc = " \\brief"]
#[doc = " RHCP protocol header structure"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlProtHeader {
    #[doc = " @brief  rlUInt16_t, rlApiActionType,rlApiGetSetType"]
    pub opcode: rlOpcode_t,
    pub len: rlUInt16_t,
    pub flags: rlHdrFlags_t,
    pub remChunks: rlUInt16_t,
    pub nsbc: rlUInt16_t,
    pub chksum: rlUInt16_t,
}
#[test]
fn bindgen_test_layout_rlProtHeader() {
    assert_eq!(
        ::core::mem::size_of::<rlProtHeader>(),
        12usize,
        concat!("Size of: ", stringify!(rlProtHeader))
    );
    assert_eq!(
        ::core::mem::align_of::<rlProtHeader>(),
        2usize,
        concat!("Alignment of ", stringify!(rlProtHeader))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlProtHeader>())).opcode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlProtHeader),
            "::",
            stringify!(opcode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlProtHeader>())).len as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlProtHeader),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlProtHeader>())).flags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlProtHeader),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlProtHeader>())).remChunks as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlProtHeader),
            "::",
            stringify!(remChunks)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlProtHeader>())).nsbc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlProtHeader),
            "::",
            stringify!(nsbc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlProtHeader>())).chksum as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(rlProtHeader),
            "::",
            stringify!(chksum)
        )
    );
}
pub type rlProtHeader_t = rlProtHeader;
#[doc = " \\brief"]
#[doc = " RHCP message structure"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rlRhcpMsg {
    pub syncPattern: rlSyncPattern_t,
    pub hdr: rlProtHeader_t,
    pub payload: [rlUInt8_t; 240usize],
}
#[test]
fn bindgen_test_layout_rlRhcpMsg() {
    assert_eq!(
        ::core::mem::size_of::<rlRhcpMsg>(),
        256usize,
        concat!("Size of: ", stringify!(rlRhcpMsg))
    );
    assert_eq!(
        ::core::mem::align_of::<rlRhcpMsg>(),
        2usize,
        concat!("Alignment of ", stringify!(rlRhcpMsg))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRhcpMsg>())).syncPattern as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRhcpMsg),
            "::",
            stringify!(syncPattern)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRhcpMsg>())).hdr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRhcpMsg),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlRhcpMsg>())).payload as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rlRhcpMsg),
            "::",
            stringify!(payload)
        )
    );
}
impl Default for rlRhcpMsg {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
pub type rlRhcpMsg_t = rlRhcpMsg;
#[doc = " \\brief"]
#[doc = " File Dowload data structure"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rlFileData {
    #[doc = " @brief  File data length"]
    pub chunkLen: rlUInt32_t,
    #[doc = " @brief  File data buffer"]
    pub fData: [rlUInt16_t; 116usize],
}
#[test]
fn bindgen_test_layout_rlFileData() {
    assert_eq!(
        ::core::mem::size_of::<rlFileData>(),
        236usize,
        concat!("Size of: ", stringify!(rlFileData))
    );
    assert_eq!(
        ::core::mem::align_of::<rlFileData>(),
        4usize,
        concat!("Alignment of ", stringify!(rlFileData))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFileData>())).chunkLen as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFileData),
            "::",
            stringify!(chunkLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlFileData>())).fData as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlFileData),
            "::",
            stringify!(fData)
        )
    );
}
impl Default for rlFileData {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
pub type rlFileData_t = rlFileData;
#[doc = " \\brief"]
#[doc = " mmwave radar device MCU Clock output"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlMcuClkCfg {
    #[doc = " @brief  This field controls the enable - disable of the MCU clock. \\n"]
    #[doc = "Value    Description \\n"]
    #[doc = "0x0      Disable MCU clock \\n"]
    #[doc = "0x1      Enable MCU clock  \\n"]
    pub mcuClkCtrl: rlUInt8_t,
    #[doc = " @brief  This field specifies the source of the MCU clock. Applicable only in case of MCU \\n"]
    #[doc = "clock enable.Else ignored. \\n"]
    #[doc = "Value   Description \\n"]
    #[doc = "0x0     XTAL(as connected to the device) \\n"]
    #[doc = "0x1     RESERVED \\n"]
    #[doc = "0x2     600MHz PLL divided clock \\n"]
    pub mcuClkSrc: rlUInt8_t,
    #[doc = " @brief  This field specifies the division factor to be applied to source clock. \\n"]
    #[doc = "Applicable only in case of MCU \\n"]
    #[doc = "clock enable. Else ignored. \\n"]
    #[doc = "Value     Description \\n"]
    #[doc = "0x0       Divide by 1 \\n"]
    #[doc = "0x1       Divide by 2 \\n"]
    #[doc = "...       ... \\n"]
    #[doc = "0xFF      Divide by 256 \\n"]
    pub srcClkDiv: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt8_t,
}
#[test]
fn bindgen_test_layout_rlMcuClkCfg() {
    assert_eq!(
        ::core::mem::size_of::<rlMcuClkCfg>(),
        4usize,
        concat!("Size of: ", stringify!(rlMcuClkCfg))
    );
    assert_eq!(
        ::core::mem::align_of::<rlMcuClkCfg>(),
        1usize,
        concat!("Alignment of ", stringify!(rlMcuClkCfg))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMcuClkCfg>())).mcuClkCtrl as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMcuClkCfg),
            "::",
            stringify!(mcuClkCtrl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMcuClkCfg>())).mcuClkSrc as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMcuClkCfg),
            "::",
            stringify!(mcuClkSrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMcuClkCfg>())).srcClkDiv as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMcuClkCfg),
            "::",
            stringify!(srcClkDiv)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlMcuClkCfg>())).reserved as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(rlMcuClkCfg),
            "::",
            stringify!(reserved)
        )
    );
}
pub type rlMcuClkCfg_t = rlMcuClkCfg;
#[doc = " \\brief"]
#[doc = " mmwave radar device PMIC Clock output"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlPmicClkCfg {
    #[doc = " @brief  This field controls the enable - disable of the PMIC clock. \\n"]
    #[doc = "Value  Description \\n"]
    #[doc = "0x0    Disable PMIC clock \\n"]
    #[doc = "0x1    Enable PMIC clock \\n"]
    pub pmicClkCtrl: rlUInt8_t,
    #[doc = " @brief  This field specifies the source of the PMIC clock. Applicable only in case of \\n"]
    #[doc = "PMIC clock enable. Else ignored. \\n"]
    #[doc = "Value   Description \\n"]
    #[doc = "0x0     XTAL (as connected to the device) \\n"]
    #[doc = "0x2     600MHz PLL divided clock \\n"]
    pub pmicClkSrc: rlUInt8_t,
    #[doc = " @brief  This field specifies the division factor to be applie to source clock. \\n"]
    #[doc = "Applicable only in case of PMIC clock \\n"]
    #[doc = "enable. Else ignored. \\n"]
    #[doc = "Value   Description \\n"]
    #[doc = "0x0     Divide by 1 (Not supported) \\n"]
    #[doc = "0x1     Divide by 2 \\n"]
    #[doc = "...     ... \\n"]
    #[doc = "0xFF    Divide by 256 \\n"]
    pub srcClkDiv: rlUInt8_t,
    #[doc = " @brief  This field specifies the mode of operation for the PMIC clock generation. \\n"]
    #[doc = "Applicable only in case of PMIC clock \\n"]
    #[doc = "enable. Else ignored. \\n"]
    #[doc = "Value   Description \\n"]
    #[doc = "0x0     Continuous mode (free running mode where the frequency \\n"]
    #[doc = "change/jump is triggered based on configured number of \\n"]
    #[doc = "internal clock ticks) \\n"]
    #[doc = "0x1     Chirp-to-Chirp staircase mode (frequency change/jump is \\n"]
    #[doc = "triggered at every chirp boundary) \\n"]
    pub modeSel: rlUInt8_t,
    #[doc = " @brief  Applicable only in case of PMIC clock enable. Else ignored. \\n"]
    #[doc = "Bit[25:0] - Frequency slope value to be applied in [8.18] format. \\n"]
    #[doc = "1 LSB = 1/218 \\n"]
    #[doc = "In continuous mode this value is accumulated every PMIC clock tick \\n"]
    #[doc = "with the seed as MIN_NDIV_VAL till MAX_NDIV_VAL is reached \\n"]
    #[doc = "In the stair case mode this value is accumulated every chirp with the \\n"]
    #[doc = "seed as MIN_NDIV_VAL till MAX_NDIV_VAL is reached \\n"]
    pub freqSlope: rlUInt32_t,
    #[doc = " @brief  Applicable only in case of PMIC clock enable. Else ignored. Min allowed divider \\n"]
    #[doc = "value (depends upon the highest desired clock frequency) \\n"]
    pub minNdivVal: rlUInt8_t,
    #[doc = " @brief  Applicable only in case of PMIC clock enable. Else ignored. Max allowed divider \\n"]
    #[doc = "value (depends upon the lowest desired clock frequency) \\n"]
    pub maxNdivVal: rlUInt8_t,
    #[doc = " @brief  Applicable only in case of PMIC clock enable. Else ignored. This field controls \\n"]
    #[doc = "the enable-disable of the clock dithering. Adds a pseudo random real number \\n"]
    #[doc = "(0 or 1) to the accumulated divide value. Hence it brings a random dithering \\n"]
    #[doc = "of 1 LSB. \\n"]
    #[doc = "Value   Description \\n"]
    #[doc = "0x0     Clock dithering disabled \\n"]
    #[doc = "0x1     Clock dithering enabled \\n"]
    pub clkDitherEn: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt8_t,
}
#[test]
fn bindgen_test_layout_rlPmicClkCfg() {
    assert_eq!(
        ::core::mem::size_of::<rlPmicClkCfg>(),
        12usize,
        concat!("Size of: ", stringify!(rlPmicClkCfg))
    );
    assert_eq!(
        ::core::mem::align_of::<rlPmicClkCfg>(),
        4usize,
        concat!("Alignment of ", stringify!(rlPmicClkCfg))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlPmicClkCfg>())).pmicClkCtrl as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlPmicClkCfg),
            "::",
            stringify!(pmicClkCtrl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlPmicClkCfg>())).pmicClkSrc as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rlPmicClkCfg),
            "::",
            stringify!(pmicClkSrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlPmicClkCfg>())).srcClkDiv as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlPmicClkCfg),
            "::",
            stringify!(srcClkDiv)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlPmicClkCfg>())).modeSel as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(rlPmicClkCfg),
            "::",
            stringify!(modeSel)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlPmicClkCfg>())).freqSlope as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlPmicClkCfg),
            "::",
            stringify!(freqSlope)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlPmicClkCfg>())).minNdivVal as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlPmicClkCfg),
            "::",
            stringify!(minNdivVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlPmicClkCfg>())).maxNdivVal as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(rlPmicClkCfg),
            "::",
            stringify!(maxNdivVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlPmicClkCfg>())).clkDitherEn as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(rlPmicClkCfg),
            "::",
            stringify!(clkDitherEn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlPmicClkCfg>())).reserved as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(rlPmicClkCfg),
            "::",
            stringify!(reserved)
        )
    );
}
pub type rlPmicClkCfg_t = rlPmicClkCfg;
#[doc = " \\brief"]
#[doc = " mmwave radar device latent fault test"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rllatentFault {
    #[doc = " @brief  Bits    Definition \\n"]
    #[doc = "0       RESERVED \\n"]
    #[doc = "1       DMA self-test \\n"]
    #[doc = "2       RESERVED \\n"]
    #[doc = "3       RTI self-test \\n"]
    #[doc = "4       RESERVED \\n"]
    #[doc = "5       EDMA self-test \\n"]
    #[doc = "6       CRC self-test \\n"]
    #[doc = "7       VIM self-test \\n"]
    #[doc = "8       RESERVED \\n"]
    #[doc = "9       Mailbox self-test \\n"]
    #[doc = "10      RESERVED \\n"]
    #[doc = "11      RESERVED \\n"]
    #[doc = "12      Generating NERROR \\n"]
    #[doc = "13      MibSPI single bit error test \\n"]
    #[doc = "14      MibSPI double bit error test \\n"]
    #[doc = "15      DMA Parity error \\n"]
    #[doc = "16      TCMA RAM single bit errors (Not supported, refer latest release note) \\n"]
    #[doc = "17      TCMB RAM single bit errors (Not supported, refer latest release note) \\n"]
    #[doc = "18      TCMA RAM double bit errors (Not supported, refer latest release note) \\n"]
    #[doc = "19      TCMB RAM double bit errors (Not supported, refer latest release note) \\n"]
    #[doc = "20      TCMA RAM parity errors (Not supported, refer latest release note) \\n"]
    #[doc = "21      TCMB RAM parity errors (Not supported, refer latest release note) \\n"]
    #[doc = "22      RESERVED \\n"]
    #[doc = "23      RESERVED \\n"]
    #[doc = "24      DMA MPU Region tests \\n"]
    #[doc = "25      MSS Mailbox Single bit errors \\n"]
    #[doc = "26      MSS Mailbox double bit errors \\n"]
    #[doc = "27      radarSS Mailbox Single bit errors \\n"]
    #[doc = "28      radarSS Mailbox double bit errors \\n"]
    #[doc = "29      EDMA MPU test \\n"]
    #[doc = "30      EDMA parity test \\n"]
    #[doc = "31      CSI2 parity test \\n"]
    pub testEn1: rlUInt32_t,
    #[doc = " @brief  Bits    Definition \\n"]
    #[doc = "0       RESERVED \\n"]
    #[doc = "1       RESERVED \\n"]
    #[doc = "2       RESERVED \\n"]
    #[doc = "3       VIM RAM parity test \\n"]
    #[doc = "4       SCI boot time test  \\n"]
    #[doc = "31:5    RESERVED \\n"]
    pub testEn2: rlUInt32_t,
    #[doc = " @brief  Value  Definition \\n"]
    #[doc = "0      Report is sent after test completion \\n"]
    #[doc = "1      Report is send only upon a failure \\n"]
    pub repMode: rlUInt8_t,
    #[doc = " @brief  Value  Definition \\n"]
    #[doc = "0      Production mode. Latent faults are tested and any failures are reported \\n"]
    #[doc = "1      Characterization mode. Faults are injected and failures are reported which \\n"]
    #[doc = "allows testing of the failure reporting \\n"]
    pub testMode: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt16_t,
}
#[test]
fn bindgen_test_layout_rllatentFault() {
    assert_eq!(
        ::core::mem::size_of::<rllatentFault>(),
        12usize,
        concat!("Size of: ", stringify!(rllatentFault))
    );
    assert_eq!(
        ::core::mem::align_of::<rllatentFault>(),
        4usize,
        concat!("Alignment of ", stringify!(rllatentFault))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rllatentFault>())).testEn1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rllatentFault),
            "::",
            stringify!(testEn1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rllatentFault>())).testEn2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rllatentFault),
            "::",
            stringify!(testEn2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rllatentFault>())).repMode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rllatentFault),
            "::",
            stringify!(repMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rllatentFault>())).testMode as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(rllatentFault),
            "::",
            stringify!(testMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rllatentFault>())).reserved as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(rllatentFault),
            "::",
            stringify!(reserved)
        )
    );
}
pub type rllatentFault_t = rllatentFault;
#[doc = " \\brief"]
#[doc = " mmwave radar periodicity test config"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlperiodicTest {
    #[doc = " @brief  1 LSB = 1 ms Periodicity at which tests need to be run \\n"]
    #[doc = "Minimum value is 40 ms \\n"]
    #[doc = "Maximum value is 150ms \\n"]
    #[doc = "@note : MSS Windowed WDT period is set to this periodicity and WDT can not \\n"]
    #[doc = "support period more than 150ms. \\n"]
    #[doc = ""]
    pub periodicity: rlUInt32_t,
    #[doc = " @brief  Bit value definition: 1 - Enable, 0 - Disable \\n"]
    #[doc = "Bit Monitoring type \\n"]
    #[doc = "0   PERIODIC_CONFG_REGISTER_READ_EN \\n"]
    #[doc = "1   ESM_MONITORING_EN \\n"]
    #[doc = "31:2  RESERVED \\n"]
    pub testEn: rlUInt32_t,
    #[doc = " @brief  Value   Definition \\n"]
    #[doc = "0      Report is sent every monitoring period \\n"]
    #[doc = "1      Report is sent only on a failure \\n"]
    pub repMode: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved0: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved1: rlUInt16_t,
}
#[test]
fn bindgen_test_layout_rlperiodicTest() {
    assert_eq!(
        ::core::mem::size_of::<rlperiodicTest>(),
        12usize,
        concat!("Size of: ", stringify!(rlperiodicTest))
    );
    assert_eq!(
        ::core::mem::align_of::<rlperiodicTest>(),
        4usize,
        concat!("Alignment of ", stringify!(rlperiodicTest))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlperiodicTest>())).periodicity as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlperiodicTest),
            "::",
            stringify!(periodicity)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlperiodicTest>())).testEn as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlperiodicTest),
            "::",
            stringify!(testEn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlperiodicTest>())).repMode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlperiodicTest),
            "::",
            stringify!(repMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlperiodicTest>())).reserved0 as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(rlperiodicTest),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlperiodicTest>())).reserved1 as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(rlperiodicTest),
            "::",
            stringify!(reserved1)
        )
    );
}
pub type rlperiodicTest_t = rlperiodicTest;
#[doc = " \\brief"]
#[doc = " mmwave radar test pattern config"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rltestPattern {
    #[doc = " @brief  This field controls the enable-disable of the generation of the test pattern. \\n"]
    #[doc = "Value   Description \\n"]
    #[doc = "0x0     Disable test pattern generation \\n"]
    #[doc = "0x1     Enable test pattern generation \\n"]
    pub testPatGenCtrl: rlUInt8_t,
    #[doc = " @brief  Number of system clocks (200 MHz) between successive samples for the test pattern \\n"]
    #[doc = "gen. Applicable only in case of Test pattern enable. Else ignored. \\n"]
    pub testPatGenTime: rlUInt8_t,
    #[doc = " @brief  Number of ADC samples to capture for each RX"]
    #[doc = "Valid range: 64 to MAX_NUM_SAMPLES,"]
    #[doc = "Where MAX_NUM_SAMPLES is such that all the enabled RX channels data fits into \\n"]
    #[doc = "16 kB memory, with each sample consuming 2 bytes for real ADC output case and 4 \\n"]
    #[doc = "bytes for complex 1x and complex 2x ADC output cases. For example:"]
    #[doc = "4 RX, Complex ADC output -> MAX_NUM_SAMPLES = 1024"]
    #[doc = "4 RX, Real ADC output -> MAX_NUM_SAMPLES = 2048"]
    #[doc = "2 RX, Complex ADC output -> MAX_NUM_SAMPLES = 2048"]
    #[doc = "2 RX, Real ADC output -> MAX_NUM_SAMPLES = 4096"]
    pub testPatrnPktSize: rlUInt16_t,
    #[doc = " @brief Number of test pattern packets to send, for infinite packets set it to 0"]
    pub numTestPtrnPkts: rlUInt32_t,
    #[doc = " @brief  This field specifies the values for Rx0, I channel. Applicable only in case of \\n"]
    #[doc = "test pattern enable. Else ignored. Bits    Description \\n"]
    #[doc = "[15:0]  Start offset value to be used for the first sample for the test \\n"]
    #[doc = "pattern data  \\n"]
    #[doc = "[31:16] Value to be added for each successive sample for the test pattern \\n"]
    #[doc = "data \\n"]
    pub testPatRx0Icfg: rlUInt32_t,
    #[doc = " @brief  This field specifies the values for Rx0, Q channel. Applicable only in case of \\n"]
    #[doc = "test pattern enable. Else ignored. \\n"]
    #[doc = "Bits    Description \\n"]
    #[doc = "[15:0]  Start offset value to be used for the first sample for the test \\n"]
    #[doc = "pattern data"]
    #[doc = "[31:16] Value to be added for each successive sample for the test pattern \\n"]
    #[doc = "data \\n"]
    pub testPatRx0Qcfg: rlUInt32_t,
    #[doc = " @brief  This field specifies the values for Rx1, I channel. Applicable only in case of \\n"]
    #[doc = "test pattern enable. Else ignored. \\n"]
    #[doc = "Bits    Description \\n"]
    #[doc = "[15:0]  Start offset value to be used for the first sample for the test \\n"]
    #[doc = "pattern data"]
    #[doc = "[31:16] Value to be added for each successive sample for the test pattern \\n"]
    #[doc = "data"]
    pub testPatRx1Icfg: rlUInt32_t,
    #[doc = " @brief  This field specifies the values for Rx1, Q channel. \\n"]
    #[doc = "Applicable only in case of test pattern enable. Else ignored. \\n"]
    #[doc = "Bits    Description \\n"]
    #[doc = "[15:0]  Start offset value to be used for the first sample for the test \\n"]
    #[doc = "pattern data"]
    #[doc = "[31:16] Value to be added for each successive sample for the test pattern \\n"]
    #[doc = "data"]
    pub testPatRx1Qcfg: rlUInt32_t,
    #[doc = " @brief  This field specifies the values for Rx2, I channel. \\n"]
    #[doc = "Applicable only in case of test pattern enable. Else ignored. \\n"]
    #[doc = "Bits    Description \\n"]
    #[doc = "[15:0]  Start offset value to be used for the first sample for the test \\n"]
    #[doc = "pattern data"]
    #[doc = "[31:16] Value to be added for each successive sample for the test pattern \\n"]
    #[doc = "data"]
    pub testPatRx2Icfg: rlUInt32_t,
    #[doc = " @brief  This field specifies the values for Rx2, Q channel. \\n"]
    #[doc = "Applicable only in case of test pattern enable. Else ignored. \\n"]
    #[doc = "Bits    Description \\n"]
    #[doc = "[15:0]  Start offset value to be used for the first sample for the test \\n"]
    #[doc = "pattern data"]
    #[doc = "[31:16] Value to be added for each successive sample for the test pattern \\n"]
    #[doc = "data"]
    pub testPatRx2Qcfg: rlUInt32_t,
    #[doc = " @brief  This field specifies the values for Rx3, I channel. \\n"]
    #[doc = "Applicable only in case of test pattern enable. Else ignored. \\n"]
    #[doc = "Bits    Description \\n"]
    #[doc = "[15:0]  Start offset value to be used for the first sample for the test \\n"]
    #[doc = "pattern data"]
    #[doc = "[31:16] Value to be added for each successive sample for the test pattern \\n"]
    #[doc = "data"]
    pub testPatRx3Icfg: rlUInt32_t,
    #[doc = " @brief  This field specifies the values for Rx3, Q channel. \\n"]
    #[doc = "Applicable only in case of test pattern enable. Else ignored. \\n"]
    #[doc = "Bits    Description \\n"]
    #[doc = "[15:0]  Start offset value to be used for the first sample for the test \\n"]
    #[doc = "pattern data"]
    #[doc = "[31:16] Value to be added for each successive sample for the test pattern \\n"]
    #[doc = "data"]
    pub testPatRx3Qcfg: rlUInt32_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rltestPattern() {
    assert_eq!(
        ::core::mem::size_of::<rltestPattern>(),
        44usize,
        concat!("Size of: ", stringify!(rltestPattern))
    );
    assert_eq!(
        ::core::mem::align_of::<rltestPattern>(),
        4usize,
        concat!("Alignment of ", stringify!(rltestPattern))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rltestPattern>())).testPatGenCtrl as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rltestPattern),
            "::",
            stringify!(testPatGenCtrl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rltestPattern>())).testPatGenTime as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rltestPattern),
            "::",
            stringify!(testPatGenTime)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rltestPattern>())).testPatrnPktSize as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rltestPattern),
            "::",
            stringify!(testPatrnPktSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rltestPattern>())).numTestPtrnPkts as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rltestPattern),
            "::",
            stringify!(numTestPtrnPkts)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rltestPattern>())).testPatRx0Icfg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rltestPattern),
            "::",
            stringify!(testPatRx0Icfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rltestPattern>())).testPatRx0Qcfg as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rltestPattern),
            "::",
            stringify!(testPatRx0Qcfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rltestPattern>())).testPatRx1Icfg as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rltestPattern),
            "::",
            stringify!(testPatRx1Icfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rltestPattern>())).testPatRx1Qcfg as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rltestPattern),
            "::",
            stringify!(testPatRx1Qcfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rltestPattern>())).testPatRx2Icfg as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rltestPattern),
            "::",
            stringify!(testPatRx2Icfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rltestPattern>())).testPatRx2Qcfg as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rltestPattern),
            "::",
            stringify!(testPatRx2Qcfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rltestPattern>())).testPatRx3Icfg as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rltestPattern),
            "::",
            stringify!(testPatRx3Icfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rltestPattern>())).testPatRx3Qcfg as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(rltestPattern),
            "::",
            stringify!(testPatRx3Qcfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rltestPattern>())).reserved as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rltestPattern),
            "::",
            stringify!(reserved)
        )
    );
}
pub type rltestPattern_t = rltestPattern;
#[doc = " \\brief"]
#[doc = " mmwave radar data format config"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlDevDataFmtCfg {
    #[doc = " @brief  RX Channel Bitmap \\n"]
    #[doc = "b0 RX0 Channel Enable \\n"]
    #[doc = "0 Disable RX Channel 0 \\n"]
    #[doc = "1 Enable RX Channel 0 \\n"]
    #[doc = "b1 RX1 Channel Enable \\n"]
    #[doc = "0 Disable RX Channel 1 \\n"]
    #[doc = "1 Enable RX Channel 1 \\n"]
    #[doc = "b2 RX2 Channel Enable \\n"]
    #[doc = "0 Disable RX Channel 2 \\n"]
    #[doc = "1 Enable RX Channel 2 \\n"]
    #[doc = "b3 RX3 Channel Enable \\n"]
    #[doc = "0 Disable RX Channel 3 \\n"]
    #[doc = "1 Enable RX Channel 3 \\n"]
    pub rxChannelEn: rlUInt16_t,
    #[doc = " @brief  ADC out bits - 0(12 Bits), 1(14 Bits), 2(16 Bits)"]
    pub adcBits: rlUInt16_t,
    #[doc = " @brief  ADC out format - 0(Real), 1(Complex), 2(Complex with Image band), 3(Pseudo Real)"]
    pub adcFmt: rlUInt16_t,
    #[doc = " @brief  I/Q Swap selection for complex outputs \\n"]
    #[doc = "0 Sample interleave mode - I first \\n"]
    #[doc = "1 Sample interleave mode - Q first \\n"]
    #[doc = "others reserved \\n"]
    pub iqSwapSel: rlUInt8_t,
    #[doc = " @brief  Channel interleaving of the samples stored in \\n"]
    #[doc = "the ADC buffer to be transferred out on the data path \\n"]
    #[doc = "0 - Interleaved \\n"]
    #[doc = "1 - Non Interleaved \\n"]
    #[doc = "others reserved \\n"]
    pub chInterleave: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt32_t,
}
#[test]
fn bindgen_test_layout_rlDevDataFmtCfg() {
    assert_eq!(
        ::core::mem::size_of::<rlDevDataFmtCfg>(),
        12usize,
        concat!("Size of: ", stringify!(rlDevDataFmtCfg))
    );
    assert_eq!(
        ::core::mem::align_of::<rlDevDataFmtCfg>(),
        4usize,
        concat!("Alignment of ", stringify!(rlDevDataFmtCfg))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlDevDataFmtCfg>())).rxChannelEn as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDevDataFmtCfg),
            "::",
            stringify!(rxChannelEn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlDevDataFmtCfg>())).adcBits as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDevDataFmtCfg),
            "::",
            stringify!(adcBits)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlDevDataFmtCfg>())).adcFmt as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDevDataFmtCfg),
            "::",
            stringify!(adcFmt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlDevDataFmtCfg>())).iqSwapSel as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDevDataFmtCfg),
            "::",
            stringify!(iqSwapSel)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlDevDataFmtCfg>())).chInterleave as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDevDataFmtCfg),
            "::",
            stringify!(chInterleave)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlDevDataFmtCfg>())).reserved as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDevDataFmtCfg),
            "::",
            stringify!(reserved)
        )
    );
}
pub type rlDevDataFmtCfg_t = rlDevDataFmtCfg;
#[doc = " \\brief"]
#[doc = " mmwave radar data path config."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rlDevDataPathCfg {
    #[doc = " @brief  Data Path Interface, \\n"]
    #[doc = "0x0  CSI2 interface selected \\n"]
    #[doc = "0x1  LVDS interface selected \\n"]
    pub intfSel: rlUInt8_t,
    #[doc = " @brief  Data out Format, \\n"]
    #[doc = "b5:0 Packet 0 content selection \\n"]
    #[doc = "000001 - ADC_DATA_ONLY \\n"]
    #[doc = "000110 - CP_ADC_DATA \\n"]
    #[doc = "001001 - ADC_CP_DATA \\n"]
    #[doc = "110110 - CP_ADC_CQ_DATA \\n"]
    #[doc = "b7:6 Packet 0 virtual channel number (valid only for CSI2) \\n"]
    #[doc = "00   Virtual channel number 0 (Default) \\n"]
    #[doc = "01   Virtual channel number 1 \\n"]
    #[doc = "10   Virtual channel number 2 \\n"]
    #[doc = "11   Virtual channel number 3 \\n"]
    pub transferFmtPkt0: rlUInt8_t,
    #[doc = " @brief  Data out Format, \\n"]
    #[doc = "b5:0 Packet 1 content selection \\n"]
    #[doc = "000000 - Suppress Packet 1 \\n"]
    #[doc = "001110 - CP_CQ_DATA \\n"]
    #[doc = "001011 - CQ_CP_DATA \\n"]
    #[doc = "b7:6 Packet 1 virtual channel number (valid only for CSI2) \\n"]
    #[doc = "00   Virtual channel number 0 (Default) \\n"]
    #[doc = "01   Virtual channel number 1 \\n"]
    #[doc = "10   Virtual channel number 2 \\n"]
    #[doc = "11   Virtual channel number 3 \\n"]
    pub transferFmtPkt1: rlUInt8_t,
    #[doc = " @brief  This field specifies the data size of CQ samples on the lanes. \\n"]
    #[doc = "b1:0   Data size \\n"]
    #[doc = "00    12 bits   \\n"]
    #[doc = "01    14 bits   \\n"]
    #[doc = "10    16 bits   \\n"]
    #[doc = "b7:2    Reserved"]
    pub cqConfig: rlUInt8_t,
    #[doc = " @brief  Number of samples (in 16 bit halfwords) of CQ0 data to be"]
    #[doc = "transferred. Valid range [32 halfwords to 128 halfwords] \\n"]
    #[doc = "Value 0 = Disabled \\n"]
    #[doc = "@note : Ensure that the number of halfwords specified are a multiple"]
    #[doc = "of the number of lanes selected."]
    pub cq0TransSize: rlUInt8_t,
    #[doc = " @brief  Number of samples (in 16 bit halfwords) of CQ1 data to be"]
    #[doc = "transferred. Valid range [32 halfwords to 128 halfwords] \\n"]
    #[doc = "Value 0 = Disabled \\n"]
    #[doc = "@note : Ensure that the number of halfwords specified are a multiple"]
    #[doc = "of the number of lanes selected."]
    pub cq1TransSize: rlUInt8_t,
    #[doc = " @brief  Number of samples (in 16 bit halfwords) of CQ2 data to be"]
    #[doc = "transferred. Valid range [32 halfwords to 128 halfwords] \\n"]
    #[doc = "Value 0 = Disabled \\n"]
    #[doc = "@note : Ensure that the number of halfwords specified are a multiple"]
    #[doc = "of the number of lanes selected."]
    pub cq2TransSize: rlUInt8_t,
    #[doc = " @brief  Reserved for future use"]
    pub reserved: rlUInt8_t,
}
#[test]
fn bindgen_test_layout_rlDevDataPathCfg() {
    assert_eq!(
        ::core::mem::size_of::<rlDevDataPathCfg>(),
        8usize,
        concat!("Size of: ", stringify!(rlDevDataPathCfg))
    );
    assert_eq!(
        ::core::mem::align_of::<rlDevDataPathCfg>(),
        1usize,
        concat!("Alignment of ", stringify!(rlDevDataPathCfg))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rlDevDataPathCfg>())).intfSel as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rlDevDataPathCfg),
            "::",
            stringify!(intfSel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<rlDevDataPathCfg>())).transferFmtPkt0 as *const _ as usize
        },
        1usize,
